20231128T074518--kdoc-59-ecsを使ってrpgを作る__project.org
:properties:
:ID: 20231128T074518
:mtime:    20250921180744
:ctime:    20241028174234
:end:
#+title:      KDOC 59: ECSを使ってRPGを作る
#+date:       [2023-11-28 Tue 07:45]
#+filetags:   :project:
#+identifier: 20231128T074518

* この文書のステータス
:LOGBOOK:
CLOCK: [2024-11-16 Sat 09:22]--[2024-11-16 Sat 09:47] =>  0:25
:END:
- 作成
  - [X] 2024-11-10 貴島
- レビュー
  - [X] 2024-11-11 貴島

* WIP プロジェクトのステータス

プロジェクトは進行中である。

* 概要

[[id:dc45bd7d-b8c4-47ef-ae84-c548f81c50bb][Entity Component System]]を使って、サンプルゲームを作る。

#+caption: ゲーム
#+BEGIN_EXPORT html
<iframe width="560" height="315" src="https://kijimad.github.io/ruins/"></iframe>
#+END_EXPORT

↑実際のゲーム画面。ウィンドウにフォーカスして方向キーで操作できる。

- リポジトリ。[[https://github.com/kijimaD/ruins][kijimaD/ruins]]

#+caption: ノベルエンジンのサンプル
#+begin_export html
<iframe width="720" height="720" src="https://kijimad.github.io/nova/"></iframe>
#+end_export

↑実際のゲーム画面。クリックもしくはエンターでページ送り。

- リポジトリ。[[https://github.com/kijimaD/nova][kijimaD/nova]]

* 方針
まずストーリー抜きで、RPGとしてゲームが成立するようにする。

最低限の要素。

1. クリア画面
2. 階層移動
3. 敵とのエンカウント
4. バトル

* 素材
よさげな素材をリンクしておく。

- https://www.pixilart.com/art/mayon-sr21881399e91aws3
  - 火山の背景
* Tasks
** TODO メッセージページ表示を追加する
:LOGBOOK:
CLOCK: [2025-09-23 Tue 21:17]--[2025-09-23 Tue 21:42] =>  0:25
CLOCK: [2025-09-23 Tue 20:52]--[2025-09-23 Tue 21:17] =>  0:25
CLOCK: [2025-09-23 Tue 19:21]--[2025-09-23 Tue 19:46] =>  0:25
CLOCK: [2025-09-23 Tue 18:56]--[2025-09-23 Tue 19:21] =>  0:25
CLOCK: [2025-09-23 Tue 18:29]--[2025-09-23 Tue 18:54] =>  0:25
CLOCK: [2025-09-23 Tue 17:49]--[2025-09-23 Tue 18:14] =>  0:25
CLOCK: [2025-09-23 Tue 17:00]--[2025-09-23 Tue 17:25] =>  0:25
CLOCK: [2025-09-23 Tue 16:33]--[2025-09-23 Tue 16:58] =>  0:25
CLOCK: [2025-09-23 Tue 10:07]--[2025-09-23 Tue 10:32] =>  0:25
CLOCK: [2025-09-07 Sun 15:49]--[2025-09-07 Sun 16:14] =>  0:25
CLOCK: [2025-09-07 Sun 15:09]--[2025-09-07 Sun 15:34] =>  0:25
CLOCK: [2025-09-07 Sun 12:21]--[2025-09-07 Sun 12:46] =>  0:25
CLOCK: [2025-09-07 Sun 11:46]--[2025-09-07 Sun 12:12] =>  0:26
CLOCK: [2025-09-07 Sun 10:03]--[2025-09-07 Sun 10:28] =>  0:25
CLOCK: [2025-09-07 Sun 09:38]--[2025-09-07 Sun 10:03] =>  0:25
:END:

- ストーリーメッセージはスキップ可能なメッセージページに表示する(Elona風)
  - 専用ウィンドウにメッセージを表示する
  - 「閉じる」のアクションを表示する
  - 基本的に1ページだけ
  - 将来的に取る選択肢を選べるようにする

#+begin_src go
new := msgBuilder()
new.Message("この中から選べ。").Choice(a, b, c) # aに選択肢文字、適用結果、適用後のメッセージが入る
#+end_src

- typewriterは削除する
  - 無駄にややこしいし、ローグライクにそぐわない
  - 表示アニメーションはあってもいいが、主要機能のenter待ちはいらない
  - SafeSliceの文字列版は消す

** TODO effectsの立ち位置を明確にする
:LOGBOOK:
CLOCK: [2025-09-21 Sun 10:03]--[2025-09-21 Sun 10:28] =>  0:25
:END:

- 現状のattack activityでは直接ダメージ計算して、ログを出している
- いろいろな共通化など考えるとeffectを発行するべきにも思える
- イベントシステムとの使い分けはどうするか
** TODO 共通のエラーハンドリング方式を定める

- ゲームなのでpanicさせたくない。が、検知はしたい
- 終了させるのは微妙
- デバッグ情報を収集してファイル出力などさせるとよさそう
- テスト可能にするために、スライスで保持しておく。関数を実行したときだけ書き込む

** TODO コンテキスト移動する

同じ方向キーでも、コンテキストによってじっさいの実行イベントは変化する。こうすることで直感的に操作できる。

- *隣接タイルが空* → 移動
- *隣接タイルに敵* → 攻撃
- *隣接タイルにドア* → ドア開閉
- *隣接タイルが採掘可能* → 自動採掘
- *隣接タイルが水域* → 水泳開始

#+caption: CDDAの参考
#+begin_src C
bool avatar_action::move(avatar &you, map &m, const tripoint &d) {
    const tripoint dest_loc = you.pos() + d;

    // 1. プレイヤー状態確認
    if (you.has_effect(effect_stunned)) {
        // スタン状態での移動制限
        return false;
    }

    // 2. 敵・NPC検出
    creature_tracker &creatures = get_creature_tracker();
    if (Creature *critter = creatures.creature_at(dest_loc)) {
        // 攻撃処理
        you.melee_attack(*critter, true);
        return true;
    }

    // 3. 特殊地形処理
    if (m.has_flag(ter_furn_flag::TFLAG_MINEABLE, dest_loc)) {
        // 自動採掘処理
        return try_auto_mining(you, m, dest_loc);
    }

    // 4. ドア処理
    if (m.open_door(you, dest_loc, !m.is_outside(you.pos()))) {
        // ドア開閉処理
        return true;
    }

    // 5. 通常移動
    return g->walk_move(dest_loc);
}
#+end_src

** TODO セーブデータの互換性を考える

- 今の仕組みだと、値を変えたりしたときに既存セーブデータに反映されない
- セーブデータにバージョンを保存しておいて弾く、警告を出すだけでよいかも

** TODO 徘徊AIを強化する
:LOGBOOK:
CLOCK: [2025-08-12 Tue 20:51]--[2025-08-12 Tue 21:16] =>  0:25
CLOCK: [2025-08-12 Tue 20:14]--[2025-08-12 Tue 20:39] =>  0:25
CLOCK: [2025-08-12 Tue 18:44]--[2025-08-12 Tue 19:09] =>  0:25
:END:

- 追跡モード追加する
- デバッグ用にステート、索敵範囲、方向を表示する
- 徘徊モードの移動を自然にする
- 徘徊モードの向きが合ってない

** TODO 戦闘ステートをテスタブルにする
:LOGBOOK:
CLOCK: [2025-07-31 Thu 23:09]--[2025-07-31 Thu 23:34] =>  0:25
CLOCK: [2025-07-30 Wed 22:07]--[2025-07-30 Wed 22:32] =>  0:25
CLOCK: [2025-07-30 Wed 21:42]--[2025-07-30 Wed 22:07] =>  0:25
CLOCK: [2025-07-30 Wed 21:17]--[2025-07-30 Wed 21:42] =>  0:25
CLOCK: [2025-07-30 Wed 20:46]--[2025-07-30 Wed 21:11] =>  0:25
CLOCK: [2025-07-29 Tue 22:46]--[2025-07-29 Tue 23:11] =>  0:25
CLOCK: [2025-07-29 Tue 22:09]--[2025-07-29 Tue 22:34] =>  0:25
CLOCK: [2025-07-27 Sun 21:54]--[2025-07-27 Sun 22:19] =>  0:25
CLOCK: [2025-07-27 Sun 21:24]--[2025-07-27 Sun 21:49] =>  0:25
CLOCK: [2025-07-27 Sun 20:51]--[2025-07-27 Sun 21:16] =>  0:25
CLOCK: [2025-07-27 Sun 20:23]--[2025-07-27 Sun 20:48] =>  0:25
CLOCK: [2025-07-27 Sun 17:43]--[2025-07-27 Sun 18:08] =>  0:25
CLOCK: [2025-07-27 Sun 16:25]--[2025-07-27 Sun 16:50] =>  0:25
CLOCK: [2025-07-27 Sun 14:15]--[2025-07-27 Sun 14:40] =>  0:25
CLOCK: [2025-07-27 Sun 13:47]--[2025-07-27 Sun 14:12] =>  0:25
CLOCK: [2025-07-27 Sun 11:54]--[2025-07-27 Sun 12:19] =>  0:25
CLOCK: [2025-07-27 Sun 11:21]--[2025-07-27 Sun 11:46] =>  0:25
CLOCK: [2025-07-21 Mon 18:04]--[2025-07-21 Mon 18:29] =>  0:25
CLOCK: [2025-07-21 Mon 17:26]--[2025-07-21 Mon 17:51] =>  0:25
CLOCK: [2025-07-21 Mon 16:52]--[2025-07-21 Mon 17:17] =>  0:25
CLOCK: [2025-07-21 Mon 16:27]--[2025-07-21 Mon 16:52] =>  0:25
CLOCK: [2025-07-21 Mon 14:49]--[2025-07-21 Mon 15:14] =>  0:25
CLOCK: [2025-07-21 Mon 13:54]--[2025-07-21 Mon 14:19] =>  0:25
CLOCK: [2025-07-21 Mon 12:10]--[2025-07-21 Mon 12:35] =>  0:25
CLOCK: [2025-07-21 Mon 11:44]--[2025-07-21 Mon 12:09] =>  0:25
CLOCK: [2025-07-21 Mon 11:09]--[2025-07-21 Mon 11:34] =>  0:25
CLOCK: [2025-07-21 Mon 10:43]--[2025-07-21 Mon 11:08] =>  0:25
CLOCK: [2025-07-21 Mon 10:18]--[2025-07-21 Mon 10:43] =>  0:25
CLOCK: [2025-07-21 Mon 09:53]--[2025-07-21 Mon 10:18] =>  0:25
CLOCK: [2025-07-21 Mon 09:28]--[2025-07-21 Mon 09:53] =>  0:25
CLOCK: [2025-07-20 Sun 22:36]--[2025-07-20 Sun 23:01] =>  0:25
CLOCK: [2025-07-20 Sun 22:11]--[2025-07-20 Sun 22:36] =>  0:25
CLOCK: [2025-07-20 Sun 21:06]--[2025-07-20 Sun 21:31] =>  0:25
CLOCK: [2025-07-20 Sun 20:39]--[2025-07-20 Sun 21:04] =>  0:25
CLOCK: [2025-07-20 Sun 19:21]--[2025-07-20 Sun 19:46] =>  0:25
CLOCK: [2025-07-20 Sun 18:55]--[2025-07-20 Sun 19:20] =>  0:25
CLOCK: [2025-07-20 Sun 18:30]--[2025-07-20 Sun 18:55] =>  0:25
CLOCK: [2025-07-20 Sun 18:05]--[2025-07-20 Sun 18:30] =>  0:25
CLOCK: [2025-07-20 Sun 17:39]--[2025-07-20 Sun 18:04] =>  0:25
CLOCK: [2025-07-20 Sun 12:50]--[2025-07-20 Sun 13:15] =>  0:25
CLOCK: [2025-07-20 Sun 12:18]--[2025-07-20 Sun 12:43] =>  0:25
CLOCK: [2025-07-20 Sun 11:50]--[2025-07-20 Sun 12:15] =>  0:25
CLOCK: [2025-07-20 Sun 11:24]--[2025-07-20 Sun 11:49] =>  0:25
CLOCK: [2025-07-20 Sun 10:06]--[2025-07-20 Sun 10:31] =>  0:25
CLOCK: [2025-07-19 Sat 22:51]--[2025-07-19 Sat 23:16] =>  0:25
CLOCK: [2025-07-19 Sat 21:44]--[2025-07-19 Sat 22:09] =>  0:25
CLOCK: [2025-07-19 Sat 21:11]--[2025-07-19 Sat 21:36] =>  0:25
CLOCK: [2025-07-19 Sat 19:35]--[2025-07-19 Sat 20:00] =>  0:25
CLOCK: [2025-07-19 Sat 19:08]--[2025-07-19 Sat 19:33] =>  0:25
CLOCK: [2025-07-19 Sat 18:39]--[2025-07-19 Sat 19:04] =>  0:25
CLOCK: [2025-07-19 Sat 18:14]--[2025-07-19 Sat 18:39] =>  0:25
CLOCK: [2025-07-19 Sat 17:40]--[2025-07-19 Sat 18:05] =>  0:25
CLOCK: [2025-07-19 Sat 17:14]--[2025-07-19 Sat 17:39] =>  0:25
CLOCK: [2025-07-19 Sat 16:49]--[2025-07-19 Sat 17:14] =>  0:25
CLOCK: [2025-07-19 Sat 16:24]--[2025-07-19 Sat 16:49] =>  0:25
CLOCK: [2025-07-19 Sat 15:59]--[2025-07-19 Sat 16:24] =>  0:25
:END:

- テストカバー率が低い
- ステップが多く手動での検証が面倒である
- 複雑である

かなりの時間をかけているが、進んでない。うまく組み込めない。

** TODO 全体的にテストヘルパーは専用のファイルにまとめる

重複が多いように見える。わかりやすいようにまとめておく。

** TODO VRTを強化する
:LOGBOOK:
CLOCK: [2025-07-17 Thu 22:11]--[2025-07-17 Thu 22:36] =>  0:25
CLOCK: [2025-07-17 Thu 21:35]--[2025-07-17 Thu 22:00] =>  0:25
:END:

強化する。

** TODO アイテム等をソートする
:LOGBOOK:
CLOCK: [2025-08-27 Wed 19:18]--[2025-08-27 Wed 19:43] =>  0:25
CLOCK: [2025-08-27 Wed 23:09]--[2025-08-27 Wed 23:34] =>  0:25
CLOCK: [2025-08-27 Wed 21:32]--[2025-08-27 Wed 21:57] =>  0:25
CLOCK: [2025-08-27 Wed 21:06]--[2025-08-27 Wed 21:31] =>  0:25
CLOCK: [2025-08-27 Wed 20:33]--[2025-08-27 Wed 20:58] =>  0:25
:END:

まだアイテムは固定の並びになるが、レシピなど一括生成系はmapを経由するため生成順序がずれてVRTが失敗している。

