20231128T074518--kdoc-59-ecsを使ってrpgを作る__project.html
<div id="outline-container-org589e47b" class="outline-3">
<h3 id="org589e47b"><a href="#org589e47b"><span class="todo TODO">TODO</span> フィールドにアイテムを生成する</a></h3>
<div class="outline-text-3" id="text-org589e47b">
<ul class="org-ul">
<li>アイテムを生成する</li>
<li>拾える</li>
</ul>
</div>
</div>
<div id="outline-container-org36c1766" class="outline-3">
<h3 id="org36c1766"><a href="#org36c1766"><span class="todo TODO">TODO</span> Stackable Itemにする</a></h3>
<div class="outline-text-3" id="text-org36c1766">
<p>
Material componentのなかで数量を持っているが、仕様として読み取りにくいのと、ほかにもスタッキングしたいものはあるので別コンポーネントにする。
</p>

<ul class="org-ul">
<li>換金用アイテムなどはスタッキングできていい</li>
<li>装備など独自ステータスを持つものだけ、スタック不可にする</li>
<li>フィールド上にある時点では1つのエンティティで、インベントリ追加したタイミングでそのエンティティは削除、すでにあるエンティティの個数に加算する</li>
</ul>
</div>
</div>
<div id="outline-container-org16115ea" class="outline-3">
<h3 id="org16115ea"><a href="#org16115ea"><span class="todo TODO">TODO</span> イベントのテーブルをどうするか考える</a></h3>
<div class="outline-text-3" id="text-org16115ea">
<p>
いくつかの入力によって、たとえばイベントの戦闘がどうなるかは異なる。あるいはアイテムの取得テーブル。
</p>

<ul class="org-ul">
<li>味方のレベル</li>
<li>階層</li>
</ul>

<p>
を参考にして、以下のような要素が変動する。
</p>

<ul class="org-ul">
<li>戦闘モンスター
<ul class="org-ul">
<li>レベル</li>
<li>種別</li>
<li>パーティ構成</li>
</ul></li>
<li>入手アイテム</li>
</ul>

<p>
モンスターを直接指定したい場合もあるだろう。
</p>
</div>
</div>
<div id="outline-container-orgbf0d0be" class="outline-3">
<h3 id="orgbf0d0be"><a href="#orgbf0d0be"><span class="todo TODO">TODO</span> デバッグ設定を調整する</a></h3>
<div class="outline-text-3" id="text-orgbf0d0be">
<ul class="org-ul">
<li>戦闘時のHP表示</li>
<li>フィールド上でのエンカウント無視</li>
</ul>
</div>
</div>
<div id="outline-container-orga00778a" class="outline-3">
<h3 id="orga00778a"><a href="#orga00778a"><span class="todo TODO">TODO</span> 死亡を状態化する</a></h3>
<div class="outline-text-3" id="text-orga00778a">
<p>
今はHP0で判定している。しかし、死亡状態は特殊で、回復薬で回復させられなかったり、行動できるかのフラグとして使ったりする。なので、コンポーネント化したほうがよい。
</p>
</div>
</div>
<div id="outline-container-orgc25c71c" class="outline-3">
<h3 id="orgc25c71c"><a href="#orgc25c71c"><span class="todo TODO">TODO</span> 合成のレアリティスコア</a></h3>
<div class="outline-text-3" id="text-orgc25c71c">
<p>
性能にスコアをつけ、結果的に出来上がったものに対してレアリティランクをつけるとよさそう。
</p>
</div>
</div>
<div id="outline-container-org375a863" class="outline-3">
<h3 id="org375a863"><a href="#org375a863"><span class="todo TODO">TODO</span> 生成をランダム化する</a></h3>
<div class="outline-text-3" id="text-org375a863">
<p>
ある程度ランダム化したい。プレイヤー、モンスター、ワープゲートの出る位置をバラけさせる。
</p>
</div>
</div>
<div id="outline-container-org266ff25" class="outline-3">
<h3 id="org266ff25"><a href="#org266ff25"><span class="todo TODO">TODO</span> 光源を追加する</a></h3>
<div class="outline-text-3" id="text-org266ff25">
<p>
光源がある部分は色が変わる。
</p>

<p>
タイルごとに色のフィルタを設定できればよいのだろうな。
</p>
</div>
</div>
<div id="outline-container-org7937d63" class="outline-3">
<h3 id="org7937d63"><a href="#org7937d63"><span class="todo TODO">TODO</span> タイルの種類を増やす</a></h3>
<div class="outline-text-3" id="text-org7937d63">
<p>
見た目がよくないので、2種類の通常フロアを用意する。
</p>

<p>
ステージ作成が少し面倒になるか。2種類のタイルの違いをファイルに書き出したくないな。勝手に判断して入れてくれるのが一番良い。壁が隣接してたら〜とか。
</p>
</div>
</div>
<div id="outline-container-org090501f" class="outline-3">
<h3 id="org090501f"><a href="#org090501f"><span class="todo TODO">TODO</span> ゲームループカウントをグローバル化する</a></h3>
<div class="outline-text-3" id="text-org090501f">
<p>
カウントしてメッセージをアニメーションさせる用。汎用的なのでグローバルでやってよさそう。アニメーションのためのもっとよい方法がある可能性はある。ちゃんと調べないとな…。
</p>
</div>
</div>
<div id="outline-container-org48b894e" class="outline-3">
<h3 id="org48b894e"><a href="#org48b894e"><span class="todo TODO">TODO</span> アニメーションのやり方を考える</a></h3>
<div class="outline-text-3" id="text-org48b894e">
<p>
どうやっているのだろう。
</p>

<ul class="org-ul">
<li>最後にアニメーションした時刻を取っておいて、それから経過した時間で決定すればよい</li>
<li>しかし、アニメーションのたびにそれをあちこちに保存しておきたくない感じはする</li>
</ul>
</div>
</div>
<div id="outline-container-orga4894a1" class="outline-3">
<h3 id="orga4894a1"><a href="#orga4894a1"><span class="todo TODO">TODO</span> 本を読めるようにする</a></h3>
<div class="outline-text-3" id="text-orga4894a1">
<p>
ランダムに拾えるアイテムによって世界観を知っていく。アイテムコレクション要素。
</p>
</div>
</div>
</div>
<div id="outline-container-orgc41c8be" class="outline-2">
<h2 id="orgc41c8be"><a href="#orgc41c8be">考察</a></h2>
<div class="outline-text-2" id="text-orgc41c8be">
<ul class="org-ul">
<li>作った</li>
<li>しかし、発表に値するような事柄はない</li>
<li>技術的な挑戦的な部分は一切ない。新しいことをやっているわけでもない</li>
<li>参考にして面白かったことはある
<ul class="org-ul">
<li>ECS - コンポーネントで考える</li>
<li>ゲームにはさまざなデータがあるが、確実にファイル化する。ソースコードに入れない</li>
</ul></li>
<li>ひとつある</li>
<li>個人のゲーム開発の99%は途中で挫折する(自分比)</li>
<li>工夫
<ul class="org-ul">
<li>意図的にやらないことを選択した</li>
<li>グラフィック、アニメーション、音楽は捨てた</li>
<li>常にプレイできる状態を保った</li>
<li>とりあえずクリアできるようにして、人に見せた</li>
</ul></li>
</ul>

<p>
工夫。
</p>

<ul class="org-ul">
<li>データを別にしている。ファイルからパラメータを調整できる</li>
<li>ECS(Entity Component System)</li>
</ul>
</div>
</div>
<div id="outline-container-org44d4f94" class="outline-2">
<h2 id="org44d4f94"><a href="#org44d4f94">Archives</a></h2>
<div class="outline-text-2" id="text-org44d4f94">
</div>
<div id="outline-container-orgb2e459a" class="outline-3">
<h3 id="orgb2e459a"><a href="#orgb2e459a"><span class="done DONE">DONE</span> メッセージ表示できるようにする</a></h3>
<div class="outline-text-3" id="text-orgb2e459a">
<p>
<a href="https://github.com/x-hgg-x/sokoban-go">x-hgg-x/sokoban-go</a>を使って小さいサンプルを作る。
</p>
</div>
</div>
<div id="outline-container-org6517a61" class="outline-3">
<h3 id="org6517a61"><a href="#org6517a61"><span class="done DONE">DONE</span> メッセージシステムのリファクタ</a></h3>
<div class="outline-text-3" id="text-org6517a61">
<p>
使いにくいので直す。
</p>
</div>
</div>
<div id="outline-container-org9a2870c" class="outline-3">
<h3 id="org9a2870c"><a href="#org9a2870c"><span class="done DONE">DONE</span> メッセージシステムに自動改行を入れる</a></h3>
<div class="outline-text-3" id="text-org9a2870c">
<p>
飛び出すのを防ぐ。
</p>
</div>
</div>
<div id="outline-container-orga780384" class="outline-3">
<h3 id="orga780384"><a href="#orga780384"><span class="done DONE">DONE</span> ファイルを埋め込む</a></h3>
<div class="outline-text-3" id="text-orga780384">
<p>
デプロイで扱いやすいように。
</p>
</div>
</div>
<div id="outline-container-org4265ef9" class="outline-3">
<h3 id="org4265ef9"><a href="#org4265ef9"><span class="done DONE">DONE</span> CI設定</a></h3>
<div class="outline-text-3" id="text-org4265ef9">
<p>
テストとビルドとデプロイする。
</p>

<p>
デプロイしたけど、ブラウザで表示できてないな。
</p>
</div>
</div>
<div id="outline-container-org82d4d86" class="outline-3">
<h3 id="org82d4d86"><a href="#org82d4d86"><span class="done DONE">DONE</span> フィールドで動けるようにする</a></h3>
<div class="outline-text-3" id="text-org82d4d86">
<ul class="org-ul">
<li>テキストで地図を読み込む</li>
<li>コンポーネントを作る</li>
<li>地図を表示する</li>
<li>移動できるようにする</li>
</ul>

<p>
実行時エラーになる。表示できない。インターフェースが取り出せないよう。
</p>

<ul class="org-ul">
<li>コンポーネントの初期化を忘れていた</li>
<li>LoadLevel()によって読み込んだComponentListをAddEntities()-&gt;AddEntityComponent()に渡す。が、AddEntitiesで失敗する。テキストで読み込んだ内容をreflectでオブジェクト化するときに、新しく作成したコンポーネントを初期化するのに失敗している</li>
<li>ecsComponentListを調べてみよう
<ul class="org-ul">
<li>ecvでGameが入ってない</li>
<li>world.Components.Game</li>
</ul></li>
<li>sokoban-go では main.goのw.InitWorld(&amp;gc.Components{})の時点でworld.Components.Gameがセットされている</li>
</ul>
</div>
</div>
