20231128T074518--kdoc-59-ecsを使ってrpgを作る__project.html
<div id="outline-container-orgf29ebc7" class="outline-3">
<h3 id="orgf29ebc7"><a href="#orgf29ebc7"><span class="done DONE">DONE</span> マップを表示できるようにする</a></h3>
<div class="outline-text-3" id="text-orgf29ebc7">
<p>
表示する。
</p>
</div>
</div>
<div id="outline-container-orgd81110b" class="outline-3">
<h3 id="orgd81110b"><a href="#orgd81110b"><span class="done DONE">DONE</span> 階数を移動できるようにする</a></h3>
<div class="outline-text-3" id="text-orgd81110b">
<p>
1階からはじまって、次の階層に移動する。
</p>

<p>
ワープホール。
</p>
</div>
</div>
<div id="outline-container-org2abd64f" class="outline-3">
<h3 id="org2abd64f"><a href="#org2abd64f"><span class="done DONE">DONE</span> クロスコンパイルする</a></h3>
<div class="outline-text-3" id="text-org2abd64f">
<p>
一応CIに設定して保証しておく。
</p>
</div>
</div>
<div id="outline-container-orgedfca69" class="outline-3">
<h3 id="orgedfca69"><a href="#orgedfca69"><span class="done DONE">DONE</span> メッセージが飛び出すのを直す</a></h3>
<div class="outline-text-3" id="text-orgedfca69">
<p>
ステート遷移イベントを作る。
</p>
</div>
</div>
<div id="outline-container-org4b52707" class="outline-3">
<h3 id="org4b52707"><a href="#org4b52707"><span class="done DONE">DONE</span> 次の階をランダムに選択する</a></h3>
<div class="outline-text-3" id="text-org4b52707">
<p>
一覧からランダムに選択する。
</p>
</div>
</div>
<div id="outline-container-org2d59c02" class="outline-3">
<h3 id="org2d59c02"><a href="#org2d59c02"><span class="done DONE">DONE</span> HomeStateを作成する</a></h3>
<div class="outline-text-3" id="text-org2d59c02">
<p>
ゲームプレイの基軸になるメニュー。
</p>
</div>
</div>
<div id="outline-container-orga372c1d" class="outline-3">
<h3 id="orga372c1d"><a href="#orga372c1d"><span class="done DONE">DONE</span> 脱出できるようにする</a></h3>
<div class="outline-text-3" id="text-orga372c1d">
<p>
脱出階層で脱出できるようにする。
</p>
</div>
</div>
<div id="outline-container-org19676bf" class="outline-3">
<h3 id="org19676bf"><a href="#org19676bf"><span class="done DONE">DONE</span> 背景を設定する</a></h3>
<div class="outline-text-3" id="text-org19676bf">
<p>
背景を追加する。スプライトはあるけど、同じでいいのか。いや、スプライトは1枚の画像を分割するものだから、同じ感じでは扱えないな。変えるとsystemも変えないといけない。面倒なのでとりあえずいいか。
</p>
</div>
</div>
<div id="outline-container-org2e175f6" class="outline-3">
<h3 id="org2e175f6"><a href="#org2e175f6"><span class="done DONE">DONE</span> サブメニュー追加</a></h3>
<div class="outline-text-3" id="text-org2e175f6">
<p>
拠点メニューにはサブメニューがある。どうやるか考える。
</p>

<ul class="org-ul">
<li>別stateでやる
<ul class="org-ul">
<li>大量にstateができるのどうなのという感じ。背景コンポーネントとかも同じ感じで準備しないといけない</li>
</ul></li>
<li>リファレンスではどうやっているのだろう。ポーズでは、後ろを透明に表示しつつ、メニューを表示している。あれと同じようなことができないか
<ul class="org-ul">
<li>ポーズメニューでは、OnStopでポーズメニューのエンティティのみを削除しているようだ。ほかのstateでは、すべてのエンティティを削除することが異なる</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org88c2f45" class="outline-3">
<h3 id="org88c2f45"><a href="#org88c2f45"><span class="done DONE">DONE</span> pauseステート作成</a></h3>
<div class="outline-text-3" id="text-org88c2f45">
<p>
デバッグで便利なので。
</p>
</div>
</div>
<div id="outline-container-orgad338dc" class="outline-3">
<h3 id="orgad338dc"><a href="#orgad338dc"><span class="done DONE">DONE</span> アイテムを生成する</a></h3>
<div class="outline-text-3" id="text-orgad338dc">
<p>
アイテムを追加する。
</p>

<ul class="org-ul">
<li>item
<ul class="org-ul">
<li>consumable</li>
<li>name</li>
<li>description</li>
</ul></li>
</ul>

<p>
まずそれぞれのコンポーネントの雛形をファイルで作成する。
</p>

<ul class="org-ul">
<li>items
<ul class="org-ul">
<li>entityA
<ul class="org-ul">
<li>componentA(consumable)</li>
<li>componentB(weight)</li>
</ul></li>
<li>entityB
<ul class="org-ul">
<li>componentA(consumable)</li>
<li>componentB(weight)</li>
</ul></li>
</ul></li>
</ul>

<p>
で、そのデータを読み込んでエンティティとコンポーネントを生成する関数を作る。
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>engineも作らないといけない</label><pre class="src src-go">componentList := loader.EntityComponentList{}
// engineとgameは同数でなければならない。分割されているのが面倒だな…
componentList.Engine = append(componentList.Engine, loader.EngineComponentList{})
componentList.Game = append(componentList.Game, gloader.GameComponentList{
	Item: &amp;gc.Item{},
})
loader.AddEntities(world, componentList)
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 2: </span>元ネタ</label><pre class="src src-rust">pub fn spawn_named_item(
</pre>
</div>
</div>
</div>
<div id="outline-container-org3b41049" class="outline-3">
<h3 id="org3b41049"><a href="#org3b41049"><span class="done DONE">DONE</span> UI設計</a></h3>
<div class="outline-text-3" id="text-org3b41049">
<p>
いちいちゲーム画面見るのもアレなので、書いておく。
</p>
</div>
</div>
<div id="outline-container-org742d2ae" class="outline-3">
<h3 id="org742d2ae"><a href="#org742d2ae"><span class="done DONE">DONE</span> UIエンティティだけを消す</a></h3>
<div class="outline-text-3" id="text-org742d2ae">
<p>
DeleteAllEntitiesでステート切り替え時のUIリセットをしている。entitiesが全部消えるので、困る。ほとんどの場合、UIだけをリセットすればよさそう。
</p>

<p>
UIコンポーネントと、UIコンポーネントを消す関数を作ればよさそう。
</p>
</div>
</div>
<div id="outline-container-org9551294" class="outline-3">
<h3 id="org9551294"><a href="#org9551294"><span class="done DONE">DONE</span> 各メニューを作成する</a></h3>
<div class="outline-text-3" id="text-org9551294">
<p>
仮の内容で全部作る。
</p>
</div>
</div>
<div id="outline-container-org0b4a062" class="outline-3">
<h3 id="org0b4a062"><a href="#org0b4a062"><span class="done DONE">DONE</span> アイテムを使う</a></h3>
<div class="outline-text-3" id="text-org0b4a062">
<ul class="org-ul">
<li>キャラクタを作る</li>
<li>ステータスを作る</li>
<li>影響を与えられるようにする</li>
<li>memo
<ul class="org-ul">
<li>可変のアイテムリストについて、選択中の印をつける必要がある</li>
<li>選択中の座標をとってきて、選択印の位置を変化させればいいのかな</li>
</ul></li>

<li>ゲーム
<ul class="org-ul">
<li>戦車にしたいけど、戦闘システムがややこしくなる</li>
<li>合成とかで各自の装備メインにしたいんだよな</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgb969769" class="outline-3">
<h3 id="orgb969769"><a href="#orgb969769"><span class="done DONE">DONE</span> アイテムを選択して使えるようにする</a></h3>
<div class="outline-text-3" id="text-orgb969769">
<p>
今は固定にしている。
</p>
</div>
</div>
<div id="outline-container-org59ee594" class="outline-3">
<h3 id="org59ee594"><a href="#org59ee594"><span class="done DONE">DONE</span> アイテムリストをebitenUIで作る</a></h3>
<div class="outline-text-3" id="text-org59ee594">
<p>
いい感じに、スクロールできるようにする。
</p>
</div>
</div>
<div id="outline-container-org0d58a05" class="outline-3">
<h3 id="org0d58a05"><a href="#org0d58a05"><span class="done DONE">DONE</span> サイドメニューを表示する</a></h3>
<div class="outline-text-3" id="text-org0d58a05">
<p>
性能を表示するサイドパネル。
</p>

<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> メニューバーが太いのを直す</li>
</ul>
</div>
</div>
<div id="outline-container-orgbd98a83" class="outline-3">
<h3 id="orgbd98a83"><a href="#orgbd98a83"><span class="done DONE">DONE</span> UIをリロードせずに反映できるようにする</a></h3>
<div class="outline-text-3" id="text-orgbd98a83">
<p>
アイテムを使用したときにUIをリロードしているが、スクロール位置が元へ戻ってしまうのでリロードしないようにする。
</p>

<p>
また、表示ジャンルの切替もあるので、リロードすると保持しなくて困る。
</p>
</div>
</div>
