20231128T074518--kdoc-59-ecsを使ってrpgを作る__project.html
<div id="outline-container-orgb3cf4d4" class="outline-3">
<h3 id="orgb3cf4d4"><a href="#orgb3cf4d4"><span class="done DONE">DONE</span> 合成画面を作る</a></h3>
<div class="outline-text-3" id="text-orgb3cf4d4">
<p>
まず画面を作って、そこから共通化していけばいいか。
</p>

<ul class="org-ul">
<li>装備画面</li>
<li>合成画面</li>
<li>使用画面</li>
</ul>

<p>
これらは似たようなUIを持つ。
</p>

<ul class="org-ul">
<li>カテゴリ選択</li>
<li>アイテムメニュー(左)
<ul class="org-ul">
<li>中身の取得ロジックは異なる</li>
<li>中に入るデータの種類が違うということ</li>
</ul></li>
<li>性能メニュー(右)</li>
</ul>

<p>
あたりは共通。ボタンのアクションが違うくらいか。
</p>

<p>
合成に必要なもの。
</p>

<ul class="org-ul">
<li>レシピ
<ul class="org-ul">
<li>素材の種類と個数</li>
<li>鉄の剣 = <code>[{鉄くず,2}, {木の棒,1}]</code></li>
</ul></li>
<li class="on"><input type='checkbox' checked='checked' /> レシピを表示する</li>
<li class="on"><input type='checkbox' checked='checked' /> 合成する関数を作成する
<ul class="org-ul">
<li>アイテム名からベースアイテムを作成する</li>
<li>加工する</li>
</ul></li>
<li class="off"><input type='checkbox' /> レシピをもとに作成できるようにする
<ul class="org-ul">
<li>所持数量とレシピを比較して満たしていると合成が選択できる</li>
<li>合成を選択すると、所持数量を減らし該当アイテムを追加する</li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-go">gc := Craft("ハンドガン", 4) ecs.Entity // 品名、合成オプション
Spawn(gc, spawntype.OnBackpack)
</pre>
</div>
</div>
</div>
<div id="outline-container-org0cdbf36" class="outline-3">
<h3 id="org0cdbf36"><a href="#org0cdbf36"><span class="done DONE">DONE</span> アイテムUIまわりをリファクタする</a></h3>
<div class="outline-text-3" id="text-org0cdbf36">
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> グローバル変数を構造体のフィールドに移す</li>
</ul>

<p>
合成とか装備品変更とか、よく似たUIで別画面を作ることになる。別で作ってたら大変なことになる。再利用するためにはどうすればよいか。
</p>
</div>
</div>
<div id="outline-container-org76042db" class="outline-3">
<h3 id="org76042db"><a href="#org76042db"><span class="done DONE">DONE</span> 乗り物をどうするか</a></h3>
<div class="outline-text-3" id="text-org76042db">
<p>
結論、小さなSFチックな機械を導入する。戦闘には参加しないがサポートする。知能は持たない。
</p>

<p>
パーティ全体を強化できるようなのがあると面白そうに思える。乗り物はそういう強化が自然にできて面白い。人だけだとつけ外し要素がない。ただし、戦車だとシステムが複雑になる可能性がある。アイテム合成が生きないような。
</p>

<ul class="org-ul">
<li>ドローンやタレットとか、自律的な何か</li>
<li>戦闘で交じるのはややこしくて困る</li>
<li>非戦闘な乗り物ってないな</li>
<li>歩数制限のもっともな理由がほしい
<ul class="org-ul">
<li>燃料とか食べ物の類</li>
</ul></li>
<li>小さなSFチックな機械を導入する。それがないと遺跡に入れない的な。いろいろ効果をつけられる</li>
<li>戦車は逆に敵が強くなるとかの理由をつけて遺跡に入らない。戦闘が面倒になるので</li>
</ul>
</div>
</div>
<div id="outline-container-orgefd1df1" class="outline-3">
<h3 id="orgefd1df1"><a href="#orgefd1df1"><span class="done DONE">DONE</span> タイル移動でなくするか</a></h3>
<div class="outline-text-3" id="text-orgefd1df1">
<p>
いやでもアニメーションやリアルタイムとなると大変そうだから、タイル移動のままがよさそう。
</p>

<p>
あまりローグライクさせる意味はなさそう。敵を避けにくい。banbandonを参考にして自由移動にするか。
</p>
</div>
</div>
<div id="outline-container-orga7d5fe0" class="outline-3">
<h3 id="orga7d5fe0"><a href="#orga7d5fe0"><span class="done DONE">DONE</span> 一貫させるためインターフェースを定義する</a></h3>
<div class="outline-text-3" id="text-orga7d5fe0">
<p>
stateごとにコードがバラバラで、直していくのが辛い。
</p>

<p>
一部共通部分もあるが、違う部分も多いので、しょうがないところではある。
</p>

<p>
インターフェース化して、ある程度同じにするか。とはいえ、アイテム画面がそこまで種類多いかと言われるとそうでもない。3、4個だからあまり神経質にならなくてもいい。
</p>
</div>
</div>
<div id="outline-container-org434c781" class="outline-3">
<h3 id="org434c781"><a href="#org434c781"><span class="done DONE">DONE</span> 武器コンポーネントに属性を追加する</a></h3>
<div class="outline-text-3" id="text-org434c781">
<ul class="org-ul">
<li>火炎(耐火)</li>
<li>電気(耐電)</li>
<li>光力(耐光)</li>
</ul>

<p>
だとそのまますぎるか。光は異色だが、SFらしさを出すのに良い。ややこしいのであまり属性を増やしたくない。冷気(耐冷)を追加した。
</p>

<p>
時代背景的に、SFではない。でも合成するとSFになるよな。SFよりの現代、でよいか。
</p>
</div>
</div>
<div id="outline-container-orgd8cc381" class="outline-3">
<h3 id="orgd8cc381"><a href="#orgd8cc381"><span class="done DONE">DONE</span> アイテム種別に防具を追加する</a></h3>
<div class="outline-text-3" id="text-orgd8cc381">
<ul class="org-ul">
<li>消耗品</li>
<li>武器</li>
<li>防具</li>
<li>素材</li>
</ul>

<p>
で、種別が揃う。
</p>
</div>
</div>
<div id="outline-container-org57ceb2c" class="outline-3">
<h3 id="org57ceb2c"><a href="#org57ceb2c"><span class="done DONE">DONE</span> 武器種別を追加する</a></h3>
<div class="outline-text-3" id="text-org57ceb2c">
<p>
剣とか銃とか。
</p>
</div>
</div>
<div id="outline-container-orgf96434d" class="outline-3">
<h3 id="orgf96434d"><a href="#orgf96434d"><span class="done DONE">DONE</span> 合成画面をリファクタする</a></h3>
<div class="outline-text-3" id="text-orgf96434d">
<p>
書き直す。
</p>
</div>
</div>
<div id="outline-container-orgc2bf92a" class="outline-3">
<h3 id="orgc2bf92a"><a href="#orgc2bf92a"><span class="done DONE">DONE</span> 装備画面を作る</a></h3>
<div class="outline-text-3" id="text-orgc2bf92a">
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> スロットを作成する
<ul class="org-ul">
<li>コードから装備させる</li>
</ul></li>
<li class="on"><input type='checkbox' checked='checked' /> 装備画面を作成する
<ul class="org-ul">
<li>スロット表示画面。各キャラごと</li>
</ul></li>
<li class="on"><input type='checkbox' checked='checked' /> 選択画面を作成する
<ul class="org-ul">
<li>ここで選択したものが前で選択したスロットに装備される</li>
<li>モードをどう表現するか。これをstateとしてやるのはやりすぎな気もする</li>
<li>選択モードとだけしとけばいいか</li>
<li>選択モードだと、左側を武器リストにする。スライダーがあるから、全く同じにならなそうだな</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org49c2d3a" class="outline-3">
<h3 id="org49c2d3a"><a href="#org49c2d3a"><span class="done DONE">DONE</span> enumのバリデーション</a></h3>
<div class="outline-text-3" id="text-org49c2d3a">
<p>
楽にバリデーションできる書き方にする。
</p>
</div>
</div>
<div id="outline-container-org2ba3ad8" class="outline-3">
<h3 id="org2ba3ad8"><a href="#org2ba3ad8"><span class="done DONE">DONE</span> カメラ追加</a></h3>
<div class="outline-text-3" id="text-org2ba3ad8">
<p>
今はそのまま表示してる。プレイヤーの位置に追従してステージの一部だけを表示したい。
</p>

<p>
とりあえず、仮で追加した。
</p>
</div>
</div>
<div id="outline-container-orgfdd1e90" class="outline-3">
<h3 id="orgfdd1e90"><a href="#orgfdd1e90"><span class="done CLOSE">CLOSE</span> UIと分離したい</a></h3>
<div class="outline-text-3" id="text-orgfdd1e90">
<p>
完全にUIと一体化しているのでよくわからなくなる。
</p>

<ul class="org-ul">
<li>UIを保持する構造体</li>
<li>UIで表示されているボタンに設定されたイベントがトリガーされて、ECSクエリを実行して表示を切り替えたり追加したりする</li>
<li>stateはviewだと考えてよさそうな感じがする</li>
<li>データストアと直にやりとりしてるわけじゃないからいいのか。UIの変更だけだな</li>
</ul>
</div>
</div>
<div id="outline-container-orgf05cd43" class="outline-3">
<h3 id="orgf05cd43"><a href="#orgf05cd43"><span class="done DONE">DONE</span> 装備画面のリファクタ</a></h3>
<div class="outline-text-3" id="text-orgf05cd43">
<p>
汚いので直す。
</p>

<p>
どこから直せばいいのかよくわからないな。
</p>
</div>
</div>
<div id="outline-container-org028d143" class="outline-3">
<h3 id="org028d143"><a href="#org028d143"><span class="done DONE">DONE</span> ステータスを追加する</a></h3>
<div class="outline-text-3" id="text-org028d143">
<p>
生命力とか、力とか。
</p>
</div>
</div>
