20231128T074518--kdoc-59-ecsを使ってrpgを作る__project.org
** DONE Ray Castingを参考にしてフィールドの原型を作る
CLOSED: [2024-05-01 Wed 18:27]
:LOGBOOK:
CLOCK: [2024-04-29 Mon 15:43]--[2024-04-29 Mon 16:08] =>  0:25
CLOCK: [2024-04-29 Mon 15:16]--[2024-04-29 Mon 15:41] =>  0:25
CLOCK: [2024-04-29 Mon 14:51]--[2024-04-29 Mon 15:16] =>  0:25
CLOCK: [2024-04-29 Mon 14:26]--[2024-04-29 Mon 14:51] =>  0:25
CLOCK: [2024-04-29 Mon 13:44]--[2024-04-29 Mon 14:09] =>  0:25
CLOCK: [2024-04-29 Mon 13:18]--[2024-04-29 Mon 13:43] =>  0:25
CLOCK: [2024-04-25 Thu 22:11]--[2024-04-25 Thu 22:36] =>  0:25
CLOCK: [2024-04-25 Thu 21:45]--[2024-04-25 Thu 22:10] =>  0:25
CLOCK: [2024-04-25 Thu 20:46]--[2024-04-25 Thu 21:11] =>  0:25
CLOCK: [2024-04-25 Thu 20:11]--[2024-04-25 Thu 20:36] =>  0:25
CLOCK: [2024-04-25 Thu 19:46]--[2024-04-25 Thu 20:11] =>  0:25
CLOCK: [2024-04-25 Thu 18:51]--[2024-04-25 Thu 19:16] =>  0:25
CLOCK: [2024-04-25 Thu 18:26]--[2024-04-25 Thu 18:51] =>  0:25
CLOCK: [2024-04-24 Wed 22:58]--[2024-04-24 Wed 23:23] =>  0:25
CLOCK: [2024-04-24 Wed 21:46]--[2024-04-24 Wed 22:11] =>  0:25
CLOCK: [2024-04-24 Wed 21:03]--[2024-04-24 Wed 21:28] =>  0:25
CLOCK: [2024-04-24 Wed 20:38]--[2024-04-24 Wed 21:03] =>  0:25
CLOCK: [2024-04-24 Wed 00:10]--[2024-04-24 Wed 00:35] =>  0:25
:END:

- Ray Castingを原型に動くものを作る
- やりたいことに近い。[[https://al-ro.github.io/projects/raycasting/][2D Ray Casting]]
- ban-ban-donを参考にして各システムを実装する
- 特に目新しいことはなく、移動に関しては完全に参考にして作成できるように見える

ゲーム的。

- 動かしてみて、難易度的に難しい割に、そんなに移動にゲーム性生まれなくないかと感じた
- 不可視の範囲を作るのがそこまで面白いかと言われるとビミョー
- ほかのサンプルでは興味深く見えた。距離をつけてないから、明るすぎるためか
- シューティング要素はないからな。単なる追いかけっこが面白いかというと…ミンサガとかのイメージが近い。避けるためのスキルを使う
- お宝探し感は楽しい
- リアルタイムだと、シューティングの劣化版にしかならない。自分が動くと相手も動く形式であればよさそう。じっくり考えて駆け引きにする

実装。

- 三角形をグラデーションにすればよさそう
- jsの方ではどうやってるか
  - 単にfillをグラデーションで設定してるだけに見える
- 画像
  - 背景
  - 影
  - 三角

ECSとの兼ね合い。

- システムにしていきたいが、描画とかは厳しそうに見える。少なくとも1タイルごとに1エンティティとかにはできない
- 描画以外はECSにしていく
- なんだか難しすぎるように見えるけど、どうなのだろう
- たくさんの構造体をstateに書くのは違う。が、いじりたい状態フィールドがある
** DONE フィールドの背景を全体に設定する
CLOSED: [2024-05-01 Wed 21:52]
:LOGBOOK:
CLOCK: [2024-05-01 Wed 21:17]--[2024-05-01 Wed 21:42] =>  0:25
CLOCK: [2024-05-01 Wed 18:56]--[2024-05-01 Wed 19:21] =>  0:25
CLOCK: [2024-05-01 Wed 18:30]--[2024-05-01 Wed 18:55] =>  0:25
:END:
敷き詰めたい。

- やっぱりVRTで失敗するな
- 手元で動かすと発生しないのはなぜなんだろうな
** DONE コンポーネントを移動する
CLOSED: [2024-05-04 Sat 11:32]
:PROPERTIES:
:Effort:   3:00
:END:
:LOGBOOK:
CLOCK: [2024-05-04 Sat 11:07]--[2024-05-04 Sat 11:32] =>  0:25
CLOCK: [2024-05-04 Sat 10:42]--[2024-05-04 Sat 11:07] =>  0:25
CLOCK: [2024-05-04 Sat 10:17]--[2024-05-04 Sat 10:42] =>  0:25
CLOCK: [2024-05-04 Sat 01:12]--[2024-05-04 Sat 01:37] =>  0:25
CLOCK: [2024-05-04 Sat 00:44]--[2024-05-04 Sat 01:09] =>  0:25
CLOCK: [2024-05-03 Fri 23:59]--[2024-05-04 Sat 00:24] =>  0:25
CLOCK: [2024-05-03 Fri 21:43]--[2024-05-03 Fri 22:08] =>  0:25
CLOCK: [2024-05-03 Fri 21:15]--[2024-05-03 Fri 21:40] =>  0:25
CLOCK: [2024-05-03 Fri 20:30]--[2024-05-03 Fri 20:55] =>  0:25
CLOCK: [2024-05-03 Fri 15:39]--[2024-05-03 Fri 16:04] =>  0:25
CLOCK: [2024-05-03 Fri 15:14]--[2024-05-03 Fri 15:39] =>  0:25
CLOCK: [2024-05-03 Fri 14:38]--[2024-05-03 Fri 15:03] =>  0:25
CLOCK: [2024-05-03 Fri 13:14]--[2024-05-03 Fri 13:39] =>  0:25
:END:
移動する。

- メニューを透過できないな。真っ暗になる。fieldだとできるのはなぜだろう
- スプライトを表示できない。何も表示されない
  - geoMで位置を指定してないせいだった
** DONE 影描画をsystemでやる
CLOSED: [2024-05-05 Sun 11:31]
:PROPERTIES:
:Effort:   3:00
:END:
:LOGBOOK:
CLOCK: [2024-05-04 Sat 14:44]--[2024-05-04 Sat 15:09] =>  0:25
CLOCK: [2024-05-04 Sat 12:59]--[2024-05-04 Sat 13:24] =>  0:25
CLOCK: [2024-05-04 Sat 12:34]--[2024-05-04 Sat 12:59] =>  0:25
CLOCK: [2024-05-04 Sat 11:38]--[2024-05-04 Sat 12:03] =>  0:25
:END:
元の仕組みとは異なるため、調整が必要。

- 真っ黒になるな
- レイも見えないので、間違ってるようだ
- 視点と同じ位置にあるために、全部真っ暗になっている説
- 外すと、いくつかのrayがおかしくなっていて失敗する
  - 特定の点がおかしいようだ
- 外周の壁がなくて、交点がないrayがあったせいだった
** DONE フィールド描画をECS化する
CLOSED: [2024-05-05 Sun 11:31]
:PROPERTIES:
:Effort:   5:00
:END:
:LOGBOOK:
CLOCK: [2024-05-03 Fri 11:41]--[2024-05-03 Fri 12:06] =>  0:25
CLOCK: [2024-05-03 Fri 11:08]--[2024-05-03 Fri 11:33] =>  0:25
CLOCK: [2024-05-03 Fri 10:43]--[2024-05-03 Fri 11:08] =>  0:25
CLOCK: [2024-05-03 Fri 10:18]--[2024-05-03 Fri 10:43] =>  0:25
:END:

- まず影は置いておく
- プレイヤー部分を色塗りできた
- スプライトを表示するにはどうすればいいのだろう

#+caption: https://github.com/kijimaD/ruins/blob/aa3088cfd9b52885ee6c5cd71cc7d2bed8495027/lib/loader/level.go#L358-L367 ワープホールのsprite
#+begin_src go
func createWarpNextEntity(componentList *loader.EntityComponentList, gameSpriteSheet *ec.SpriteSheet, line, col int) {
	componentList.Engine = append(componentList.Engine, loader.EngineComponentList{
		SpriteRender: &ec.SpriteRender{SpriteSheet: gameSpriteSheet, SpriteNumber: warpNextSpriteNumber},
		Transform:    &ec.Transform{},
	})
	componentList.Game = append(componentList.Game, GameComponentList{
		Warp:        &gc.Warp{Mode: gc.WarpModeNext},
		GridElement: &gc.GridElement{Line: line, Col: col},
	})
}
#+end_src

- スプライトシートは、起動時にtomlがロードされResourceの構造体に入れられる。ステート名をキーにして別々になっている
  - フィールドは "field" に、まとめて入っている
** DONE とりあえずの背景を設定する
CLOSED: [2024-05-06 Mon 01:51]
Menuをなくしたとき、非表示にしてた。戻す。
** DONE 壁を通過できないようにする
CLOSED: [2024-05-05 Sun 17:01]
:PROPERTIES:
:Effort:   5:00
:END:
:LOGBOOK:
CLOCK: [2024-05-05 Sun 16:33]--[2024-05-05 Sun 16:58] =>  0:25
CLOCK: [2024-05-05 Sun 16:06]--[2024-05-05 Sun 16:31] =>  0:25
CLOCK: [2024-05-05 Sun 11:31]--[2024-05-05 Sun 11:56] =>  0:25
CLOCK: [2024-05-03 Fri 01:22]--[2024-05-03 Fri 01:47] =>  0:25
CLOCK: [2024-05-03 Fri 00:43]--[2024-05-03 Fri 01:08] =>  0:25
CLOCK: [2024-05-02 Thu 23:22]--[2024-05-02 Thu 23:47] =>  0:25
CLOCK: [2024-05-02 Thu 22:54]--[2024-05-02 Thu 23:19] =>  0:25
CLOCK: [2024-05-02 Thu 22:29]--[2024-05-02 Thu 22:54] =>  0:25
CLOCK: [2024-05-02 Thu 21:47]--[2024-05-02 Thu 22:12] =>  0:25
CLOCK: [2024-05-02 Thu 21:17]--[2024-05-02 Thu 21:42] =>  0:25
CLOCK: [2024-05-02 Thu 20:49]--[2024-05-02 Thu 21:14] =>  0:25
CLOCK: [2024-05-02 Thu 01:01]--[2024-05-02 Thu 01:26] =>  0:25
CLOCK: [2024-05-02 Thu 00:32]--[2024-05-02 Thu 00:57] =>  0:25
:END:
- rectの中に入れないようにする。
- 線として持っておく必要はなくて、点4つだけを持っていればいい
- ただそれだとステージの壁を自動生成しづらくなるのだが...
- 範囲内のオブジェクトに対して衝突判定する
- すべてのフィールド上オブジェクトは、中心のx, yをもつ。その中心と合わせてスプライトを配置し、4つの点を衝突判定に使う
  - この方式はキャラクターや敵、飾りオブジェクトには良いが、壁を配置するときには不適当だ。1点ではなくて、4点を指定したいだろう
  - ピクセル単位で配置できなくてもよくて、50ピクセルごととかでよさそう。こうするとテキストファイルでマップを作成できる。壁は50ピクセル正方形で囲って表現する
  - オブジェクト数が大変なことになりそうな懸念。視界をもつキャラごとにあるわけで。とはいえ、視界を限ればそんなでもなさそうな気も。オブジェクト数は多くなるが、そういうもんだろう。
  - 2次元配列の問題に落とし込めることは重要に見える
  - 壁は近傍8タイルで座標を変化させればいい。縦に並んでいれば横は細くするみたいな

#+begin_src
  spawnWall(1, 1) // (1, 1)に壁を生成
  spawnPlayer(2, 2)
  spawnObject("岩", 20, 20)
  spawnObject("花", 30, 30)
  spawnWarp(40, 50)
#+end_src

#+begin_src
  ############
  #          #
  #          #
  /          #
  ############
#+end_src

- 現状のraycastの構造を、1点だけ保持するように修正しようとしているが、よくわからない
- プレイヤーや壁の描画を先にやればよいのでは。影は一度忘れる
