20231128T074518--kdoc-59-ecsを使ってrpgを作る__project.org
** DONE 階層設計
CLOSED: [2024-05-16 Thu 21:32]
:LOGBOOK:
CLOCK: [2024-05-01 Wed 22:47]--[2024-05-01 Wed 23:12] =>  0:25
CLOCK: [2024-05-01 Wed 22:18]--[2024-05-01 Wed 22:43] =>  0:25
CLOCK: [2024-05-01 Wed 21:53]--[2024-05-01 Wed 22:18] =>  0:25
:END:

ランダムだと難しそうなのでとりあえずは手動か。

どうやって内外を判定すればいいのだろう。
** DONE タイルを追加する
CLOSED: [2024-05-16 Thu 22:02]
:PROPERTIES:
:Effort:   8:00
:END:
:LOGBOOK:
CLOCK: [2024-05-15 Wed 21:06]--[2024-05-15 Wed 21:31] =>  0:25
CLOCK: [2024-05-15 Wed 00:49]--[2024-05-15 Wed 01:14] =>  0:25
CLOCK: [2024-05-14 Tue 00:33]--[2024-05-14 Tue 00:58] =>  0:25
CLOCK: [2024-05-13 Mon 23:07]--[2024-05-13 Mon 23:32] =>  0:25
CLOCK: [2024-05-13 Mon 22:21]--[2024-05-13 Mon 22:46] =>  0:25
CLOCK: [2024-05-12 Sun 23:48]--[2024-05-13 Mon 00:13] =>  0:25
CLOCK: [2024-05-12 Sun 16:46]--[2024-05-12 Sun 17:12] =>  0:26
CLOCK: [2024-05-12 Sun 16:09]--[2024-05-12 Sun 16:34] =>  0:25
CLOCK: [2024-05-12 Sun 15:34]--[2024-05-12 Sun 15:59] =>  0:25
:END:
- まだタイルがない。壁はタイルにしたい
- タイルで視界判定をするには
- タイルは、正方形に沿うもの。オブジェクトは沿わないもの
  - 今はオブジェクトだけで、タイルベースでなく扱いにくい。タイルは大量に生成するものなので
- タイル保持の方法をどうするか。メリットデメリットがあまりよくわからない
  - ban-ban-don
  - digger
  - sokoban
- いったんdigger方式でやるか。生成とかしやすそうだし
- 影はややこしいので、とりあえず忘れる
** CLOSE engine コンポーネントを移す
CLOSED: [2024-05-16 Thu 22:03]
:LOGBOOK:
CLOCK: [2024-05-06 Mon 10:57]--[2024-05-06 Mon 11:22] =>  0:25
:END:

分かれてるのがやりづらい。分け方が利用側からすると不明瞭。ただloaderまわりが大変そう。

- うむむ、共通のものはengine部分にあったほうがよい感じもしてきた
- 依存しないためにinterfaceになるが
- SpriteSheet componentsは移せない。engineのResourceで定義されているから。依存してしまう
  - resourceごと移動するか...
** CLOSE いったんクリアできるようにする
CLOSED: [2024-05-16 Thu 22:03]
戦闘抜きで、全体を作る。

- ステージ移動
  - ステージは手動で作っておき、それをランダムに選ぶ
  - 将来的に複数のステージ生成手法から選べるようにしておく
- クリアイベント
  - 20階でクリアできるようにする(仮)
- 戦闘を作成する
- エンカウントする
** CLOSE キャラクタを生成する
CLOSED: [2024-05-16 Thu 22:04]
味方/敵を生成する。
** CLOSE 階の生成方法を考える
CLOSED: [2024-05-16 Thu 22:04]
:LOGBOOK:
CLOCK: [2023-12-03 Sun 12:52]--[2023-12-03 Sun 13:17] =>  0:25
:END:

- ランダム選択の一般階層
  - ダンジョンによって選ばれやすさに偏りがある
  - 5の倍数の場合は帰還ワープも出す
  - すべてのマップに帰還ワープを設定しておく
- ボスの階層
  - 特殊マップ
  - 固定
** DONE 書き換え
CLOSED: [2024-05-18 Sat 10:19]
~gameComponents != nil~ で検索して、HasComponentで書き換える。
** DONE 階層移動できるようにする
CLOSED: [2024-05-18 Sat 17:37]
:PROPERTIES:
:Effort:   4:00
:END:
:LOGBOOK:
CLOCK: [2024-05-18 Sat 17:10]--[2024-05-18 Sat 17:35] =>  0:25
CLOCK: [2024-05-18 Sat 16:16]--[2024-05-18 Sat 16:41] =>  0:25
CLOCK: [2024-05-18 Sat 15:35]--[2024-05-18 Sat 16:00] =>  0:25
CLOCK: [2024-05-18 Sat 15:10]--[2024-05-18 Sat 15:35] =>  0:25
CLOCK: [2024-05-18 Sat 14:40]--[2024-05-18 Sat 15:05] =>  0:25
CLOCK: [2024-05-18 Sat 13:31]--[2024-05-18 Sat 13:56] =>  0:25
CLOCK: [2024-05-18 Sat 13:04]--[2024-05-18 Sat 13:29] =>  0:25
CLOCK: [2024-05-18 Sat 12:24]--[2024-05-18 Sat 12:49] =>  0:25
CLOCK: [2024-05-18 Sat 11:52]--[2024-05-18 Sat 12:17] =>  0:25
CLOCK: [2024-05-18 Sat 11:13]--[2024-05-18 Sat 11:38] =>  0:25
CLOCK: [2024-05-18 Sat 10:48]--[2024-05-18 Sat 11:13] =>  0:25
CLOCK: [2024-05-18 Sat 10:23]--[2024-05-18 Sat 10:48] =>  0:25
CLOCK: [2024-05-18 Sat 09:57]--[2024-05-18 Sat 10:22] =>  0:25
CLOCK: [2024-05-17 Fri 00:30]--[2024-05-17 Fri 00:55] =>  0:25
CLOCK: [2024-05-17 Fri 00:05]--[2024-05-17 Fri 00:30] =>  0:25
CLOCK: [2024-05-16 Thu 22:54]--[2024-05-16 Thu 23:19] =>  0:25
CLOCK: [2024-05-16 Thu 22:28]--[2024-05-16 Thu 22:53] =>  0:25
CLOCK: [2024-05-06 Mon 10:06]--[2024-05-06 Mon 10:31] =>  0:25
:END:
- 触れた判定できるようにする
- 触れたときにイベントを発火する
  - とりあえずタイル。どのタイルにいるか取得する
  - オブジェクトでイベントが発生する場合もある(エンカウント)

#+begin_src git-permalink
https://github.com/kijimaD/ruins/blob/c633001385e79d4ecb783f7fd89ba306730fc3c4/lib/resources/move.go#L70-L74
#+end_src

#+RESULTS:
#+begin_src
		if oneFrontTile.Contains(TileWarpEscape) {
			gameResources := world.Resources.Game.(*Game)
			gameResources.StateEvent = StateEventWarpEscape
			return
		}
#+end_src

field stateの Updateにて。

#+begin_src git-permalink
https://github.com/kijimaD/ruins/blob/c633001385e79d4ecb783f7fd89ba306730fc3c4/lib/states/field.go#L45-L50
#+end_src

#+RESULTS:
#+begin_src
	gameResources := world.Resources.Game.(*resources.Game)
	switch gameResources.StateEvent {
	case resources.StateEventWarpEscape:
		gameResources.StateEvent = resources.StateEventNone
		return states.Transition{Type: states.TransSwitch, NewStates: []states.State{&MainMenuState{}}}
	}
#+end_src

- ワープタイルが表示されない
  - 座標を正しく指定してなかった。タイル座標を指定する
- Componentに保存するだけだと、1つだけその座標のタイルを取れない。全部ループして探す必要がある
- Tileは複数階層が存在しうるので、タイル座標だけでは一意に定まるわけではない

#+begin_src git-permalink
https://github.com/x-hgg-x/sokoban-go/blob/e9d204aeebe393d730fb4bdcb060d249f1470485/lib/resources/game.go#L157
#+end_src

#+RESULTS:
#+begin_src
	grid, levelComponentList := utils.Try2(gloader.LoadLevel(gameResources.Package, levelNum, gridLayout.Width, gridLayout.Height, &gameSpriteSheet))
#+end_src

- gridスライスとコンポーネントを返している。gridはResourceに加えられる
- GridElementのままだと、座標で1つだけ取り出して、ということがしづらい。全体にクエリをかけなければいけない。あらかじめスライスで座標順に並んでいれば、一発で取れるのに
- 階層を生成するときに、Resourceに保存しておけばよさそう

#+begin_src shell
  ####
  #..#
  ....
#+end_src

#+caption: gridの初期化
#+begin_src git-permalink
https://github.com/x-hgg-x/sokoban-go/blob/e9d204aeebe393d730fb4bdcb060d249f1470485/lib/loader/level.go#L315
#+end_src

#+RESULTS:
#+begin_src
	gameGrid := utils.Try(gutils.NewVec2d(gridHeight, gridWidth, tiles))
#+end_src

- ComponentとResourceの2重管理にならないか
  - 2つあっても、初回に生成するだけなら問題ない
  - タイル判定必要なのだろうか
  - ワープパッドはタイルに沿うので、判定のために必要
  - タイルの状態が変わった場合はどうするか。ドアとか、罠とか、スイッチとかはタイルだろうが、状態がある
  - 状態によってスプライトを切り替え、複数回起動しないようにする必要がある。このへんはコンポーネントがやりやすい
- Component: 全ループする処理用。描画とか
- Resource: 位置を指定して特定のタイルを処理する用。現在タイルの確認とか
- タイルが情報を持たないのが原因なのでは。entityを入れればよいのでは

階層移動したとき、ワープホールが消えない。

- 既存のワープホールが消えない
- 新しいワープホールに乗っても機能しない
  - 描画はされている
  - 生成時、座標の縦と横を逆にしていた
** DONE 階数をどこに保持するか
CLOSED: [2024-05-18 Sat 21:57]
:LOGBOOK:
CLOCK: [2024-05-18 Sat 21:31]--[2024-05-18 Sat 21:56] =>  0:25
CLOCK: [2024-05-18 Sat 21:01]--[2024-05-18 Sat 21:26] =>  0:25
CLOCK: [2024-05-18 Sat 18:03]--[2024-05-18 Sat 18:28] =>  0:25
CLOCK: [2024-05-18 Sat 17:37]--[2024-05-18 Sat 18:02] =>  0:25
:END:
- 階層移動したときに、階数までリセットされてしまう
- 便利なのでResourceに保存しておきたい
- いつ階数を初期化するか
  - 現状はstateのonstartで実行してるが、これだと移動したときに毎回リセットがかかる
** DONE WASMローディング表示がほしい
CLOSED: [2024-05-19 Sun 22:31]
:LOGBOOK:
CLOCK: [2024-05-19 Sun 21:51]--[2024-05-19 Sun 22:16] =>  0:25
:END:
3秒くらい真っ白画面になるのがよくない。
