20231128T074518--kdoc-59-ecsを使ってrpgを作る__project.html
<div id="outline-container-org3a5e3ff" class="outline-3">
<h3 id="org3a5e3ff"><a href="#org3a5e3ff"><span class="done DONE">DONE</span> 階層設計</a></h3>
<div class="outline-text-3" id="text-org3a5e3ff">
<p>
ランダムだと難しそうなのでとりあえずは手動か。
</p>

<p>
どうやって内外を判定すればいいのだろう。
</p>
</div>
</div>
<div id="outline-container-org6c83806" class="outline-3">
<h3 id="org6c83806"><a href="#org6c83806"><span class="done DONE">DONE</span> タイルを追加する</a></h3>
<div class="outline-text-3" id="text-org6c83806">
<ul class="org-ul">
<li>まだタイルがない。壁はタイルにしたい</li>
<li>タイルで視界判定をするには</li>
<li>タイルは、正方形に沿うもの。オブジェクトは沿わないもの
<ul class="org-ul">
<li>今はオブジェクトだけで、タイルベースでなく扱いにくい。タイルは大量に生成するものなので</li>
</ul></li>
<li>タイル保持の方法をどうするか。メリットデメリットがあまりよくわからない
<ul class="org-ul">
<li>ban-ban-don</li>
<li>digger</li>
<li>sokoban</li>
</ul></li>
<li>いったんdigger方式でやるか。生成とかしやすそうだし</li>
<li>影はややこしいので、とりあえず忘れる</li>
</ul>
</div>
</div>
<div id="outline-container-orgb41155b" class="outline-3">
<h3 id="orgb41155b"><a href="#orgb41155b"><span class="done CLOSE">CLOSE</span> engine コンポーネントを移す</a></h3>
<div class="outline-text-3" id="text-orgb41155b">
<p>
分かれてるのがやりづらい。分け方が利用側からすると不明瞭。ただloaderまわりが大変そう。
</p>

<ul class="org-ul">
<li>うむむ、共通のものはengine部分にあったほうがよい感じもしてきた</li>
<li>依存しないためにinterfaceになるが</li>
<li>SpriteSheet componentsは移せない。engineのResourceで定義されているから。依存してしまう
<ul class="org-ul">
<li>resourceごと移動するか&#x2026;</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgaaba1cd" class="outline-3">
<h3 id="orgaaba1cd"><a href="#orgaaba1cd"><span class="done CLOSE">CLOSE</span> いったんクリアできるようにする</a></h3>
<div class="outline-text-3" id="text-orgaaba1cd">
<p>
戦闘抜きで、全体を作る。
</p>

<ul class="org-ul">
<li>ステージ移動
<ul class="org-ul">
<li>ステージは手動で作っておき、それをランダムに選ぶ</li>
<li>将来的に複数のステージ生成手法から選べるようにしておく</li>
</ul></li>
<li>クリアイベント
<ul class="org-ul">
<li>20階でクリアできるようにする(仮)</li>
</ul></li>
<li>戦闘を作成する</li>
<li>エンカウントする</li>
</ul>
</div>
</div>
<div id="outline-container-org9311156" class="outline-3">
<h3 id="org9311156"><a href="#org9311156"><span class="done CLOSE">CLOSE</span> キャラクタを生成する</a></h3>
<div class="outline-text-3" id="text-org9311156">
<p>
味方/敵を生成する。
</p>
</div>
</div>
<div id="outline-container-org75687ab" class="outline-3">
<h3 id="org75687ab"><a href="#org75687ab"><span class="done CLOSE">CLOSE</span> 階の生成方法を考える</a></h3>
<div class="outline-text-3" id="text-org75687ab">
<ul class="org-ul">
<li>ランダム選択の一般階層
<ul class="org-ul">
<li>ダンジョンによって選ばれやすさに偏りがある</li>
<li>5の倍数の場合は帰還ワープも出す</li>
<li>すべてのマップに帰還ワープを設定しておく</li>
</ul></li>
<li>ボスの階層
<ul class="org-ul">
<li>特殊マップ</li>
<li>固定</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org0710fbe" class="outline-3">
<h3 id="org0710fbe"><a href="#org0710fbe"><span class="done DONE">DONE</span> 書き換え</a></h3>
<div class="outline-text-3" id="text-org0710fbe">
<p>
<code>gameComponents != nil</code> で検索して、HasComponentで書き換える。
</p>
</div>
</div>
<div id="outline-container-org1f329d8" class="outline-3">
<h3 id="org1f329d8"><a href="#org1f329d8"><span class="done DONE">DONE</span> 階層移動できるようにする</a></h3>
<div class="outline-text-3" id="text-org1f329d8">
<ul class="org-ul">
<li>触れた判定できるようにする</li>
<li>触れたときにイベントを発火する
<ul class="org-ul">
<li>とりあえずタイル。どのタイルにいるか取得する</li>
<li>オブジェクトでイベントが発生する場合もある(エンカウント)</li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-git-permalink">https://github.com/kijimaD/ruins/blob/c633001385e79d4ecb783f7fd89ba306730fc3c4/lib/resources/move.go#L70-L74
</pre>
</div>

<div class="org-src-container">
<pre class="src src-nil">if oneFrontTile.Contains(TileWarpEscape) {
	gameResources := world.Resources.Game.(*Game)
	gameResources.StateEvent = StateEventWarpEscape
	return
}
</pre>
</div>

<p>
field stateの Updateにて。
</p>

<div class="org-src-container">
<pre class="src src-git-permalink">https://github.com/kijimaD/ruins/blob/c633001385e79d4ecb783f7fd89ba306730fc3c4/lib/states/field.go#L45-L50
</pre>
</div>

<div class="org-src-container">
<pre class="src src-nil">gameResources := world.Resources.Game.(*resources.Game)
switch gameResources.StateEvent {
case resources.StateEventWarpEscape:
	gameResources.StateEvent = resources.StateEventNone
	return states.Transition{Type: states.TransSwitch, NewStates: []states.State{&amp;MainMenuState{}}}
}
</pre>
</div>

<ul class="org-ul">
<li>ワープタイルが表示されない
<ul class="org-ul">
<li>座標を正しく指定してなかった。タイル座標を指定する</li>
</ul></li>
<li>Componentに保存するだけだと、1つだけその座標のタイルを取れない。全部ループして探す必要がある</li>
<li>Tileは複数階層が存在しうるので、タイル座標だけでは一意に定まるわけではない</li>
</ul>

<div class="org-src-container">
<pre class="src src-git-permalink">https://github.com/x-hgg-x/sokoban-go/blob/e9d204aeebe393d730fb4bdcb060d249f1470485/lib/resources/game.go#L157
</pre>
</div>

<div class="org-src-container">
<pre class="src src-nil">grid, levelComponentList := utils.Try2(gloader.LoadLevel(gameResources.Package, levelNum, gridLayout.Width, gridLayout.Height, &amp;gameSpriteSheet))
</pre>
</div>

<ul class="org-ul">
<li>gridスライスとコンポーネントを返している。gridはResourceに加えられる</li>
<li>GridElementのままだと、座標で1つだけ取り出して、ということがしづらい。全体にクエリをかけなければいけない。あらかじめスライスで座標順に並んでいれば、一発で取れるのに</li>
<li>階層を生成するときに、Resourceに保存しておけばよさそう</li>
</ul>

<div class="org-src-container">
<pre class="src src-shell"><span class="org-comment-delimiter">####</span><span class="org-comment">
</span><span class="org-comment-delimiter">#</span><span class="org-comment">..#
</span>....
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 5: </span>gridの初期化</label><pre class="src src-git-permalink">https://github.com/x-hgg-x/sokoban-go/blob/e9d204aeebe393d730fb4bdcb060d249f1470485/lib/loader/level.go#L315
</pre>
</div>

<div class="org-src-container">
<pre class="src src-nil">gameGrid := utils.Try(gutils.NewVec2d(gridHeight, gridWidth, tiles))
</pre>
</div>

<ul class="org-ul">
<li>ComponentとResourceの2重管理にならないか
<ul class="org-ul">
<li>2つあっても、初回に生成するだけなら問題ない</li>
<li>タイル判定必要なのだろうか</li>
<li>ワープパッドはタイルに沿うので、判定のために必要</li>
<li>タイルの状態が変わった場合はどうするか。ドアとか、罠とか、スイッチとかはタイルだろうが、状態がある</li>
<li>状態によってスプライトを切り替え、複数回起動しないようにする必要がある。このへんはコンポーネントがやりやすい</li>
</ul></li>
<li>Component: 全ループする処理用。描画とか</li>
<li>Resource: 位置を指定して特定のタイルを処理する用。現在タイルの確認とか</li>
<li>タイルが情報を持たないのが原因なのでは。entityを入れればよいのでは</li>
</ul>

<p>
階層移動したとき、ワープホールが消えない。
</p>

<ul class="org-ul">
<li>既存のワープホールが消えない</li>
<li>新しいワープホールに乗っても機能しない
<ul class="org-ul">
<li>描画はされている</li>
<li>生成時、座標の縦と横を逆にしていた</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgb46a973" class="outline-3">
<h3 id="orgb46a973"><a href="#orgb46a973"><span class="done DONE">DONE</span> 階数をどこに保持するか</a></h3>
<div class="outline-text-3" id="text-orgb46a973">
<ul class="org-ul">
<li>階層移動したときに、階数までリセットされてしまう</li>
<li>便利なのでResourceに保存しておきたい</li>
<li>いつ階数を初期化するか
<ul class="org-ul">
<li>現状はstateのonstartで実行してるが、これだと移動したときに毎回リセットがかかる</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org07e4da7" class="outline-3">
<h3 id="org07e4da7"><a href="#org07e4da7"><span class="done DONE">DONE</span> WASMローディング表示がほしい</a></h3>
<div class="outline-text-3" id="text-org07e4da7">
<p>
3秒くらい真っ白画面になるのがよくない。
</p>
</div>
</div>
