20231128T074518--kdoc-59-ecsを使ってrpgを作る__project.org
** DONE ランダムに部屋を生成する
CLOSED: [2024-05-19 Sun 20:31]
:PROPERTIES:
:Effort:   6:00
:END:
:LOGBOOK:
CLOCK: [2024-05-19 Sun 17:56]--[2024-05-19 Sun 18:21] =>  0:25
CLOCK: [2024-05-19 Sun 17:24]--[2024-05-19 Sun 17:49] =>  0:25
CLOCK: [2024-05-19 Sun 16:54]--[2024-05-19 Sun 17:19] =>  0:25
CLOCK: [2024-05-19 Sun 14:50]--[2024-05-19 Sun 15:15] =>  0:25
CLOCK: [2024-05-19 Sun 14:25]--[2024-05-19 Sun 14:50] =>  0:25
CLOCK: [2024-05-19 Sun 12:50]--[2024-05-19 Sun 13:15] =>  0:25
CLOCK: [2024-05-19 Sun 12:24]--[2024-05-19 Sun 12:49] =>  0:25
:END:
#+begin_src git-permalink
https://github.com/kijimaD/digger_rs/blob/5804eb99182f3f21b733a7d0d0e34ca610b286c6/src/rect.rs#L4-L9
#+end_src

#+RESULTS:
#+begin_src
pub struct Rect {
    pub x1: i32,
    pub x2: i32,
    pub y1: i32,
    pub y2: i32,
}
#+end_src

#+begin_src git-permalink
https://github.com/x-hgg-x/sokoban-go/blob/e9d204aeebe393d730fb4bdcb060d249f1470485/lib/utils/vec2d.go#L5-L9
#+end_src

#+RESULTS:
#+begin_src
type Vec2d[T any] struct {
	NRows int
	NCols int
	Data  []T
}
#+end_src

#+begin_src git-permalink
https://github.com/kijimaD/digger_rs/blob/5804eb99182f3f21b733a7d0d0e34ca610b286c6/src/map/mod.rs#L14-L26
#+end_src

#+RESULTS:
#+begin_src
pub struct Map {
    pub tiles: Vec<TileType>,
    pub width: i32,
    pub height: i32,
    pub revealed_tiles: Vec<bool>,
    pub visible_tiles: Vec<bool>,
    pub depth: i32,
    pub bloodstains: HashSet<usize>,
    pub view_blocked: HashSet<usize>,
    pub name: String,
    pub outdoors: bool,
    pub light: Vec<rltk::RGB>,
}
#+end_src

#+begin_src git-permalink
https://github.com/kijimaD/digger_rs/blob/5804eb99182f3f21b733a7d0d0e34ca610b286c6/src/map_builders/mod.rs#L66-L75
#+end_src

#+RESULTS:
#+begin_src
pub struct BuilderMap {
    pub spawn_list: Vec<(usize, String)>,
    pub map: Map,
    pub starting_position: Option<Position>,
    pub rooms: Option<Vec<Rect>>,
    pub corridors: Option<Vec<Vec<usize>>>,
    pub history: Vec<Map>,
    pub width: i32,
    pub height: i32,
}
#+end_src

- マップ生成時はタイルのスライスを保持する。したがってマップ生成は単にスライスをいじくる処理となる
- 生成したタイルマップは、配置するときエンティティ化する
  - 例: 壁タイルは BlockPass, SpriteRender, GridElement コンポーネントを持つEntityとなる

#+begin_src git-permalink
https://github.com/kijimaD/digger_rs/blob/5804eb99182f3f21b733a7d0d0e34ca610b286c6/src/map_builders/mod.rs#L89-L93
#+end_src

#+RESULTS:
#+begin_src
pub struct BuilderChain {
    starter: Option<Box<dyn InitialMapBuilder>>,
    builders: Vec<Box<dyn MetaMapBuilder>>,
    pub build_data: BuilderMap,
}
#+end_src

- tileをエンティティ化しなくてもいいような気もしてきた
- tileとして、まとめて判定したいのか、〜の性質、で部分で判定したいのかとちらか。タイル判定だとわかりにくいと感じるけどな
** DONE 生成を部屋化する
CLOSED: [2024-05-29 Wed 00:11]
:PROPERTIES:
:Effort:   5:00
:END:
:LOGBOOK:
CLOCK: [2024-05-28 Tue 21:26]--[2024-05-28 Tue 21:51] =>  0:25
CLOCK: [2024-05-28 Tue 20:41]--[2024-05-28 Tue 21:06] =>  0:25
CLOCK: [2024-05-28 Tue 20:05]--[2024-05-28 Tue 20:30] =>  0:25
CLOCK: [2024-05-28 Tue 00:30]--[2024-05-28 Tue 00:56] =>  0:26
CLOCK: [2024-05-27 Mon 22:38]--[2024-05-27 Mon 23:03] =>  0:25
CLOCK: [2024-05-22 Wed 22:42]--[2024-05-22 Wed 23:07] =>  0:25
CLOCK: [2024-05-22 Wed 00:22]--[2024-05-22 Wed 00:47] =>  0:25
CLOCK: [2024-05-21 Tue 23:05]--[2024-05-21 Tue 23:30] =>  0:25
CLOCK: [2024-05-21 Tue 22:29]--[2024-05-21 Tue 22:54] =>  0:25
CLOCK: [2024-05-21 Tue 22:04]--[2024-05-21 Tue 22:29] =>  0:25
CLOCK: [2024-05-21 Tue 21:38]--[2024-05-21 Tue 22:03] =>  0:25
CLOCK: [2024-05-21 Tue 08:29]--[2024-05-21 Tue 08:54] =>  0:25
CLOCK: [2024-05-21 Tue 08:04]--[2024-05-21 Tue 08:29] =>  0:25
CLOCK: [2024-05-21 Tue 00:32]--[2024-05-21 Tue 00:57] =>  0:25
CLOCK: [2024-05-20 Mon 23:48]--[2024-05-21 Tue 00:13] =>  0:25
CLOCK: [2024-05-20 Mon 22:59]--[2024-05-20 Mon 23:24] =>  0:25
CLOCK: [2024-05-20 Mon 22:34]--[2024-05-20 Mon 22:59] =>  0:25
CLOCK: [2024-05-20 Mon 22:08]--[2024-05-20 Mon 22:33] =>  0:25
CLOCK: [2024-05-20 Mon 21:02]--[2024-05-20 Mon 21:27] =>  0:25
CLOCK: [2024-05-20 Mon 19:27]--[2024-05-20 Mon 19:52] =>  0:25
CLOCK: [2024-05-20 Mon 19:02]--[2024-05-20 Mon 19:27] =>  0:25
CLOCK: [2024-05-20 Mon 00:09]--[2024-05-20 Mon 00:34] =>  0:25
CLOCK: [2024-05-19 Sun 22:31]--[2024-05-19 Sun 22:56] =>  0:25
CLOCK: [2024-05-19 Sun 21:26]--[2024-05-19 Sun 21:51] =>  0:25
CLOCK: [2024-05-19 Sun 20:59]--[2024-05-19 Sun 21:24] =>  0:25
CLOCK: [2024-05-19 Sun 20:31]--[2024-05-19 Sun 20:57] =>  0:26
:END:

廊下、道に分けて作る。

- 参考実装がどういう流れで使っているかよくわからないな

#+caption: level_builderで階層によって使うbuilderを決めている
#+begin_src git-permalink
https://github.com/kijimaD/digger_rs/blob/5804eb99182f3f21b733a7d0d0e34ca610b286c6/src/map_builders/mod.rs#L290
#+end_src

#+RESULTS:
#+begin_src go
pub fn level_builder(
#+end_src

#+caption: 決定したbuilderを呼び出している箇所
#+begin_src git-permalink
https://github.com/kijimaD/digger_rs/blob/5804eb99182f3f21b733a7d0d0e34ca610b286c6/src/map/dungeon.rs#L33-L36
#+end_src

#+RESULTS:
#+begin_src go
fn transition_to_new_map(ecs: &mut World, new_depth: i32) -> Vec<Map> {
    let mut rng = ecs.write_resource::<rltk::RandomNumberGenerator>();
    let mut builder = level_builder(new_depth, &mut rng, 80, 50);
    builder.build_map(&mut rng);
#+end_src

- rooms とか corridor をどうやってタイルにしているか

#+caption: draw系でやっている
#+begin_src git-permalink
https://github.com/kijimaD/digger_rs/blob/5804eb99182f3f21b733a7d0d0e34ca610b286c6/src/map_builders/common.rs#L105
#+end_src

#+RESULTS:
#+begin_src
pub fn draw_corridor(map: &mut Map, x1: i32, y1: i32, x2: i32, y2: i32) -> Vec<usize> {
#+end_src

- ↑引数のmapのtileを変更しつつ、corridor(tile indexのスライス)を返す
- NewLevel を消して、 builderに置き換えればいいのかな

#+caption: 部屋ビルダー
#+begin_src git-permalink
https://github.com/kijimaD/digger_rs/blob/5804eb99182f3f21b733a7d0d0e34ca610b286c6/src/map_builders/room_draw.rs#L11
#+end_src

#+RESULTS:
#+begin_src
impl RoomDrawer {
#+end_src

- 廊下がけっこう大変な件
  - 部屋ごとの距離を求めて、最短距離を結ぶ

#+begin_src git-permalink
https://github.com/kijimaD/digger_rs/blob/5804eb99182f3f21b733a7d0d0e34ca610b286c6/src/map_builders/rooms_corridors_lines.rs#L20
#+end_src

#+RESULTS:
#+begin_src
    fn corridors(&mut self, _rng: &mut RandomNumberGenerator, build_data: &mut BuilderMap) {
#+end_src
** DONE 廊下を追加する
CLOSED: [2024-05-30 Thu 00:55]
:PROPERTIES:
:Effort:   5:00
:END:
:LOGBOOK:
CLOCK: [2024-05-29 Wed 21:54]--[2024-05-29 Wed 22:19] =>  0:25
CLOCK: [2024-05-29 Wed 21:21]--[2024-05-29 Wed 21:46] =>  0:25
CLOCK: [2024-05-29 Wed 20:50]--[2024-05-29 Wed 21:15] =>  0:25
:END:

廊下をつなぐ。
** DONE 衝突判定を軽量化する
CLOSED: [2024-06-01 Sat 17:57]
:LOGBOOK:
CLOCK: [2024-05-31 Fri 23:42]--[2024-06-01 Sat 00:07] =>  0:25
CLOCK: [2024-05-30 Thu 22:37]--[2024-05-30 Thu 23:02] =>  0:25
:END:

- 中心距離の近いものだけを接触判定するようにするとよさそう
- フロアを50x50にすると、激しく重くなった
- フロアと接触している壁だけを、影や視線判定の対象にするとよさそう
** DONE 脱出ワープホールを配置する
CLOSED: [2024-06-01 Sat 19:49]
:LOGBOOK:
CLOCK: [2024-06-01 Sat 18:32]--[2024-06-01 Sat 18:57] =>  0:25
CLOCK: [2024-06-01 Sat 17:58]--[2024-06-01 Sat 18:23] =>  0:25
:END:
今は次の階層しかない。
** DONE 壁の影を軽量化する
CLOSED: [2024-06-02 Sun 10:56]
:LOGBOOK:
CLOCK: [2024-06-02 Sun 01:16]--[2024-06-02 Sun 01:41] =>  0:25
:END:
先に影画像を生成しておいて、軽くする。
