20231128T074518--kdoc-59-ecsを使ってrpgを作る__project.html
<div id="outline-container-orgc557985" class="outline-3">
<h3 id="orgc557985"><a href="#orgc557985"><span class="done DONE">DONE</span> ランダムに部屋を生成する</a></h3>
<div class="outline-text-3" id="text-orgc557985">
<div class="org-src-container">
<pre class="src src-git-permalink">https://github.com/kijimaD/digger_rs/blob/5804eb99182f3f21b733a7d0d0e34ca610b286c6/src/rect.rs#L4-L9
</pre>
</div>

<div class="org-src-container">
<pre class="src src-nil">pub struct Rect {
    pub x1: i32,
    pub x2: i32,
    pub y1: i32,
    pub y2: i32,
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-git-permalink">https://github.com/x-hgg-x/sokoban-go/blob/e9d204aeebe393d730fb4bdcb060d249f1470485/lib/utils/vec2d.go#L5-L9
</pre>
</div>

<div class="org-src-container">
<pre class="src src-nil">type Vec2d[T any] struct {
	NRows int
	NCols int
	Data  []T
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-git-permalink">https://github.com/kijimaD/digger_rs/blob/5804eb99182f3f21b733a7d0d0e34ca610b286c6/src/map/mod.rs#L14-L26
</pre>
</div>

<div class="org-src-container">
<pre class="src src-nil">pub struct Map {
    pub tiles: Vec&lt;TileType&gt;,
    pub width: i32,
    pub height: i32,
    pub revealed_tiles: Vec&lt;bool&gt;,
    pub visible_tiles: Vec&lt;bool&gt;,
    pub depth: i32,
    pub bloodstains: HashSet&lt;usize&gt;,
    pub view_blocked: HashSet&lt;usize&gt;,
    pub name: String,
    pub outdoors: bool,
    pub light: Vec&lt;rltk::RGB&gt;,
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-git-permalink">https://github.com/kijimaD/digger_rs/blob/5804eb99182f3f21b733a7d0d0e34ca610b286c6/src/map_builders/mod.rs#L66-L75
</pre>
</div>

<div class="org-src-container">
<pre class="src src-nil">pub struct BuilderMap {
    pub spawn_list: Vec&lt;(usize, String)&gt;,
    pub map: Map,
    pub starting_position: Option&lt;Position&gt;,
    pub rooms: Option&lt;Vec&lt;Rect&gt;&gt;,
    pub corridors: Option&lt;Vec&lt;Vec&lt;usize&gt;&gt;&gt;,
    pub history: Vec&lt;Map&gt;,
    pub width: i32,
    pub height: i32,
}
</pre>
</div>

<ul class="org-ul">
<li>マップ生成時はタイルのスライスを保持する。したがってマップ生成は単にスライスをいじくる処理となる</li>
<li>生成したタイルマップは、配置するときエンティティ化する
<ul class="org-ul">
<li>例: 壁タイルは BlockPass, SpriteRender, GridElement コンポーネントを持つEntityとなる</li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-git-permalink">https://github.com/kijimaD/digger_rs/blob/5804eb99182f3f21b733a7d0d0e34ca610b286c6/src/map_builders/mod.rs#L89-L93
</pre>
</div>

<div class="org-src-container">
<pre class="src src-nil">pub struct BuilderChain {
    starter: Option&lt;Box&lt;dyn InitialMapBuilder&gt;&gt;,
    builders: Vec&lt;Box&lt;dyn MetaMapBuilder&gt;&gt;,
    pub build_data: BuilderMap,
}
</pre>
</div>

<ul class="org-ul">
<li>tileをエンティティ化しなくてもいいような気もしてきた</li>
<li>tileとして、まとめて判定したいのか、〜の性質、で部分で判定したいのかとちらか。タイル判定だとわかりにくいと感じるけどな</li>
</ul>
</div>
</div>
<div id="outline-container-org04f726e" class="outline-3">
<h3 id="org04f726e"><a href="#org04f726e"><span class="done DONE">DONE</span> 生成を部屋化する</a></h3>
<div class="outline-text-3" id="text-org04f726e">
<p>
廊下、道に分けて作る。
</p>

<ul class="org-ul">
<li>参考実装がどういう流れで使っているかよくわからないな</li>
</ul>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 6: </span>level_builderで階層によって使うbuilderを決めている</label><pre class="src src-git-permalink">https://github.com/kijimaD/digger_rs/blob/5804eb99182f3f21b733a7d0d0e34ca610b286c6/src/map_builders/mod.rs#L290
</pre>
</div>

<div class="org-src-container">
<pre class="src src-go">pub fn level_builder(
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 7: </span>決定したbuilderを呼び出している箇所</label><pre class="src src-git-permalink">https://github.com/kijimaD/digger_rs/blob/5804eb99182f3f21b733a7d0d0e34ca610b286c6/src/map/dungeon.rs#L33-L36
</pre>
</div>

<div class="org-src-container">
<pre class="src src-go">fn transition_to_new_map(ecs: &amp;mut World, new_depth: i32) -&gt; Vec&lt;Map&gt; {
    let mut rng = ecs.write_resource::&lt;rltk::RandomNumberGenerator&gt;();
    let mut builder = level_builder(new_depth, &amp;mut rng, 80, 50);
    builder.build_map(&amp;mut rng);
</pre>
</div>

<ul class="org-ul">
<li>rooms とか corridor をどうやってタイルにしているか</li>
</ul>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 8: </span>draw系でやっている</label><pre class="src src-git-permalink">https://github.com/kijimaD/digger_rs/blob/5804eb99182f3f21b733a7d0d0e34ca610b286c6/src/map_builders/common.rs#L105
</pre>
</div>

<div class="org-src-container">
<pre class="src src-nil">pub fn draw_corridor(map: &amp;mut Map, x1: i32, y1: i32, x2: i32, y2: i32) -&gt; Vec&lt;usize&gt; {
</pre>
</div>

<ul class="org-ul">
<li>↑引数のmapのtileを変更しつつ、corridor(tile indexのスライス)を返す</li>
<li>NewLevel を消して、 builderに置き換えればいいのかな</li>
</ul>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 9: </span>部屋ビルダー</label><pre class="src src-git-permalink">https://github.com/kijimaD/digger_rs/blob/5804eb99182f3f21b733a7d0d0e34ca610b286c6/src/map_builders/room_draw.rs#L11
</pre>
</div>

<div class="org-src-container">
<pre class="src src-nil">impl RoomDrawer {
</pre>
</div>

<ul class="org-ul">
<li>廊下がけっこう大変な件
<ul class="org-ul">
<li>部屋ごとの距離を求めて、最短距離を結ぶ</li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-git-permalink">https://github.com/kijimaD/digger_rs/blob/5804eb99182f3f21b733a7d0d0e34ca610b286c6/src/map_builders/rooms_corridors_lines.rs#L20
</pre>
</div>

<div class="org-src-container">
<pre class="src src-nil">fn corridors(&amp;mut self, _rng: &amp;mut RandomNumberGenerator, build_data: &amp;mut BuilderMap) {
</pre>
</div>
</div>
</div>
<div id="outline-container-org8e42c92" class="outline-3">
<h3 id="org8e42c92"><a href="#org8e42c92"><span class="done DONE">DONE</span> 廊下を追加する</a></h3>
<div class="outline-text-3" id="text-org8e42c92">
<p>
廊下をつなぐ。
</p>
</div>
</div>
<div id="outline-container-org92908ba" class="outline-3">
<h3 id="org92908ba"><a href="#org92908ba"><span class="done DONE">DONE</span> 衝突判定を軽量化する</a></h3>
<div class="outline-text-3" id="text-org92908ba">
<ul class="org-ul">
<li>中心距離の近いものだけを接触判定するようにするとよさそう</li>
<li>フロアを50x50にすると、激しく重くなった</li>
<li>フロアと接触している壁だけを、影や視線判定の対象にするとよさそう</li>
</ul>
</div>
</div>
<div id="outline-container-org79e76a1" class="outline-3">
<h3 id="org79e76a1"><a href="#org79e76a1"><span class="done DONE">DONE</span> 脱出ワープホールを配置する</a></h3>
<div class="outline-text-3" id="text-org79e76a1">
<p>
今は次の階層しかない。
</p>
</div>
</div>
<div id="outline-container-org2e5a37e" class="outline-3">
<h3 id="org2e5a37e"><a href="#org2e5a37e"><span class="done DONE">DONE</span> 壁の影を軽量化する</a></h3>
<div class="outline-text-3" id="text-org2e5a37e">
<p>
先に影画像を生成しておいて、軽くする。
</p>
</div>
</div>
