20231128T074518--kdoc-59-ecsを使ってrpgを作る__project.org
** DONE シナリオジャンプを実装する
CLOSED: [2024-09-26 Thu 08:02]
:PROPERTIES:
:Effort:   4:00
:END:
:LOGBOOK:
CLOCK: [2024-09-25 Wed 23:47]--[2024-09-26 Thu 00:12] =>  0:25
CLOCK: [2024-09-25 Wed 22:57]--[2024-09-25 Wed 23:22] =>  0:25
CLOCK: [2024-09-25 Wed 21:42]--[2024-09-25 Wed 22:07] =>  0:25
CLOCK: [2024-09-25 Wed 21:13]--[2024-09-25 Wed 21:38] =>  0:25
CLOCK: [2024-09-25 Wed 20:25]--[2024-09-25 Wed 20:50] =>  0:25
CLOCK: [2024-09-25 Wed 19:22]--[2024-09-25 Wed 19:47] =>  0:25
CLOCK: [2024-09-25 Wed 18:56]--[2024-09-25 Wed 19:21] =>  0:25
CLOCK: [2024-09-25 Wed 18:31]--[2024-09-25 Wed 18:56] =>  0:25
CLOCK: [2024-09-25 Wed 18:06]--[2024-09-25 Wed 18:31] =>  0:25
CLOCK: [2024-09-25 Wed 00:09]--[2024-09-25 Wed 00:34] =>  0:25
CLOCK: [2024-09-24 Tue 23:27]--[2024-09-24 Tue 23:52] =>  0:25
CLOCK: [2024-09-24 Tue 22:05]--[2024-09-24 Tue 22:30] =>  0:25
CLOCK: [2024-09-24 Tue 21:29]--[2024-09-24 Tue 21:54] =>  0:25
CLOCK: [2024-09-24 Tue 20:14]--[2024-09-24 Tue 20:39] =>  0:25
CLOCK: [2024-09-24 Tue 19:34]--[2024-09-24 Tue 19:59] =>  0:25
CLOCK: [2024-09-24 Tue 19:09]--[2024-09-24 Tue 19:34] =>  0:25
CLOCK: [2024-09-24 Tue 18:44]--[2024-09-24 Tue 19:09] =>  0:25
CLOCK: [2024-09-23 Mon 23:06]--[2024-09-23 Mon 23:31] =>  0:25
CLOCK: [2024-09-23 Mon 22:34]--[2024-09-23 Mon 22:59] =>  0:25
CLOCK: [2024-09-23 Mon 21:42]--[2024-09-23 Mon 22:07] =>  0:25
CLOCK: [2024-09-23 Mon 21:10]--[2024-09-23 Mon 21:35] =>  0:25
CLOCK: [2024-09-23 Mon 20:43]--[2024-09-23 Mon 21:08] =>  0:25
CLOCK: [2024-09-23 Mon 19:23]--[2024-09-23 Mon 19:48] =>  0:25
CLOCK: [2024-09-23 Mon 18:48]--[2024-09-23 Mon 19:13] =>  0:25
CLOCK: [2024-09-23 Mon 18:19]--[2024-09-23 Mon 18:44] =>  0:25
CLOCK: [2024-09-23 Mon 17:48]--[2024-09-23 Mon 18:13] =>  0:25
CLOCK: [2024-09-23 Mon 10:58]--[2024-09-23 Mon 11:23] =>  0:25
CLOCK: [2024-09-23 Mon 10:31]--[2024-09-23 Mon 10:56] =>  0:25
CLOCK: [2024-09-23 Mon 10:05]--[2024-09-23 Mon 10:30] =>  0:25
CLOCK: [2024-09-23 Mon 09:39]--[2024-09-23 Mon 10:04] =>  0:25
:END:

[[https://krkrz.github.io/krkr2doc/kag3doc/contents/Tags.html#jump][吉里吉里タグリファレンス]]を調べた。

- ファイルをまたぐ外部ジャンプ
- ファイル内の内部ジャンプ
- ファイルごとでメモリに読み込まれている雰囲気
- 外部ジャンプはとりあえずいらない
  - 外部ジャンプは、ファイルごとで名前空間が切れるとかの理由だろうか。整理されそう
- 関数みたいにパースすればよさそうな

#+begin_src
; ラベル定義
*extraflagend

; ジャンプ
[jump target=*sel02_loop]
#+end_src

#+begin_src
*label1
...
...
*label2
...
...
#+end_src

- ラベル1
  - 文字列
  - コマンド
  - 文字列
  - 文字列
- ラベル2
  - 文字列
  - コマンド
  - コマンド
  - 文字列

的な構造となる。

- ラベル
  - 文1
  - 文2

ラベルテーブルに登録する。

#+begin_src
*start
開始
[jmp dest="sample1"]
*sample1
終了
*sample2
#+end_src

- 一連のイベントが終了したらどうなるんだ。とりあえず今のように止まるでよい
- jmpしたあとは戻ってこないものとする
- ほかのステートとの連携とか考えると全然わからない。いったん忘れる
- サンプルでは、関数名の登録とかどうやっているか
  - ~変数 = fn(){}~ 形式だから、変数と同じ仕組みになっている
  - evalはオブジェクトを返す。オブジェクトは即値を返すメソッドを持っていて、計算もしくは表示に使える
- 先にlabel名を登録する必要があるような
  - jumpEvent{dest: "aaa"}
  - いや、別にやらなくてもいいのか。イベント実行時に解釈すればいい
- 投入した時点で、イベントオブジェクトが一意に定まる
  - label1: ...
  - label2: ...
  - label3: ...
  - 内部jumpだけでなく、どこから開始する、という命令も使える
  - start("label1")
  - 選択肢が実装できると、メニューも実装できるのか
- 通常のコードは、1つの値を返す。途中のコードはすべて評価される
- ノベルエンジンは、評価はない。途中も必要である

一連の流れ。

#+begin_src
  p := parse()
  e := Eval(p)
  events1 := e("sample1")
  events2 := e("sample2")
#+end_src
** DONE 改行とか直す
CLOSED: [2024-09-26 Thu 21:10]
:LOGBOOK:
CLOCK: [2024-09-26 Thu 19:33]--[2024-09-26 Thu 19:58] =>  0:25
CLOCK: [2024-09-26 Thu 17:57]--[2024-09-26 Thu 18:22] =>  0:25
:END:

- 現状、改行があるたびに別イベントとなっている。なのでクリックが必要である。これを1つにまとめてしまう
  - どこまでひとまとめとするか
- 見たままが改行となる
- 自動改行があれば問題ないような
- そんなに手動で改行入れたいことないしな

#+begin_src shell
  *start
  ああああ
  いいいい[p]
  かかかか
  きききき[p]
#+end_src

- [l]を実行した待ちにしたいときに、自動改行が無視されて飛び出す。待ったあとは強制改行でよいだろう

** DONE メッセージエンジンのサンプル実装を作る
CLOSED: [2024-09-26 Thu 21:10]
:LOGBOOK:
CLOCK: [2024-09-26 Thu 08:05]--[2024-09-26 Thu 08:30] =>  0:25
:END:
まだGUIで見られないのでよくわからないため。

** DONE メッセージシステムのパッケージを切り出す
CLOSED: [2024-09-26 Thu 21:11]
:LOGBOOK:
CLOCK: [2024-09-22 Sun 23:06]--[2024-09-22 Sun 23:31] =>  0:25
CLOCK: [2024-09-22 Sun 22:07]--[2024-09-22 Sun 22:32] =>  0:25
CLOCK: [2024-09-22 Sun 21:38]--[2024-09-22 Sun 22:03] =>  0:25
CLOCK: [2024-09-22 Sun 21:07]--[2024-09-22 Sun 21:32] =>  0:25
CLOCK: [2024-09-22 Sun 20:19]--[2024-09-22 Sun 20:44] =>  0:25
CLOCK: [2024-09-22 Sun 19:44]--[2024-09-22 Sun 20:09] =>  0:25
CLOCK: [2024-09-22 Sun 19:06]--[2024-09-22 Sun 19:31] =>  0:25
CLOCK: [2024-09-22 Sun 18:36]--[2024-09-22 Sun 19:01] =>  0:25
CLOCK: [2024-09-22 Sun 17:20]--[2024-09-22 Sun 17:45] =>  0:25
CLOCK: [2024-09-22 Sun 16:43]--[2024-09-22 Sun 17:08] =>  0:25
CLOCK: [2024-09-22 Sun 16:17]--[2024-09-22 Sun 16:42] =>  0:25
CLOCK: [2024-09-22 Sun 15:52]--[2024-09-22 Sun 16:17] =>  0:25
CLOCK: [2024-09-22 Sun 14:19]--[2024-09-22 Sun 14:44] =>  0:25
CLOCK: [2024-09-22 Sun 13:50]--[2024-09-22 Sun 14:15] =>  0:25
CLOCK: [2024-09-22 Sun 13:25]--[2024-09-22 Sun 13:50] =>  0:25
CLOCK: [2024-09-22 Sun 11:45]--[2024-09-22 Sun 12:10] =>  0:25
CLOCK: [2024-09-22 Sun 11:20]--[2024-09-22 Sun 11:45] =>  0:25
CLOCK: [2024-09-22 Sun 10:36]--[2024-09-22 Sun 11:01] =>  0:25
CLOCK: [2024-09-22 Sun 10:11]--[2024-09-22 Sun 10:36] =>  0:25
CLOCK: [2024-09-22 Sun 01:06]--[2024-09-22 Sun 01:31] =>  0:25
CLOCK: [2024-09-22 Sun 00:28]--[2024-09-22 Sun 00:53] =>  0:25
CLOCK: [2024-09-21 Sat 22:13]--[2024-09-21 Sat 22:38] =>  0:25
CLOCK: [2024-09-21 Sat 21:38]--[2024-09-21 Sat 22:03] =>  0:25
CLOCK: [2024-09-21 Sat 21:10]--[2024-09-21 Sat 21:35] =>  0:25
CLOCK: [2024-09-21 Sat 20:43]--[2024-09-21 Sat 21:08] =>  0:25
CLOCK: [2024-09-21 Sat 20:06]--[2024-09-21 Sat 20:31] =>  0:25
CLOCK: [2024-09-21 Sat 19:37]--[2024-09-21 Sat 20:02] =>  0:25
CLOCK: [2024-09-21 Sat 18:08]--[2024-09-21 Sat 18:33] =>  0:25
:END:

今は1パッケージに入っていてわかりにくい。

- テキストを解釈してイベントとし、キューに入れる
- 呼び出し側で解釈してイベントごとに処理していく
- Pop() キューからイベントを取り出す。呼び出し側から実行される。クリック時などを想定
  - イベントを通知する。呼び出し側での処理が必要なものもある
  - animText 現在表示中としたいテキスト。allとbufを持つ。bufはアニメーション用に1文字ずつ入っていく
    - 1文字ずつ送っていくのをどうするか。時間実行だとテストが面倒だからやりたくない。1文字ずつAPIを叩くか、一気に表示するAPIによって文字表示を再現できるようにしたい
    - 1文字ずつループにどうやって割り込めばいいのか。キューにskipフラグを持てばよいか
    - animTextは状態を持つ、ということになる
    - なのでPopしても次のイベントに進まないことがある
  - changeBG <呼び出し側での処理が必要>
  - clickWait クリック待ち
  - sleep <呼び出し側での処理が必要>
- 呼び出し側からエンジンに作用できないといけないのか
  - メッセージスキップとか
- Head()
- Popしたときに先頭のやつを実行するのか
  - キューを食うのが2つあることが混乱の原因になっている。テキストエンジンと呼び出し側
- queue.Pop()
  - 先頭のEventの状態が未完了であればSkip()するだけにする
- queue.Display()
  - 勝手に増えていく
  - 呼び出し側ではメッセージを表示する。メッセージはどのイベントでも常に表示するものだから
- もう1つキューを追加するのはどうだろう
  - 全体バッファと現在バッファがあって、追いつかせるように非同期実行する
- キューの終了もeventとする
- 実行中 -> (強制スキップ) -> 終了 -> 次のタスク
  - テキスト送り中にボタン押すと全部文章が表示されるような感じ
  - スキップ操作など用のキューも別で用意しておくとよさそう
- Pop()とSkip()を状況に合わせて使い分けたい
  - 現在のタスクが終わっていればPop()
  - 現在のタスクが終わってなければSkip()
** DONE クリック待ち状態を表示できるようにする
CLOSED: [2024-09-29 Sun 00:01]
:LOGBOOK:
CLOCK: [2024-09-26 Thu 21:33]--[2024-09-26 Thu 21:58] =>  0:25
:END:
- 待ち
** DONE 戻れるようにする
CLOSED: [2024-09-30 Mon 11:56]
popの逆を辿れるようにしたい。今消しちゃってるのをインデックスにすればよいだろう。

1つ戻るのは、意外に面倒だ。一気に最初に戻るだけにした。
** DONE イベント捕捉
CLOSED: [2024-09-30 Mon 20:45]
:LOGBOOK:
CLOCK: [2024-09-30 Mon 18:46]--[2024-09-30 Mon 19:11] =>  0:25
CLOCK: [2024-09-30 Mon 18:20]--[2024-09-30 Mon 18:45] =>  0:25
:END:

今のところテキストだけで、背景変更などを捕捉できていない。

- テキストまわりのインターフェースはbufでやっている。これによって、呼び出し側はそれを画面に表示すればいいだけになっている
- イベントは、チャネルなどに流すのがよさそうか
** DONE 『坊っちゃん』でサンプルを作る
CLOSED: [2024-10-03 Thu 01:24]
:LOGBOOK:
CLOCK: [2024-10-02 Wed 22:15]--[2024-10-02 Wed 22:40] =>  0:25
CLOCK: [2024-10-02 Wed 21:39]--[2024-10-02 Wed 22:04] =>  0:25
CLOCK: [2024-10-02 Wed 20:22]--[2024-10-02 Wed 20:47] =>  0:25
CLOCK: [2024-10-02 Wed 19:57]--[2024-10-02 Wed 20:22] =>  0:25
CLOCK: [2024-10-02 Wed 19:26]--[2024-10-02 Wed 19:51] =>  0:25
CLOCK: [2024-09-30 Mon 22:33]--[2024-09-30 Mon 22:58] =>  0:25
CLOCK: [2024-09-30 Mon 21:02]--[2024-09-30 Mon 21:27] =>  0:25
:END:

作る。

- 任意の場所での改行ができない

#+begin_src
「おい」
「おい」
「来たぜ」
「とうとう来た」
「これでようやく安心した」

これは1行ずつ表示したい
#+end_src

改行して、次の行に何もないと、自動改行のカウンタがリセットされてないので横に文字が表示されてしまう。

#+begin_src
 あいうえお
 かきくけこ
 たちつてと<なにぬねの>
#+end_src

この場合、「なにぬねの」を改行してほしい。
** DONE シナリオを一覧できるようにする
CLOSED: [2024-10-05 Sat 11:08]
:LOGBOOK:
CLOCK: [2024-10-05 Sat 10:21]--[2024-10-05 Sat 10:46] =>  0:25
CLOCK: [2024-10-05 Sat 09:47]--[2024-10-05 Sat 10:12] =>  0:25
CLOCK: [2024-10-04 Fri 23:59]--[2024-10-05 Sat 00:24] =>  0:25
:END:
- 一覧すれば、ジャンプは簡単にできる
** CLOSE 視覚影でスプライトが隠れているのを直す
CLOSED: [2024-10-05 Sat 22:56]
近くのライトで見られるようにしたが、微妙だ。

- 壁の向こう側が見える
  - 対策のため1マス分だけ照らすようにしたが、変だ
- やはり、直接視界が当たった部分はフラグをもたせて表示するのがよさそう
  - 個別のタイルごとにあるので、新しくコンポーネントを作ったほうがよさそう
  - ~IsHide~ とか
- ここに時間かけてもしょうがないから後回しか
