20231128T074518--kdoc-59-ecsを使ってrpgを作る__project.html
<div id="outline-container-org85bd7a4" class="outline-3">
<h3 id="org85bd7a4"><a href="#org85bd7a4"><span class="done DONE">DONE</span> シナリオジャンプを実装する</a></h3>
<div class="outline-text-3" id="text-org85bd7a4">
<p>
<a href="https://krkrz.github.io/krkr2doc/kag3doc/contents/Tags.html#jump">吉里吉里タグリファレンス</a>を調べた。
</p>

<ul class="org-ul">
<li>ファイルをまたぐ外部ジャンプ</li>
<li>ファイル内の内部ジャンプ</li>
<li>ファイルごとでメモリに読み込まれている雰囲気</li>
<li>外部ジャンプはとりあえずいらない
<ul class="org-ul">
<li>外部ジャンプは、ファイルごとで名前空間が切れるとかの理由だろうか。整理されそう</li>
</ul></li>
<li>関数みたいにパースすればよさそうな</li>
</ul>

<div class="org-src-container">
<pre class="src src-nil">; ラベル定義
*extraflagend

; ジャンプ
[jump target=*sel02_loop]
</pre>
</div>

<div class="org-src-container">
<pre class="src src-nil">*label1
...
...
*label2
...
...
</pre>
</div>

<ul class="org-ul">
<li>ラベル1
<ul class="org-ul">
<li>文字列</li>
<li>コマンド</li>
<li>文字列</li>
<li>文字列</li>
</ul></li>
<li>ラベル2
<ul class="org-ul">
<li>文字列</li>
<li>コマンド</li>
<li>コマンド</li>
<li>文字列</li>
</ul></li>
</ul>

<p>
的な構造となる。
</p>

<ul class="org-ul">
<li>ラベル
<ul class="org-ul">
<li>文1</li>
<li>文2</li>
</ul></li>
</ul>

<p>
ラベルテーブルに登録する。
</p>

<div class="org-src-container">
<pre class="src src-nil">*start
開始
[jmp dest="sample1"]
*sample1
終了
*sample2
</pre>
</div>

<ul class="org-ul">
<li>一連のイベントが終了したらどうなるんだ。とりあえず今のように止まるでよい</li>
<li>jmpしたあとは戻ってこないものとする</li>
<li>ほかのステートとの連携とか考えると全然わからない。いったん忘れる</li>
<li>サンプルでは、関数名の登録とかどうやっているか
<ul class="org-ul">
<li><code>変数 = fn(){}</code> 形式だから、変数と同じ仕組みになっている</li>
<li>evalはオブジェクトを返す。オブジェクトは即値を返すメソッドを持っていて、計算もしくは表示に使える</li>
</ul></li>
<li>先にlabel名を登録する必要があるような
<ul class="org-ul">
<li>jumpEvent{dest: &ldquo;aaa&rdquo;}</li>
<li>いや、別にやらなくてもいいのか。イベント実行時に解釈すればいい</li>
</ul></li>
<li>投入した時点で、イベントオブジェクトが一意に定まる
<ul class="org-ul">
<li>label1: &#x2026;</li>
<li>label2: &#x2026;</li>
<li>label3: &#x2026;</li>
<li>内部jumpだけでなく、どこから開始する、という命令も使える</li>
<li>start(&ldquo;label1&rdquo;)</li>
<li>選択肢が実装できると、メニューも実装できるのか</li>
</ul></li>
<li>通常のコードは、1つの値を返す。途中のコードはすべて評価される</li>
<li>ノベルエンジンは、評価はない。途中も必要である</li>
</ul>

<p>
一連の流れ。
</p>

<div class="org-src-container">
<pre class="src src-nil">p := parse()
e := Eval(p)
events1 := e("sample1")
events2 := e("sample2")
</pre>
</div>
</div>
</div>
<div id="outline-container-org84cfa33" class="outline-3">
<h3 id="org84cfa33"><a href="#org84cfa33"><span class="done DONE">DONE</span> 改行とか直す</a></h3>
<div class="outline-text-3" id="text-org84cfa33">
<ul class="org-ul">
<li>現状、改行があるたびに別イベントとなっている。なのでクリックが必要である。これを1つにまとめてしまう
<ul class="org-ul">
<li>どこまでひとまとめとするか</li>
</ul></li>
<li>見たままが改行となる</li>
<li>自動改行があれば問題ないような</li>
<li>そんなに手動で改行入れたいことないしな</li>
</ul>

<div class="org-src-container">
<pre class="src src-shell">*start
&#12354;&#12354;&#12354;&#12354;
&#12356;&#12356;&#12356;&#12356;[p]
&#12363;&#12363;&#12363;&#12363;
&#12365;&#12365;&#12365;&#12365;[p]
</pre>
</div>

<ul class="org-ul">
<li>[l]を実行した待ちにしたいときに、自動改行が無視されて飛び出す。待ったあとは強制改行でよいだろう</li>
</ul>
</div>
</div>
<div id="outline-container-org7262c54" class="outline-3">
<h3 id="org7262c54"><a href="#org7262c54"><span class="done DONE">DONE</span> メッセージエンジンのサンプル実装を作る</a></h3>
<div class="outline-text-3" id="text-org7262c54">
<p>
まだGUIで見られないのでよくわからないため。
</p>
</div>
</div>
<div id="outline-container-orgadf46f5" class="outline-3">
<h3 id="orgadf46f5"><a href="#orgadf46f5"><span class="done DONE">DONE</span> メッセージシステムのパッケージを切り出す</a></h3>
<div class="outline-text-3" id="text-orgadf46f5">
<p>
今は1パッケージに入っていてわかりにくい。
</p>

<ul class="org-ul">
<li>テキストを解釈してイベントとし、キューに入れる</li>
<li>呼び出し側で解釈してイベントごとに処理していく</li>
<li>Pop() キューからイベントを取り出す。呼び出し側から実行される。クリック時などを想定
<ul class="org-ul">
<li>イベントを通知する。呼び出し側での処理が必要なものもある</li>
<li>animText 現在表示中としたいテキスト。allとbufを持つ。bufはアニメーション用に1文字ずつ入っていく
<ul class="org-ul">
<li>1文字ずつ送っていくのをどうするか。時間実行だとテストが面倒だからやりたくない。1文字ずつAPIを叩くか、一気に表示するAPIによって文字表示を再現できるようにしたい</li>
<li>1文字ずつループにどうやって割り込めばいいのか。キューにskipフラグを持てばよいか</li>
<li>animTextは状態を持つ、ということになる</li>
<li>なのでPopしても次のイベントに進まないことがある</li>
</ul></li>
<li>changeBG &lt;呼び出し側での処理が必要&gt;</li>
<li>clickWait クリック待ち</li>
<li>sleep &lt;呼び出し側での処理が必要&gt;</li>
</ul></li>
<li>呼び出し側からエンジンに作用できないといけないのか
<ul class="org-ul">
<li>メッセージスキップとか</li>
</ul></li>
<li>Head()</li>
<li>Popしたときに先頭のやつを実行するのか
<ul class="org-ul">
<li>キューを食うのが2つあることが混乱の原因になっている。テキストエンジンと呼び出し側</li>
</ul></li>
<li>queue.Pop()
<ul class="org-ul">
<li>先頭のEventの状態が未完了であればSkip()するだけにする</li>
</ul></li>
<li>queue.Display()
<ul class="org-ul">
<li>勝手に増えていく</li>
<li>呼び出し側ではメッセージを表示する。メッセージはどのイベントでも常に表示するものだから</li>
</ul></li>
<li>もう1つキューを追加するのはどうだろう
<ul class="org-ul">
<li>全体バッファと現在バッファがあって、追いつかせるように非同期実行する</li>
</ul></li>
<li>キューの終了もeventとする</li>
<li>実行中 -&gt; (強制スキップ) -&gt; 終了 -&gt; 次のタスク
<ul class="org-ul">
<li>テキスト送り中にボタン押すと全部文章が表示されるような感じ</li>
<li>スキップ操作など用のキューも別で用意しておくとよさそう</li>
</ul></li>
<li>Pop()とSkip()を状況に合わせて使い分けたい
<ul class="org-ul">
<li>現在のタスクが終わっていればPop()</li>
<li>現在のタスクが終わってなければSkip()</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgc291b8e" class="outline-3">
<h3 id="orgc291b8e"><a href="#orgc291b8e"><span class="done DONE">DONE</span> クリック待ち状態を表示できるようにする</a></h3>
<div class="outline-text-3" id="text-orgc291b8e">
<ul class="org-ul">
<li>待ち</li>
</ul>
</div>
</div>
<div id="outline-container-orgeb5ebfe" class="outline-3">
<h3 id="orgeb5ebfe"><a href="#orgeb5ebfe"><span class="done DONE">DONE</span> 戻れるようにする</a></h3>
<div class="outline-text-3" id="text-orgeb5ebfe">
<p>
popの逆を辿れるようにしたい。今消しちゃってるのをインデックスにすればよいだろう。
</p>

<p>
1つ戻るのは、意外に面倒だ。一気に最初に戻るだけにした。
</p>
</div>
</div>
<div id="outline-container-org7446be1" class="outline-3">
<h3 id="org7446be1"><a href="#org7446be1"><span class="done DONE">DONE</span> イベント捕捉</a></h3>
<div class="outline-text-3" id="text-org7446be1">
<p>
今のところテキストだけで、背景変更などを捕捉できていない。
</p>

<ul class="org-ul">
<li>テキストまわりのインターフェースはbufでやっている。これによって、呼び出し側はそれを画面に表示すればいいだけになっている</li>
<li>イベントは、チャネルなどに流すのがよさそうか</li>
</ul>
</div>
</div>
<div id="outline-container-orga6838ff" class="outline-3">
<h3 id="orga6838ff"><a href="#orga6838ff"><span class="done DONE">DONE</span> 『坊っちゃん』でサンプルを作る</a></h3>
<div class="outline-text-3" id="text-orga6838ff">
<p>
作る。
</p>

<ul class="org-ul">
<li>任意の場所での改行ができない</li>
</ul>

<div class="org-src-container">
<pre class="src src-nil">「おい」
「おい」
「来たぜ」
「とうとう来た」
「これでようやく安心した」

これは1行ずつ表示したい
</pre>
</div>

<p>
改行して、次の行に何もないと、自動改行のカウンタがリセットされてないので横に文字が表示されてしまう。
</p>

<div class="org-src-container">
<pre class="src src-nil">あいうえお
かきくけこ
たちつてと&lt;なにぬねの&gt;
</pre>
</div>

<p>
この場合、「なにぬねの」を改行してほしい。
</p>
</div>
</div>
<div id="outline-container-org67b2bed" class="outline-3">
<h3 id="org67b2bed"><a href="#org67b2bed"><span class="done DONE">DONE</span> シナリオを一覧できるようにする</a></h3>
<div class="outline-text-3" id="text-org67b2bed">
<ul class="org-ul">
<li>一覧すれば、ジャンプは簡単にできる</li>
</ul>
</div>
</div>
<div id="outline-container-org14999f7" class="outline-3">
<h3 id="org14999f7"><a href="#org14999f7"><span class="done CLOSE">CLOSE</span> 視覚影でスプライトが隠れているのを直す</a></h3>
<div class="outline-text-3" id="text-org14999f7">
<p>
近くのライトで見られるようにしたが、微妙だ。
</p>

<ul class="org-ul">
<li>壁の向こう側が見える
<ul class="org-ul">
<li>対策のため1マス分だけ照らすようにしたが、変だ</li>
</ul></li>
<li>やはり、直接視界が当たった部分はフラグをもたせて表示するのがよさそう
<ul class="org-ul">
<li>個別のタイルごとにあるので、新しくコンポーネントを作ったほうがよさそう</li>
<li><code>IsHide</code> とか</li>
</ul></li>
<li>ここに時間かけてもしょうがないから後回しか</li>
</ul>
</div>
</div>
