20231128T074518--kdoc-59-ecsを使ってrpgを作る__project.org
** CLOSE raycastを高速化する
CLOSED: [2024-10-05 Sat 22:56]
- もっとも近い壁を記憶することで、高速化できるという
- https://www.redblobgames.com/articles/visibility/#wall-tracking
** DONE 移動時に画像を回転させる
CLOSED: [2024-10-05 Sat 23:09]
:LOGBOOK:
CLOCK: [2024-10-05 Sat 22:44]--[2024-10-05 Sat 23:09] =>  0:25
CLOCK: [2024-10-05 Sat 22:15]--[2024-10-05 Sat 22:40] =>  0:25
:END:
Angleを設定すればよい。
** DONE カードを装備できるようにする
CLOSED: [2024-10-06 Sun 20:14]
:LOGBOOK:
CLOCK: [2024-10-06 Sun 19:43]--[2024-10-06 Sun 20:09] =>  0:26
CLOCK: [2024-10-06 Sun 18:00]--[2024-10-06 Sun 18:25] =>  0:25
CLOCK: [2024-10-06 Sun 17:30]--[2024-10-06 Sun 17:55] =>  0:25
CLOCK: [2024-10-06 Sun 16:59]--[2024-10-06 Sun 17:24] =>  0:25
CLOCK: [2024-10-06 Sun 16:05]--[2024-10-06 Sun 16:30] =>  0:25
CLOCK: [2024-10-06 Sun 15:36]--[2024-10-06 Sun 16:01] =>  0:25
CLOCK: [2024-10-06 Sun 13:53]--[2024-10-06 Sun 14:18] =>  0:25
CLOCK: [2024-10-06 Sun 13:23]--[2024-10-06 Sun 13:48] =>  0:25
CLOCK: [2024-10-06 Sun 11:18]--[2024-10-06 Sun 11:43] =>  0:25
CLOCK: [2024-10-06 Sun 10:53]--[2024-10-06 Sun 11:18] =>  0:25
CLOCK: [2024-10-06 Sun 10:28]--[2024-10-06 Sun 10:53] =>  0:25
CLOCK: [2024-10-06 Sun 09:18]--[2024-10-06 Sun 09:43] =>  0:25
CLOCK: [2024-10-06 Sun 08:50]--[2024-10-06 Sun 09:15] =>  0:25
:END:

防具だけが対象なのを直す。
** CLOSE リアルタイムなローグライクがよさそう
CLOSED: [2024-10-13 Sun 00:28]
:LOGBOOK:
CLOCK: [2024-04-23 Tue 00:49]--[2024-04-23 Tue 01:14] =>  0:25
:END:
- フィールドは[[https://ebitengine.org/en/examples/raycasting.html][Ray Casting - Ebitengine]]という感じ
- タイルごとにターン制で動くという感じでない。細かく移動できる
- 自分が動いたら時間が進行する
- シンボルエンカウントで、回避する方法がある。煙幕的な
- 電力と燃料がある
  - 電力は短期的なスタミナ。フィールドでダッシュ、煙幕、掘削で減る。有利に進められるが、時間での制限がある
  - 燃料は、腹減り度。電力を使うと早く消費する。なくなるとゲームオーバーになる。移動で減る
** DONE 排反コンポーネントを作る
CLOSED: [2024-10-13 Sun 00:36]
:LOGBOOK:
CLOCK: [2024-10-13 Sun 00:06]--[2024-10-13 Sun 00:31] =>  0:25
CLOCK: [2024-10-12 Sat 22:47]--[2024-10-12 Sat 23:12] =>  0:25
CLOCK: [2024-10-12 Sat 22:12]--[2024-10-12 Sat 22:37] =>  0:25
CLOCK: [2024-10-12 Sat 21:27]--[2024-10-12 Sat 21:52] =>  0:25
CLOCK: [2024-10-12 Sat 21:00]--[2024-10-12 Sat 21:25] =>  0:25
CLOCK: [2024-10-12 Sat 20:34]--[2024-10-12 Sat 21:00] =>  0:26
CLOCK: [2024-10-12 Sat 19:45]--[2024-10-12 Sat 20:10] =>  0:25
CLOCK: [2024-10-12 Sat 16:59]--[2024-10-12 Sat 17:24] =>  0:25
CLOCK: [2024-10-12 Sat 15:37]--[2024-10-12 Sat 16:02] =>  0:25
CLOCK: [2024-10-12 Sat 15:10]--[2024-10-12 Sat 15:35] =>  0:25
CLOCK: [2024-10-12 Sat 14:45]--[2024-10-12 Sat 15:10] =>  0:25
CLOCK: [2024-10-12 Sat 14:00]--[2024-10-12 Sat 14:25] =>  0:25
CLOCK: [2024-10-12 Sat 13:08]--[2024-10-12 Sat 13:33] =>  0:25
CLOCK: [2024-10-12 Sat 12:33]--[2024-10-12 Sat 12:58] =>  0:25
CLOCK: [2024-10-12 Sat 12:08]--[2024-10-12 Sat 12:33] =>  0:25
CLOCK: [2024-10-12 Sat 11:40]--[2024-10-12 Sat 12:05] =>  0:25
CLOCK: [2024-10-12 Sat 11:10]--[2024-10-12 Sat 11:35] =>  0:25
CLOCK: [2024-10-12 Sat 10:32]--[2024-10-12 Sat 10:57] =>  0:25
CLOCK: [2024-10-12 Sat 09:53]--[2024-10-12 Sat 10:18] =>  0:25
CLOCK: [2024-10-12 Sat 09:28]--[2024-10-12 Sat 09:53] =>  0:25
CLOCK: [2024-10-12 Sat 09:03]--[2024-10-12 Sat 09:28] =>  0:25
CLOCK: [2024-10-12 Sat 03:03]--[2024-10-12 Sat 03:28] =>  0:25
:END:
排反を表現する。

Joinのときに指定するのはComponentsで、ecs.NullComponentなどの溜められているデータそのものである。なのでenumにできたりしない。

アイデア。

- エンティティを初期化するときに制約する

#+begin_src go
  world.Manager.Join(
          gameComponents.Name,
          gameComponents.Pools,
          gameComponents.FactionTypeEnemy, // みたいにしたいが、Componentは実際に保持してるデータなのでenumにはできない
  )
#+end_src

- Joinで、gameComponentsを直に渡すのではなく、関数をはさむとか

#+begin_src go
  group(aCompo, bCompo)
#+end_src

- myutilsを消す
** DONE 戦闘追加する
CLOSED: [2024-10-13 Sun 22:54]
:PROPERTIES:
:Effort:   5:00
:END:
:LOGBOOK:
CLOCK: [2024-10-10 Thu 22:08]--[2024-10-10 Thu 22:33] =>  0:25
CLOCK: [2024-10-10 Thu 20:22]--[2024-10-10 Thu 20:47] =>  0:25
CLOCK: [2024-10-10 Thu 19:48]--[2024-10-10 Thu 20:13] =>  0:25
CLOCK: [2024-10-10 Thu 00:31]--[2024-10-10 Thu 00:56] =>  0:25
CLOCK: [2024-10-09 Wed 22:17]--[2024-10-09 Wed 22:43] =>  0:26
CLOCK: [2024-10-09 Wed 21:52]--[2024-10-09 Wed 22:17] =>  0:25
CLOCK: [2024-10-08 Tue 20:29]--[2024-10-08 Tue 20:54] =>  0:25
CLOCK: [2024-10-08 Tue 19:31]--[2024-10-08 Tue 19:56] =>  0:25
CLOCK: [2024-10-08 Tue 18:29]--[2024-10-08 Tue 18:54] =>  0:25
CLOCK: [2024-10-07 Mon 22:31]--[2024-10-07 Mon 22:56] =>  0:25
CLOCK: [2024-10-07 Mon 22:04]--[2024-10-07 Mon 22:29] =>  0:25
CLOCK: [2024-10-07 Mon 20:52]--[2024-10-07 Mon 21:17] =>  0:25
CLOCK: [2024-10-07 Mon 20:14]--[2024-10-07 Mon 20:39] =>  0:25
CLOCK: [2024-10-07 Mon 19:42]--[2024-10-07 Mon 20:07] =>  0:25
CLOCK: [2024-10-07 Mon 19:13]--[2024-10-07 Mon 19:38] =>  0:25
CLOCK: [2024-10-06 Sun 21:49]--[2024-10-06 Sun 22:14] =>  0:25
CLOCK: [2024-10-06 Sun 21:24]--[2024-10-06 Sun 21:49] =>  0:25
:END:
#+begin_src go
   // デッキ
  type Deck struct {
          Owner Entity
          Cards []Card
  }

  // 戦闘中の手札
  type Hand struct {
          Card Card
  }

  // 戦闘ステート
  type BattleState struct {
          // 味方の行動値。ある値を超すと敵に行動が移る
          // 早く終了すると次のターンに持ち越せる
          FriendActVal int
          // 敵の行動値
          EnemyActVal int
  }

  type TurnSide int
  const (
          // 味方のターン
          FriendTurn TurnSide iota
          // 敵のターン
          EnemyTurn TurnSide
  )

  // 戦闘状態を初期化してステート遷移する
  func Trans(BattleState{enemies, level}) {}
  // カードを引く。デッキから選択される
  func Draw() {}
  // 選択カードの効果を適用させる
  func Apply(target) {}
  // 敵味方のターンを入れ替える
  func Toggle() {}
#+end_src

- 手札カードをキャラ各々にすると、よくわからなくなる
- 全体にするとややこしくなる雰囲気がある
- チームの行動ゲージが貯まると、敵が行動する。敵も手札を持っていて、それをランダムに選択する
- 戦闘中に死亡すると、死亡フラグが立ち行動できない
- 戦闘が終了すると敵エンティティによる経験値を得て、敵エンティティを削除する
- 味方チームのターンと敵チームのターンは完全に分かれている
- 持ち物としてのカードと、戦闘中に選択できるカードは明らかに概念が異なる
- キャラごとにデッキと装備を設定できる
  - 枚数は固定で、未選択の部分は「通常攻撃」で埋められる
- デッキ設定をするにはどうするか
  - Equippedを使うのでいいのかな。装備品と共用すると排除する必要がありビミョーか
  - まあ、Wearableと同時に使うから区別はできるか
  - Card + Equipped
  - Wearable + Equipped
- クリックごとに、文字を出し、状態を遷移させていく
- デッキは空にできない。「基本攻撃」とする
- 味方がそれぞれデッキを持つ方式は、やはりややこしい
- 1人で冒険するのがよい可能性がある
  - 1人でデッキ20枚のほうが戦略性とかも考えやすそうな
  - ロックマンとかそうだろ
- デッキと複数人はあまり相性がよくないような
  - 工数もかかるしな
- キャラは特殊効果をつけるための装置、ともできる。暗視とか
  - パーティーのスキルの合算が適用されるなど
  - 武器などの戦闘スキル、暗視などのフィールドスキル
  - カードとメンバーは直接は紐付かない
- でも敵キャラは、キャラと攻撃が紐付いてほしいよな
  - 「軽戦車は、50ミリ砲で攻撃した」
  - 味方と敵のカードは共通の仕組みとしたい。実装が楽だし、探索してる感が出る
  - 敵のデッキは、生きている敵の種類によって決定する、でよいか。なんだか面倒そうだな
- 石原
  - レイガン(2)
  - おたけび(1) -- 固有
  - 体当たり(0)
- 白瀬
  - ハンドガン(2)
  - 竹刀(2)
  - ハンドガン<援護射撃>(1)
  - ハンドガン<ワンショットキル>(2)
  - 体当たり(0)
- 軽戦車
  - 50ミリ砲(2)
  - 7.62mm機関銃(2)
  - 乱射 -- 機関銃(4)
  - 体当たり(0)
- 味方が1~4人、敵が1~4人の場合について考えなければならない
- カード風にするのはとりあえず諦めるのもよい
  - Cardって名前にしちゃったが
  - 普通に装備している手札から選ぶ形式にする。ドローとかはない
- テキストのクリック待ちについては、テキストキューが残っていたらクリックはキュー送り、とすればよい
- 攻撃コマンドの構造体
  - 最終的にこれらは分解されてeffect queueに入る
  - コマンドのテキスト生成にも使う
  - 「石原は50ミリ砲で攻撃」
  - 「装甲車に34のダメージ」
  - 「装甲車はチェーンガンで攻撃」
  - 「石原に14のダメージ」
  - 「白瀬に19のダメージ」

#+begin_src go
  command{
          // 攻撃する人(死んだらこの攻撃は実行されない}
          owner: ecs.Entity
          // 攻撃対象
          target: ecs.Entity
          // ターゲットタイプなどはここから取れる。全体攻撃か、味方対象とか
          way: components.Card
  }
#+end_src

- systemで、コマンドを処理していく
  - ダメージがあるたびにログを出し、クリック待ちにする
  - クリックするたびにsystemが実行され、ログが表示される
- Listだと、マウスオーバー時のハンドラが入れられない。前も陥った罠だ
  - マウスだと、スクロールが面倒である。どうにかならないか
  - マウスオーバー時の色は付けてるから、どうにか

** DONE メッセージログ追加
CLOSED: [2024-10-13 Sun 22:54]
:LOGBOOK:
CLOCK: [2024-10-13 Sun 22:26]--[2024-10-13 Sun 22:51] =>  0:25
CLOCK: [2024-10-13 Sun 22:01]--[2024-10-13 Sun 22:26] =>  0:25
CLOCK: [2024-10-13 Sun 21:35]--[2024-10-13 Sun 22:01] =>  0:26
CLOCK: [2024-10-13 Sun 11:43]--[2024-10-13 Sun 12:08] =>  0:25
CLOCK: [2024-10-13 Sun 11:08]--[2024-10-13 Sun 11:33] =>  0:25
CLOCK: [2024-10-13 Sun 10:21]--[2024-10-13 Sun 10:46] =>  0:25
CLOCK: [2024-10-13 Sun 09:45]--[2024-10-13 Sun 10:10] =>  0:25
CLOCK: [2024-10-13 Sun 09:20]--[2024-10-13 Sun 09:45] =>  0:25
CLOCK: [2024-10-13 Sun 08:55]--[2024-10-13 Sun 09:20] =>  0:25
CLOCK: [2024-10-13 Sun 00:36]--[2024-10-13 Sun 01:01] =>  0:25
:END:
汎用なメッセージを表示できるようにする。メッセージパートの仕組みとは別でよい。

戦闘、フィールドなどのイベントによってメッセージを発行して表示できるようにする。

#+begin_src go
  msglog.BattleLog.Append("イシハラは軽戦車を攻撃した")


  msglog.BattleLog.Get(10)
#+end_src

- [X] 残ってたらクリック待ちにしたい
- [X] クリック待ち状態のときは何か表示する
