20231128T074518--kdoc-59-ecsを使ってrpgを作る__project.html
<div id="outline-container-org504cefe" class="outline-3">
<h3 id="org504cefe"><a href="#org504cefe"><span class="done CLOSE">CLOSE</span> raycastを高速化する</a></h3>
<div class="outline-text-3" id="text-org504cefe">
<ul class="org-ul">
<li>もっとも近い壁を記憶することで、高速化できるという</li>
<li><a href="https://www.redblobgames.com/articles/visibility/#wall-tracking">https://www.redblobgames.com/articles/visibility/#wall-tracking</a></li>
</ul>
</div>
</div>
<div id="outline-container-org29655b5" class="outline-3">
<h3 id="org29655b5"><a href="#org29655b5"><span class="done DONE">DONE</span> 移動時に画像を回転させる</a></h3>
<div class="outline-text-3" id="text-org29655b5">
<p>
Angleを設定すればよい。
</p>
</div>
</div>
<div id="outline-container-org3d29045" class="outline-3">
<h3 id="org3d29045"><a href="#org3d29045"><span class="done DONE">DONE</span> カードを装備できるようにする</a></h3>
<div class="outline-text-3" id="text-org3d29045">
<p>
防具だけが対象なのを直す。
</p>
</div>
</div>
<div id="outline-container-org152ec55" class="outline-3">
<h3 id="org152ec55"><a href="#org152ec55"><span class="done CLOSE">CLOSE</span> リアルタイムなローグライクがよさそう</a></h3>
<div class="outline-text-3" id="text-org152ec55">
<ul class="org-ul">
<li>フィールドは<a href="https://ebitengine.org/en/examples/raycasting.html">Ray Casting - Ebitengine</a>という感じ</li>
<li>タイルごとにターン制で動くという感じでない。細かく移動できる</li>
<li>自分が動いたら時間が進行する</li>
<li>シンボルエンカウントで、回避する方法がある。煙幕的な</li>
<li>電力と燃料がある
<ul class="org-ul">
<li>電力は短期的なスタミナ。フィールドでダッシュ、煙幕、掘削で減る。有利に進められるが、時間での制限がある</li>
<li>燃料は、腹減り度。電力を使うと早く消費する。なくなるとゲームオーバーになる。移動で減る</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org8ac9cbd" class="outline-3">
<h3 id="org8ac9cbd"><a href="#org8ac9cbd"><span class="done DONE">DONE</span> 排反コンポーネントを作る</a></h3>
<div class="outline-text-3" id="text-org8ac9cbd">
<p>
排反を表現する。
</p>

<p>
Joinのときに指定するのはComponentsで、ecs.NullComponentなどの溜められているデータそのものである。なのでenumにできたりしない。
</p>

<p>
アイデア。
</p>

<ul class="org-ul">
<li>エンティティを初期化するときに制約する</li>
</ul>

<div class="org-src-container">
<pre class="src src-go">world.Manager.Join(
        gameComponents.Name,
        gameComponents.Pools,
        gameComponents.FactionTypeEnemy, // みたいにしたいが、Componentは実際に保持してるデータなのでenumにはできない
)
</pre>
</div>

<ul class="org-ul">
<li>Joinで、gameComponentsを直に渡すのではなく、関数をはさむとか</li>
</ul>

<div class="org-src-container">
<pre class="src src-go">group(aCompo, bCompo)
</pre>
</div>

<ul class="org-ul">
<li>myutilsを消す</li>
</ul>
</div>
</div>
<div id="outline-container-orgab17a37" class="outline-3">
<h3 id="orgab17a37"><a href="#orgab17a37"><span class="done DONE">DONE</span> 戦闘追加する</a></h3>
<div class="outline-text-3" id="text-orgab17a37">
<div class="org-src-container">
<pre class="src src-go"> // デッキ
type Deck struct {
        Owner Entity
        Cards []Card
}

// 戦闘中の手札
type Hand struct {
        Card Card
}

// 戦闘ステート
type BattleState struct {
        // 味方の行動値。ある値を超すと敵に行動が移る
        // 早く終了すると次のターンに持ち越せる
        FriendActVal int
        // 敵の行動値
        EnemyActVal int
}

type TurnSide int
const (
        // 味方のターン
        FriendTurn TurnSide iota
        // 敵のターン
        EnemyTurn TurnSide
)

// 戦闘状態を初期化してステート遷移する
func Trans(BattleState{enemies, level}) {}
// カードを引く。デッキから選択される
func Draw() {}
// 選択カードの効果を適用させる
func Apply(target) {}
// 敵味方のターンを入れ替える
func Toggle() {}
</pre>
</div>

<ul class="org-ul">
<li>手札カードをキャラ各々にすると、よくわからなくなる</li>
<li>全体にするとややこしくなる雰囲気がある</li>
<li>チームの行動ゲージが貯まると、敵が行動する。敵も手札を持っていて、それをランダムに選択する</li>
<li>戦闘中に死亡すると、死亡フラグが立ち行動できない</li>
<li>戦闘が終了すると敵エンティティによる経験値を得て、敵エンティティを削除する</li>
<li>味方チームのターンと敵チームのターンは完全に分かれている</li>
<li>持ち物としてのカードと、戦闘中に選択できるカードは明らかに概念が異なる</li>
<li>キャラごとにデッキと装備を設定できる
<ul class="org-ul">
<li>枚数は固定で、未選択の部分は「通常攻撃」で埋められる</li>
</ul></li>
<li>デッキ設定をするにはどうするか
<ul class="org-ul">
<li>Equippedを使うのでいいのかな。装備品と共用すると排除する必要がありビミョーか</li>
<li>まあ、Wearableと同時に使うから区別はできるか</li>
<li>Card + Equipped</li>
<li>Wearable + Equipped</li>
</ul></li>
<li>クリックごとに、文字を出し、状態を遷移させていく</li>
<li>デッキは空にできない。「基本攻撃」とする</li>
<li>味方がそれぞれデッキを持つ方式は、やはりややこしい</li>
<li>1人で冒険するのがよい可能性がある
<ul class="org-ul">
<li>1人でデッキ20枚のほうが戦略性とかも考えやすそうな</li>
<li>ロックマンとかそうだろ</li>
</ul></li>
<li>デッキと複数人はあまり相性がよくないような
<ul class="org-ul">
<li>工数もかかるしな</li>
</ul></li>
<li>キャラは特殊効果をつけるための装置、ともできる。暗視とか
<ul class="org-ul">
<li>パーティーのスキルの合算が適用されるなど</li>
<li>武器などの戦闘スキル、暗視などのフィールドスキル</li>
<li>カードとメンバーは直接は紐付かない</li>
</ul></li>
<li>でも敵キャラは、キャラと攻撃が紐付いてほしいよな
<ul class="org-ul">
<li>「軽戦車は、50ミリ砲で攻撃した」</li>
<li>味方と敵のカードは共通の仕組みとしたい。実装が楽だし、探索してる感が出る</li>
<li>敵のデッキは、生きている敵の種類によって決定する、でよいか。なんだか面倒そうだな</li>
</ul></li>
<li>石原
<ul class="org-ul">
<li>レイガン(2)</li>
<li>おたけび(1) &#x2013; 固有</li>
<li>体当たり(0)</li>
</ul></li>
<li>白瀬
<ul class="org-ul">
<li>ハンドガン(2)</li>
<li>竹刀(2)</li>
<li>ハンドガン&lt;援護射撃&gt;(1)</li>
<li>ハンドガン&lt;ワンショットキル&gt;(2)</li>
<li>体当たり(0)</li>
</ul></li>
<li>軽戦車
<ul class="org-ul">
<li>50ミリ砲(2)</li>
<li>7.62mm機関銃(2)</li>
<li>乱射 &#x2013; 機関銃(4)</li>
<li>体当たり(0)</li>
</ul></li>
<li>味方が1~4人、敵が1~4人の場合について考えなければならない</li>
<li>カード風にするのはとりあえず諦めるのもよい
<ul class="org-ul">
<li>Cardって名前にしちゃったが</li>
<li>普通に装備している手札から選ぶ形式にする。ドローとかはない</li>
</ul></li>
<li>テキストのクリック待ちについては、テキストキューが残っていたらクリックはキュー送り、とすればよい</li>
<li>攻撃コマンドの構造体
<ul class="org-ul">
<li>最終的にこれらは分解されてeffect queueに入る</li>
<li>コマンドのテキスト生成にも使う</li>
<li>「石原は50ミリ砲で攻撃」</li>
<li>「装甲車に34のダメージ」</li>
<li>「装甲車はチェーンガンで攻撃」</li>
<li>「石原に14のダメージ」</li>
<li>「白瀬に19のダメージ」</li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-go">command{
        // 攻撃する人(死んだらこの攻撃は実行されない}
        owner: ecs.Entity
        // 攻撃対象
        target: ecs.Entity
        // ターゲットタイプなどはここから取れる。全体攻撃か、味方対象とか
        way: components.Card
}
</pre>
</div>

<ul class="org-ul">
<li>systemで、コマンドを処理していく
<ul class="org-ul">
<li>ダメージがあるたびにログを出し、クリック待ちにする</li>
<li>クリックするたびにsystemが実行され、ログが表示される</li>
</ul></li>
<li>Listだと、マウスオーバー時のハンドラが入れられない。前も陥った罠だ
<ul class="org-ul">
<li>マウスだと、スクロールが面倒である。どうにかならないか</li>
<li>マウスオーバー時の色は付けてるから、どうにか</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org6578b7b" class="outline-3">
<h3 id="org6578b7b"><a href="#org6578b7b"><span class="done DONE">DONE</span> メッセージログ追加</a></h3>
<div class="outline-text-3" id="text-org6578b7b">
<p>
汎用なメッセージを表示できるようにする。メッセージパートの仕組みとは別でよい。
</p>

<p>
戦闘、フィールドなどのイベントによってメッセージを発行して表示できるようにする。
</p>

<div class="org-src-container">
<pre class="src src-go">msglog.BattleLog.Append("イシハラは軽戦車を攻撃した")


msglog.BattleLog.Get(10)
</pre>
</div>

<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 残ってたらクリック待ちにしたい</li>
<li class="on"><input type='checkbox' checked='checked' /> クリック待ち状態のときは何か表示する</li>
</ul>
</div>
</div>
