20231128T074518--kdoc-59-ecsを使ってrpgを作る__project.org
** DONE 汎用の選択コンテナを作成する
CLOSED: [2024-10-13 Sun 22:55]
:LOGBOOK:
CLOCK: [2024-04-21 Sun 23:10]--[2024-04-21 Sun 23:35] =>  0:25
CLOCK: [2024-04-21 Sun 21:20]--[2024-04-21 Sun 21:45] =>  0:25
CLOCK: [2024-04-20 Sat 16:44]--[2024-04-20 Sat 17:09] =>  0:25
CLOCK: [2024-04-20 Sat 15:41]--[2024-04-20 Sat 16:06] =>  0:25
CLOCK: [2024-04-20 Sat 15:15]--[2024-04-20 Sat 15:40] =>  0:25
CLOCK: [2024-04-20 Sat 14:50]--[2024-04-20 Sat 15:15] =>  0:25
CLOCK: [2024-04-20 Sat 14:25]--[2024-04-20 Sat 14:50] =>  0:25
CLOCK: [2024-04-20 Sat 12:46]--[2024-04-20 Sat 13:11] =>  0:25
CLOCK: [2024-04-20 Sat 11:30]--[2024-04-20 Sat 11:55] =>  0:25
:END:
メニューなど、なにかを一覧して選択するのは多く使うので、作っておきたい。

メニュー。

- 選択肢のリスト
- 現在選択中の番号を示す変数

ゲージ。

- HP
- レベル
- 名前

どうやればいいのだろうか。

- 構造体で作っておいて、後で代入できるようにしとくといいのでは。あとその構造体に親子関係を作るメソッドを作ると。

#+begin_src go
  type aa struct {
          root ui.Container
          desc ui.Container
          list ui.Container
  }

  func (aa *aa) assemble {
          aa.root.AddChild(aa.desc)
          aa.root.AddChild(aa.list)
  }
#+end_src
** DONE 似たようなUI関数を統合する
CLOSED: [2024-10-15 Tue 21:45]
:LOGBOOK:
CLOCK: [2024-10-14 Mon 00:53]--[2024-10-14 Mon 01:18] =>  0:25
CLOCK: [2024-10-14 Mon 00:27]--[2024-10-14 Mon 00:52] =>  0:25
:END:
オプションをちゃんと使ってないのを直す。
** DONE UIをまともにする
CLOSED: [2024-10-15 Tue 21:45]
:LOGBOOK:
CLOCK: [2024-10-15 Tue 20:38]--[2024-10-15 Tue 21:03] =>  0:25
CLOCK: [2024-10-15 Tue 19:58]--[2024-10-15 Tue 20:23] =>  0:25
CLOCK: [2024-10-15 Tue 19:33]--[2024-10-15 Tue 19:58] =>  0:25
CLOCK: [2024-10-15 Tue 00:24]--[2024-10-15 Tue 00:49] =>  0:25
CLOCK: [2024-10-14 Mon 22:45]--[2024-10-14 Mon 23:10] =>  0:25
CLOCK: [2024-10-14 Mon 22:20]--[2024-10-14 Mon 22:45] =>  0:25
CLOCK: [2024-10-14 Mon 21:55]--[2024-10-14 Mon 22:20] =>  0:25
CLOCK: [2024-10-14 Mon 21:03]--[2024-10-14 Mon 21:28] =>  0:25
CLOCK: [2024-10-14 Mon 20:20]--[2024-10-14 Mon 20:45] =>  0:25
CLOCK: [2024-10-14 Mon 19:22]--[2024-10-14 Mon 19:47] =>  0:25
CLOCK: [2024-10-14 Mon 18:41]--[2024-10-14 Mon 19:06] =>  0:25
CLOCK: [2024-10-14 Mon 18:15]--[2024-10-14 Mon 18:40] =>  0:25
CLOCK: [2024-10-14 Mon 16:44]--[2024-10-14 Mon 17:09] =>  0:25
CLOCK: [2024-10-14 Mon 16:17]--[2024-10-14 Mon 16:42] =>  0:25
CLOCK: [2024-10-14 Mon 15:48]--[2024-10-14 Mon 16:13] =>  0:25
CLOCK: [2024-10-14 Mon 14:57]--[2024-10-14 Mon 15:22] =>  0:25
CLOCK: [2024-10-14 Mon 13:43]--[2024-10-14 Mon 14:08] =>  0:25
CLOCK: [2024-10-14 Mon 13:10]--[2024-10-14 Mon 13:35] =>  0:25
CLOCK: [2024-10-14 Mon 12:29]--[2024-10-14 Mon 12:54] =>  0:25
CLOCK: [2024-10-14 Mon 12:04]--[2024-10-14 Mon 12:29] =>  0:25
CLOCK: [2024-10-14 Mon 11:37]--[2024-10-14 Mon 12:02] =>  0:25
CLOCK: [2024-10-14 Mon 11:07]--[2024-10-14 Mon 11:32] =>  0:25
CLOCK: [2024-10-14 Mon 10:42]--[2024-10-14 Mon 11:07] =>  0:25
CLOCK: [2024-10-14 Mon 10:17]--[2024-10-14 Mon 10:42] =>  0:25
CLOCK: [2024-10-14 Mon 01:39]--[2024-10-14 Mon 02:04] =>  0:25
CLOCK: [2024-10-13 Sun 22:56]--[2024-10-13 Sun 23:21] =>  0:25
:END:
凝る必要はないが、あまりにデバッグ感がある。

- verticalContainerを簡単にしたい
- 共通のパラメータをもたせたい
** DONE スクロールコンテナをListコンテナに置き換える
CLOSED: [2024-10-17 Thu 20:36]
:LOGBOOK:
CLOCK: [2024-10-16 Wed 22:55]--[2024-10-16 Wed 23:20] =>  0:25
CLOCK: [2024-10-16 Wed 22:28]--[2024-10-16 Wed 22:53] =>  0:25
CLOCK: [2024-10-16 Wed 21:49]--[2024-10-16 Wed 22:14] =>  0:25
CLOCK: [2024-10-16 Wed 19:41]--[2024-10-16 Wed 20:06] =>  0:25
CLOCK: [2024-10-16 Wed 00:25]--[2024-10-16 Wed 00:50] =>  0:25
CLOCK: [2024-10-15 Tue 23:09]--[2024-10-15 Tue 23:34] =>  0:25
CLOCK: [2024-10-15 Tue 22:44]--[2024-10-15 Tue 23:09] =>  0:25
CLOCK: [2024-10-15 Tue 21:45]--[2024-10-15 Tue 22:10] =>  0:25
:END:
わかりやすくなる。
** DONE スポーン時は自動で全回復する
CLOSED: [2024-10-17 Thu 22:35]
:LOGBOOK:
CLOCK: [2024-10-17 Thu 21:29]--[2024-10-17 Thu 21:54] =>  0:25
CLOCK: [2024-10-17 Thu 20:37]--[2024-10-17 Thu 21:02] =>  0:25
:END:
いちいち回復させないといけないのが面倒なので。
** DONE 戦闘できるようにする
CLOSED: [2024-10-19 Sat 19:36]
:LOGBOOK:
CLOCK: [2024-10-19 Sat 17:20]--[2024-10-19 Sat 17:45] =>  0:25
CLOCK: [2024-10-19 Sat 12:51]--[2024-10-19 Sat 13:16] =>  0:25
CLOCK: [2024-10-19 Sat 11:38]--[2024-10-19 Sat 12:03] =>  0:25
CLOCK: [2024-10-19 Sat 11:11]--[2024-10-19 Sat 11:37] =>  0:26
CLOCK: [2024-10-19 Sat 10:22]--[2024-10-19 Sat 10:47] =>  0:25
CLOCK: [2024-10-19 Sat 09:57]--[2024-10-19 Sat 10:22] =>  0:25
CLOCK: [2024-10-19 Sat 09:30]--[2024-10-19 Sat 09:55] =>  0:25
CLOCK: [2024-10-18 Fri 23:04]--[2024-10-18 Fri 23:29] =>  0:25
CLOCK: [2024-10-17 Thu 22:35]--[2024-10-17 Thu 23:00] =>  0:25
:END:

- 敵にもコマンドを選ばせる
- SPが足りない場合は不活性にする

カードの選択テーブル。敵の場合はSPの概念はない。

- 軽戦車
  - 50ミリ砲: 0.4
  - 7.62mm機関銃: 0.3
  - 体当たり: 0.3
- オロチ(複数回攻撃)
  - 火炎ブレス: 0.2
  - 電撃ブレス: 0.2
  - 凍結ブレス: 0.1
  - 鉤爪: 0.3
  - 咆哮: 0.2
** DONE フィールドに敵シンボルを作る
CLOSED: [2024-10-26 Sat 14:38]
:LOGBOOK:
CLOCK: [2024-09-03 Tue 21:51]--[2024-09-03 Tue 22:16] =>  0:25
CLOCK: [2024-09-03 Tue 21:12]--[2024-09-03 Tue 21:37] =>  0:25
CLOCK: [2024-09-03 Tue 00:25]--[2024-09-03 Tue 00:50] =>  0:25
CLOCK: [2024-09-02 Mon 23:46]--[2024-09-03 Tue 00:11] =>  0:25
CLOCK: [2024-09-02 Mon 23:12]--[2024-09-02 Mon 23:37] =>  0:25
CLOCK: [2024-09-02 Mon 22:46]--[2024-09-02 Mon 23:11] =>  0:25
CLOCK: [2024-09-01 Sun 23:33]--[2024-09-01 Sun 23:58] =>  0:25
CLOCK: [2024-09-01 Sun 22:39]--[2024-09-01 Sun 23:04] =>  0:25
CLOCK: [2024-09-01 Sun 21:14]--[2024-09-01 Sun 21:39] =>  0:25
CLOCK: [2024-09-01 Sun 20:49]--[2024-09-01 Sun 21:14] =>  0:25
CLOCK: [2024-09-01 Sun 20:19]--[2024-09-01 Sun 20:44] =>  0:25
:END:

- とりあえず動かないやつ
- ランダムに動くやつ
- 向きによる画像をどうするか
  - 自キャラは8方向にしか動かないが、敵キャラはそうではない
  - 角度の範囲にすればいいか
  - 今は回転だが、回転は見た目があまりよくない
  - 画像を5方向分用意して切り替えがよさそう(反転させて全方向にする)
  - とりあえず回転はなくしておく
- かぶる問題
  - positionを指定したはいいけど、重複検知がやりにくいな
  - tileだったら全体管理できていて楽だけど...
  - スポーンのとき限定で、スポーン済みタイル配列を持っておいてチェックするとか
  - スポーン時はタイルで判断できれば問題ない。スポーン時、すべてのエンティティがタイルに沿った位置にある
  - タイルを指定してスポーンするインターフェースにすればよいのでは

** DONE 敵や味方を倒せるようにする
CLOSED: [2024-10-26 Sat 14:09]
:LOGBOOK:
CLOCK: [2024-10-26 Sat 13:34]--[2024-10-26 Sat 13:59] =>  0:25
CLOCK: [2024-10-26 Sat 12:43]--[2024-10-26 Sat 13:08] =>  0:25
CLOCK: [2024-10-26 Sat 12:01]--[2024-10-26 Sat 12:26] =>  0:25
CLOCK: [2024-10-26 Sat 11:19]--[2024-10-26 Sat 11:44] =>  0:25
CLOCK: [2024-10-26 Sat 07:48]--[2024-10-26 Sat 08:13] =>  0:25
CLOCK: [2024-10-26 Sat 01:04]--[2024-10-26 Sat 01:29] =>  0:25
CLOCK: [2024-10-26 Sat 00:08]--[2024-10-26 Sat 00:33] =>  0:25
CLOCK: [2024-10-25 Fri 22:40]--[2024-10-25 Fri 23:05] =>  0:25
CLOCK: [2024-10-25 Fri 22:15]--[2024-10-25 Fri 22:40] =>  0:25
CLOCK: [2024-10-25 Fri 21:07]--[2024-10-25 Fri 21:32] =>  0:25
CLOCK: [2024-10-25 Fri 20:42]--[2024-10-25 Fri 21:07] =>  0:25
CLOCK: [2024-10-25 Fri 20:10]--[2024-10-25 Fri 20:35] =>  0:25
CLOCK: [2024-10-25 Fri 19:45]--[2024-10-25 Fri 20:10] =>  0:25
CLOCK: [2024-10-25 Fri 16:34]--[2024-10-25 Fri 16:59] =>  0:25
CLOCK: [2024-10-25 Fri 15:52]--[2024-10-25 Fri 16:17] =>  0:25
CLOCK: [2024-10-25 Fri 15:21]--[2024-10-25 Fri 15:46] =>  0:25
CLOCK: [2024-10-21 Mon 21:57]--[2024-10-21 Mon 22:22] =>  0:25
CLOCK: [2024-10-21 Mon 21:20]--[2024-10-21 Mon 21:45] =>  0:25
CLOCK: [2024-10-21 Mon 20:55]--[2024-10-21 Mon 21:20] =>  0:25
CLOCK: [2024-10-21 Mon 20:30]--[2024-10-21 Mon 20:55] =>  0:25
CLOCK: [2024-10-21 Mon 20:05]--[2024-10-21 Mon 20:30] =>  0:25
CLOCK: [2024-10-20 Sun 23:17]--[2024-10-20 Sun 23:42] =>  0:25
CLOCK: [2024-10-20 Sun 22:40]--[2024-10-20 Sun 23:05] =>  0:25
CLOCK: [2024-10-20 Sun 22:15]--[2024-10-20 Sun 22:40] =>  0:25
CLOCK: [2024-10-20 Sun 21:25]--[2024-10-20 Sun 21:50] =>  0:25
CLOCK: [2024-10-20 Sun 20:37]--[2024-10-20 Sun 21:02] =>  0:25
CLOCK: [2024-10-20 Sun 20:12]--[2024-10-20 Sun 20:37] =>  0:25
CLOCK: [2024-10-20 Sun 19:45]--[2024-10-20 Sun 20:10] =>  0:25
CLOCK: [2024-10-20 Sun 19:20]--[2024-10-20 Sun 19:45] =>  0:25
CLOCK: [2024-10-20 Sun 15:55]--[2024-10-20 Sun 16:20] =>  0:25
CLOCK: [2024-10-20 Sun 15:22]--[2024-10-20 Sun 15:47] =>  0:25
CLOCK: [2024-10-20 Sun 14:35]--[2024-10-20 Sun 15:00] =>  0:25
CLOCK: [2024-10-20 Sun 13:29]--[2024-10-20 Sun 13:54] =>  0:25
CLOCK: [2024-10-20 Sun 12:58]--[2024-10-20 Sun 13:23] =>  0:25
CLOCK: [2024-10-20 Sun 12:24]--[2024-10-20 Sun 12:49] =>  0:25
CLOCK: [2024-10-20 Sun 11:46]--[2024-10-20 Sun 12:11] =>  0:25
CLOCK: [2024-10-20 Sun 11:20]--[2024-10-20 Sun 11:45] =>  0:25
CLOCK: [2024-10-20 Sun 10:44]--[2024-10-20 Sun 11:09] =>  0:25
CLOCK: [2024-10-20 Sun 10:19]--[2024-10-20 Sun 10:44] =>  0:25
CLOCK: [2024-10-20 Sun 00:11]--[2024-10-20 Sun 00:36] =>  0:25
CLOCK: [2024-10-19 Sat 23:17]--[2024-10-19 Sat 23:42] =>  0:25
CLOCK: [2024-10-19 Sat 22:21]--[2024-10-19 Sat 22:46] =>  0:25
CLOCK: [2024-10-19 Sat 21:56]--[2024-10-19 Sat 22:21] =>  0:25
CLOCK: [2024-10-19 Sat 21:31]--[2024-10-19 Sat 21:56] =>  0:25
CLOCK: [2024-10-19 Sat 21:05]--[2024-10-19 Sat 21:30] =>  0:25
CLOCK: [2024-10-19 Sat 20:33]--[2024-10-19 Sat 20:58] =>  0:25
CLOCK: [2024-10-19 Sat 20:08]--[2024-10-19 Sat 20:33] =>  0:25
CLOCK: [2024-10-19 Sat 19:36]--[2024-10-19 Sat 20:01] =>  0:25
:END:

- 死んでいる判定をする
- 味方でも敵でもすぐに削除はしない。フラグを立てるだけ
- 味方が全員死ぬとゲームオーバー
- 敵が全員死ぬと勝利
- 戦闘終了時に敵エンティティを削除する

メモ。

- 死亡フラグをどうするか
- わざわざコンポーネントにしなくても、HP0で判定すればよさそう
- 死んだキャラは命令できない。ターゲットにならない
- 「倒した」は出して待ち状態にしたい
  - 「敵を全滅させた」
  - メッセージ待ちごとにクリック待ちにしたほうが楽でいいのではないか

パーティ。

- 味方の最後に行動するメンバーが死んだときに空のコマンド送りが発生する
  - ▼をクリアするクリックと、ターン終わりのクリックがある
  - 根本的に扱いにくい
** DONE 戦闘勝利時に獲得できるようにする
CLOSED: [2024-10-27 Sun 17:54]
:LOGBOOK:
CLOCK: [2024-10-27 Sun 17:08]--[2024-10-27 Sun 17:33] =>  0:25
CLOCK: [2024-10-27 Sun 16:30]--[2024-10-27 Sun 16:55] =>  0:25
CLOCK: [2024-10-27 Sun 16:03]--[2024-10-27 Sun 16:28] =>  0:25
CLOCK: [2024-10-27 Sun 15:38]--[2024-10-27 Sun 16:03] =>  0:25
CLOCK: [2024-10-27 Sun 13:08]--[2024-10-27 Sun 13:33] =>  0:25
CLOCK: [2024-10-27 Sun 12:39]--[2024-10-27 Sun 13:04] =>  0:25
CLOCK: [2024-10-27 Sun 12:12]--[2024-10-27 Sun 12:37] =>  0:25
CLOCK: [2024-10-27 Sun 11:34]--[2024-10-27 Sun 11:59] =>  0:25
CLOCK: [2024-10-27 Sun 10:08]--[2024-10-27 Sun 10:33] =>  0:25
CLOCK: [2024-10-27 Sun 09:36]--[2024-10-27 Sun 10:01] =>  0:25
CLOCK: [2024-10-27 Sun 08:58]--[2024-10-27 Sun 09:23] =>  0:25
CLOCK: [2024-10-27 Sun 08:32]--[2024-10-27 Sun 08:57] =>  0:25
CLOCK: [2024-10-27 Sun 01:09]--[2024-10-27 Sun 01:34] =>  0:25
CLOCK: [2024-10-26 Sat 23:50]--[2024-10-27 Sun 00:15] =>  0:25
CLOCK: [2024-10-26 Sat 22:51]--[2024-10-26 Sat 23:17] =>  0:26
CLOCK: [2024-10-26 Sat 21:55]--[2024-10-26 Sat 22:20] =>  0:25
CLOCK: [2024-10-26 Sat 21:29]--[2024-10-26 Sat 21:54] =>  0:25
:END:

- 経験値
- 素材

モンスターごとに経験点の倍率を変えればいいだろうか。

- 石原 45 -> 56
- 石原 45 -> 56 <UP>
- レベルアップ時にどういう表示にするか
- levelUp systemを作成する
- 100を超えてた場合レベルを上げて経験点を0にする
** DONE VRTを自動コミットさせる
CLOSED: [2024-11-16 Sat 21:28]
:LOGBOOK:
CLOCK: [2024-11-16 Sat 12:48]--[2024-11-16 Sat 13:13] =>  0:25
:END:
なぜか手元とCIで数バイトレベルの差分が出るようになっている。一度CIでダウンロードしてからコミットしている。面倒なのでコミットまでしてもらう。
