20231128T074518--kdoc-59-ecsを使ってrpgを作る__project.html
<div id="outline-container-orgeb21ac3" class="outline-3">
<h3 id="orgeb21ac3"><a href="#orgeb21ac3"><span class="done DONE">DONE</span> 汎用の選択コンテナを作成する</a></h3>
<div class="outline-text-3" id="text-orgeb21ac3">
<p>
メニューなど、なにかを一覧して選択するのは多く使うので、作っておきたい。
</p>

<p>
メニュー。
</p>

<ul class="org-ul">
<li>選択肢のリスト</li>
<li>現在選択中の番号を示す変数</li>
</ul>

<p>
ゲージ。
</p>

<ul class="org-ul">
<li>HP</li>
<li>レベル</li>
<li>名前</li>
</ul>

<p>
どうやればいいのだろうか。
</p>

<ul class="org-ul">
<li>構造体で作っておいて、後で代入できるようにしとくといいのでは。あとその構造体に親子関係を作るメソッドを作ると。</li>
</ul>

<div class="org-src-container">
<pre class="src src-go">type aa struct {
        root ui.Container
        desc ui.Container
        list ui.Container
}

func (aa *aa) assemble {
        aa.root.AddChild(aa.desc)
        aa.root.AddChild(aa.list)
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org16750f8" class="outline-3">
<h3 id="org16750f8"><a href="#org16750f8"><span class="done DONE">DONE</span> 似たようなUI関数を統合する</a></h3>
<div class="outline-text-3" id="text-org16750f8">
<p>
オプションをちゃんと使ってないのを直す。
</p>
</div>
</div>
<div id="outline-container-org1a9f574" class="outline-3">
<h3 id="org1a9f574"><a href="#org1a9f574"><span class="done DONE">DONE</span> UIをまともにする</a></h3>
<div class="outline-text-3" id="text-org1a9f574">
<p>
凝る必要はないが、あまりにデバッグ感がある。
</p>

<ul class="org-ul">
<li>verticalContainerを簡単にしたい</li>
<li>共通のパラメータをもたせたい</li>
</ul>
</div>
</div>
<div id="outline-container-org10348c0" class="outline-3">
<h3 id="org10348c0"><a href="#org10348c0"><span class="done DONE">DONE</span> スクロールコンテナをListコンテナに置き換える</a></h3>
<div class="outline-text-3" id="text-org10348c0">
<p>
わかりやすくなる。
</p>
</div>
</div>
<div id="outline-container-org2728bab" class="outline-3">
<h3 id="org2728bab"><a href="#org2728bab"><span class="done DONE">DONE</span> スポーン時は自動で全回復する</a></h3>
<div class="outline-text-3" id="text-org2728bab">
<p>
いちいち回復させないといけないのが面倒なので。
</p>
</div>
</div>
<div id="outline-container-orge3ddcbe" class="outline-3">
<h3 id="orge3ddcbe"><a href="#orge3ddcbe"><span class="done DONE">DONE</span> 戦闘できるようにする</a></h3>
<div class="outline-text-3" id="text-orge3ddcbe">
<ul class="org-ul">
<li>敵にもコマンドを選ばせる</li>
<li>SPが足りない場合は不活性にする</li>
</ul>

<p>
カードの選択テーブル。敵の場合はSPの概念はない。
</p>

<ul class="org-ul">
<li>軽戦車
<ul class="org-ul">
<li>50ミリ砲: 0.4</li>
<li>7.62mm機関銃: 0.3</li>
<li>体当たり: 0.3</li>
</ul></li>
<li>オロチ(複数回攻撃)
<ul class="org-ul">
<li>火炎ブレス: 0.2</li>
<li>電撃ブレス: 0.2</li>
<li>凍結ブレス: 0.1</li>
<li>鉤爪: 0.3</li>
<li>咆哮: 0.2</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org3d22c86" class="outline-3">
<h3 id="org3d22c86"><a href="#org3d22c86"><span class="done DONE">DONE</span> フィールドに敵シンボルを作る</a></h3>
<div class="outline-text-3" id="text-org3d22c86">
<ul class="org-ul">
<li>とりあえず動かないやつ</li>
<li>ランダムに動くやつ</li>
<li>向きによる画像をどうするか
<ul class="org-ul">
<li>自キャラは8方向にしか動かないが、敵キャラはそうではない</li>
<li>角度の範囲にすればいいか</li>
<li>今は回転だが、回転は見た目があまりよくない</li>
<li>画像を5方向分用意して切り替えがよさそう(反転させて全方向にする)</li>
<li>とりあえず回転はなくしておく</li>
</ul></li>
<li>かぶる問題
<ul class="org-ul">
<li>positionを指定したはいいけど、重複検知がやりにくいな</li>
<li>tileだったら全体管理できていて楽だけど&#x2026;</li>
<li>スポーンのとき限定で、スポーン済みタイル配列を持っておいてチェックするとか</li>
<li>スポーン時はタイルで判断できれば問題ない。スポーン時、すべてのエンティティがタイルに沿った位置にある</li>
<li>タイルを指定してスポーンするインターフェースにすればよいのでは</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org7876ddf" class="outline-3">
<h3 id="org7876ddf"><a href="#org7876ddf"><span class="done DONE">DONE</span> 敵や味方を倒せるようにする</a></h3>
<div class="outline-text-3" id="text-org7876ddf">
<ul class="org-ul">
<li>死んでいる判定をする</li>
<li>味方でも敵でもすぐに削除はしない。フラグを立てるだけ</li>
<li>味方が全員死ぬとゲームオーバー</li>
<li>敵が全員死ぬと勝利</li>
<li>戦闘終了時に敵エンティティを削除する</li>
</ul>

<p>
メモ。
</p>

<ul class="org-ul">
<li>死亡フラグをどうするか</li>
<li>わざわざコンポーネントにしなくても、HP0で判定すればよさそう</li>
<li>死んだキャラは命令できない。ターゲットにならない</li>
<li>「倒した」は出して待ち状態にしたい
<ul class="org-ul">
<li>「敵を全滅させた」</li>
<li>メッセージ待ちごとにクリック待ちにしたほうが楽でいいのではないか</li>
</ul></li>
</ul>

<p>
パーティ。
</p>

<ul class="org-ul">
<li>味方の最後に行動するメンバーが死んだときに空のコマンド送りが発生する
<ul class="org-ul">
<li>▼をクリアするクリックと、ターン終わりのクリックがある</li>
<li>根本的に扱いにくい</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org22ef98f" class="outline-3">
<h3 id="org22ef98f"><a href="#org22ef98f"><span class="done DONE">DONE</span> 戦闘勝利時に獲得できるようにする</a></h3>
<div class="outline-text-3" id="text-org22ef98f">
<ul class="org-ul">
<li>経験値</li>
<li>素材</li>
</ul>

<p>
モンスターごとに経験点の倍率を変えればいいだろうか。
</p>

<ul class="org-ul">
<li>石原 45 -&gt; 56</li>
<li>石原 45 -&gt; 56 &lt;UP&gt;</li>
<li>レベルアップ時にどういう表示にするか</li>
<li>levelUp systemを作成する</li>
<li>100を超えてた場合レベルを上げて経験点を0にする</li>
</ul>
</div>
</div>
<div id="outline-container-org86e770a" class="outline-3">
<h3 id="org86e770a"><a href="#org86e770a"><span class="done DONE">DONE</span> VRTを自動コミットさせる</a></h3>
<div class="outline-text-3" id="text-org86e770a">
<p>
なぜか手元とCIで数バイトレベルの差分が出るようになっている。一度CIでダウンロードしてからコミットしている。面倒なのでコミットまでしてもらう。
</p>
</div>
</div>
