20231128T074518--kdoc-59-ecsを使ってrpgを作る__project.org
** DONE 移動を回転方式にする
CLOSED: [2025-03-09 Sun 13:41]
:LOGBOOK:
CLOCK: [2025-03-09 Sun 11:45]--[2025-03-09 Sun 12:10] =>  0:25
:END:

- w,sでアクセル
- a,dで回転
- このほうが斜め移動が便利であるし、ゲーム性もリアルな感じがする
** DONE 敵を移動させる
CLOSED: [2025-03-13 Thu 01:07]
:LOGBOOK:
CLOCK: [2025-03-09 Sun 18:07]--[2025-03-09 Sun 18:32] =>  0:25
CLOCK: [2025-03-09 Sun 17:42]--[2025-03-09 Sun 18:07] =>  0:25
CLOCK: [2025-03-09 Sun 15:30]--[2025-03-09 Sun 15:55] =>  0:25
CLOCK: [2025-03-09 Sun 13:42]--[2025-03-09 Sun 14:07] =>  0:25
:END:

- 状態遷移させる
- chase
  - 視界を実装する
  - 敵をどう認識するか
  - 一定距離に入るとEntityを認識する
  - そのEntityの方向に向かって直進する
- roam
  - 壁を認識する
- シンボルのなかでも、移動パターンが違うものがある
  - 赤玉A: ランダム移動
  - 赤玉B: 規則移動(壁伝い)
  - 赤玉C: ランダム移動 + 追跡

#+begin_src go
  // Component
  type AIInput struct {
          FSM MotionFSM
          Vision AIVision
  }

  type MotionFSM struct {
          CurrentState AIMoveState
          Vision       AIVision
  }

  // AIInput ================
  func Update() {
          fsm.Update()
          vision.Update()
  }

  // fsm ================
  // fsm でパターン遷移を管理する

  // 初期化する
  // 最初にroam stateを設定する
  NewMover()
  // stateを選ぶ。全状態遷移を記載する
  mover.ChooseState()
  // moverから現在stateをUpdate
  mover.Update() // currentState.Update
  // 状態を設定する
  mover.SetState()

  // 移動パターンの実装 ================
  // 実際に実行される移動パターン
  movepattern.Update()
#+end_src

- 最初から複雑すぎることをやろうとしている。少しづつやろう
- ミニマルな実装が完了した
** DONE キーボード操作対応する
CLOSED: [2025-07-14 Mon 19:18]
:LOGBOOK:
CLOCK: [2025-07-13 Sun 21:27]--[2025-07-13 Sun 21:52] =>  0:25
CLOCK: [2025-07-13 Sun 21:02]--[2025-07-13 Sun 21:27] =>  0:25
CLOCK: [2025-07-13 Sun 20:36]--[2025-07-13 Sun 21:01] =>  0:25
CLOCK: [2025-07-13 Sun 19:40]--[2025-07-13 Sun 20:05] =>  0:25
CLOCK: [2025-07-13 Sun 19:01]--[2025-07-13 Sun 19:26] =>  0:25
CLOCK: [2025-07-13 Sun 18:14]--[2025-07-13 Sun 18:39] =>  0:25
CLOCK: [2025-07-13 Sun 17:37]--[2025-07-13 Sun 18:02] =>  0:25
CLOCK: [2025-07-13 Sun 17:05]--[2025-07-13 Sun 17:30] =>  0:25
CLOCK: [2025-07-13 Sun 16:39]--[2025-07-13 Sun 17:04] =>  0:25
CLOCK: [2025-07-13 Sun 16:02]--[2025-07-13 Sun 16:27] =>  0:25
CLOCK: [2025-07-13 Sun 15:37]--[2025-07-13 Sun 16:02] =>  0:25
CLOCK: [2025-07-13 Sun 15:12]--[2025-07-13 Sun 15:37] =>  0:25
CLOCK: [2025-07-13 Sun 14:47]--[2025-07-13 Sun 15:12] =>  0:25
CLOCK: [2025-07-13 Sun 12:48]--[2025-07-13 Sun 13:13] =>  0:25
CLOCK: [2025-07-13 Sun 12:19]--[2025-07-13 Sun 12:44] =>  0:25
CLOCK: [2025-07-13 Sun 11:37]--[2025-07-13 Sun 12:02] =>  0:25
CLOCK: [2025-07-13 Sun 10:57]--[2025-07-13 Sun 11:22] =>  0:25
CLOCK: [2025-07-13 Sun 10:30]--[2025-07-13 Sun 10:55] =>  0:25
CLOCK: [2025-07-13 Sun 09:55]--[2025-07-13 Sun 10:20] =>  0:25
CLOCK: [2025-07-12 Sat 21:46]--[2025-07-12 Sat 22:11] =>  0:25
CLOCK: [2025-07-12 Sat 21:20]--[2025-07-12 Sat 21:45] =>  0:25
CLOCK: [2025-07-12 Sat 19:55]--[2025-07-12 Sat 20:20] =>  0:25
CLOCK: [2025-07-12 Sat 19:24]--[2025-07-12 Sat 19:49] =>  0:25
CLOCK: [2025-07-12 Sat 18:59]--[2025-07-12 Sat 19:24] =>  0:25
CLOCK: [2025-07-12 Sat 18:18]--[2025-07-12 Sat 18:43] =>  0:25
CLOCK: [2025-07-12 Sat 17:53]--[2025-07-12 Sat 18:18] =>  0:25
CLOCK: [2025-07-12 Sat 17:24]--[2025-07-12 Sat 17:49] =>  0:25
CLOCK: [2025-07-12 Sat 16:52]--[2025-07-12 Sat 17:17] =>  0:25
CLOCK: [2025-07-12 Sat 16:27]--[2025-07-12 Sat 16:52] =>  0:25
CLOCK: [2025-07-12 Sat 16:01]--[2025-07-12 Sat 16:26] =>  0:25
CLOCK: [2025-07-12 Sat 14:41]--[2025-07-12 Sat 15:06] =>  0:25
CLOCK: [2025-07-12 Sat 14:14]--[2025-07-12 Sat 14:39] =>  0:25
CLOCK: [2025-07-12 Sat 12:02]--[2025-07-12 Sat 12:27] =>  0:25
CLOCK: [2025-07-12 Sat 11:11]--[2025-07-12 Sat 11:36] =>  0:25
CLOCK: [2025-07-12 Sat 10:36]--[2025-07-12 Sat 11:01] =>  0:25
CLOCK: [2025-07-12 Sat 09:53]--[2025-07-12 Sat 10:18] =>  0:25
CLOCK: [2025-07-12 Sat 08:58]--[2025-07-12 Sat 09:23] =>  0:25
CLOCK: [2025-07-12 Sat 08:33]--[2025-07-12 Sat 08:58] =>  0:25
CLOCK: [2025-07-12 Sat 08:08]--[2025-07-12 Sat 08:33] =>  0:25
CLOCK: [2025-07-12 Sat 07:36]--[2025-07-12 Sat 08:01] =>  0:25
CLOCK: [2025-07-10 Thu 23:15]--[2025-07-10 Thu 23:40] =>  0:25
CLOCK: [2025-07-10 Thu 22:20]--[2025-07-10 Thu 22:45] =>  0:25
CLOCK: [2025-07-10 Thu 20:34]--[2025-07-10 Thu 20:59] =>  0:25
CLOCK: [2025-07-10 Thu 19:53]--[2025-07-10 Thu 20:18] =>  0:25
CLOCK: [2025-07-10 Thu 19:28]--[2025-07-10 Thu 19:53] =>  0:25
CLOCK: [2025-07-10 Thu 19:03]--[2025-07-10 Thu 19:28] =>  0:25
CLOCK: [2025-07-10 Thu 18:12]--[2025-07-10 Thu 18:37] =>  0:25
CLOCK: [2025-07-10 Thu 08:38]--[2025-07-10 Thu 09:03] =>  0:25
CLOCK: [2025-07-09 Wed 23:14]--[2025-07-09 Wed 23:39] =>  0:25
CLOCK: [2025-07-09 Wed 22:49]--[2025-07-09 Wed 23:14] =>  0:25
CLOCK: [2025-07-09 Wed 22:24]--[2025-07-09 Wed 22:49] =>  0:25
CLOCK: [2025-07-09 Wed 21:46]--[2025-07-09 Wed 22:11] =>  0:25
CLOCK: [2025-07-09 Wed 21:21]--[2025-07-09 Wed 21:46] =>  0:25
CLOCK: [2025-07-09 Wed 20:18]--[2025-07-09 Wed 20:43] =>  0:25
CLOCK: [2025-07-09 Wed 19:36]--[2025-07-09 Wed 20:01] =>  0:25
CLOCK: [2025-07-09 Wed 19:04]--[2025-07-09 Wed 19:29] =>  0:25
CLOCK: [2025-07-09 Wed 18:38]--[2025-07-09 Wed 19:03] =>  0:25
:END:

する。
** DONE CIまわり強化する
CLOSED: [2025-07-15 Tue 21:34]
:LOGBOOK:
CLOCK: [2025-07-14 Mon 19:19]--[2025-07-14 Mon 19:44] =>  0:25
:END:

linterなども設定する。
** DONE componentsを型安全にする
CLOSED: [2025-07-16 Wed 18:31]
:LOGBOOK:
CLOCK: [2025-07-15 Tue 23:27]--[2025-07-15 Tue 23:52] =>  0:25
CLOCK: [2025-07-15 Tue 22:54]--[2025-07-15 Tue 23:19] =>  0:25
CLOCK: [2025-07-15 Tue 21:59]--[2025-07-15 Tue 22:24] =>  0:25
CLOCK: [2025-07-15 Tue 21:34]--[2025-07-15 Tue 21:59] =>  0:25
:END:
する。
** DONE 構造化ログを整備する
CLOSED: [2025-07-17 Thu 21:35]
:LOGBOOK:
CLOCK: [2025-07-17 Thu 21:10]--[2025-07-17 Thu 21:35] =>  0:25
CLOCK: [2025-07-17 Thu 20:45]--[2025-07-17 Thu 21:10] =>  0:25
CLOCK: [2025-07-16 Wed 22:37]--[2025-07-16 Wed 23:02] =>  0:25
CLOCK: [2025-07-16 Wed 22:12]--[2025-07-16 Wed 22:37] =>  0:25
CLOCK: [2025-07-16 Wed 21:46]--[2025-07-16 Wed 22:11] =>  0:25
CLOCK: [2025-07-16 Wed 19:29]--[2025-07-16 Wed 19:54] =>  0:25
CLOCK: [2025-07-16 Wed 18:31]--[2025-07-16 Wed 18:56] =>  0:25
:END:

デバッグしやすくする。
** DONE 企画書を書く
CLOSED: [2025-07-19 Sat 15:58]
:LOGBOOK:
CLOCK: [2025-07-19 Sat 14:11]--[2025-07-19 Sat 14:36] =>  0:25
CLOCK: [2025-07-19 Sat 13:41]--[2025-07-19 Sat 14:06] =>  0:25
CLOCK: [2025-07-19 Sat 13:09]--[2025-07-19 Sat 13:34] =>  0:25
CLOCK: [2025-07-19 Sat 11:51]--[2025-07-19 Sat 12:16] =>  0:25
CLOCK: [2025-07-19 Sat 11:16]--[2025-07-19 Sat 11:41] =>  0:25
CLOCK: [2025-07-19 Sat 10:51]--[2025-07-19 Sat 11:16] =>  0:25
CLOCK: [2025-07-19 Sat 10:26]--[2025-07-19 Sat 10:51] =>  0:25
CLOCK: [2025-07-19 Sat 09:52]--[2025-07-19 Sat 10:17] =>  0:25
CLOCK: [2025-07-19 Sat 09:24]--[2025-07-19 Sat 09:49] =>  0:25
CLOCK: [2025-07-19 Sat 09:17]--[2025-07-19 Sat 09:22] =>  0:05
CLOCK: [2025-07-18 Fri 23:08]--[2025-07-18 Fri 23:33] =>  0:25
:END:

曖昧なままやっているので、そろそろやる。
** DONE 参考になりそうな実装を調べる
CLOSED: [2025-07-26 Sat 18:56]
:LOGBOOK:
CLOCK: [2025-03-08 Sat 22:18]--[2025-03-08 Sat 22:43] =>  0:25
CLOCK: [2025-03-08 Sat 21:52]--[2025-03-08 Sat 22:18] =>  0:26
CLOCK: [2025-03-08 Sat 21:27]--[2025-03-08 Sat 21:52] =>  0:25
CLOCK: [2025-03-08 Sat 21:02]--[2025-03-08 Sat 21:27] =>  0:25
CLOCK: [2025-03-08 Sat 20:37]--[2025-03-08 Sat 21:02] =>  0:25
CLOCK: [2025-03-08 Sat 18:59]--[2025-03-08 Sat 19:24] =>  0:25
CLOCK: [2025-03-08 Sat 17:52]--[2025-03-08 Sat 18:17] =>  0:25
CLOCK: [2025-03-08 Sat 16:42]--[2025-03-08 Sat 17:07] =>  0:25
CLOCK: [2025-03-08 Sat 16:07]--[2025-03-08 Sat 16:32] =>  0:25
CLOCK: [2025-03-08 Sat 14:40]--[2025-03-08 Sat 15:05] =>  0:25
CLOCK: [2025-03-08 Sat 14:15]--[2025-03-08 Sat 14:40] =>  0:25
CLOCK: [2025-03-08 Sat 13:49]--[2025-03-08 Sat 14:14] =>  0:25
:END:
フィールドがパフォーマンスの問題があったり、これからどうすればいいのかがわからない。参考になりそうな実装を探す。

- アニメーションどうやってるんだ
  - https://github.com/divVerent/aaaaxy/blob/d505d271c4e45a80b61ad4cce7c3ab44b9d30e29/internal/game/player/player.go#L209
  - https://github.com/divVerent/aaaaxy/blob/d505d271c4e45a80b61ad4cce7c3ab44b9d30e29/internal/game/misc/movinganimation.go#L31-L32 移動・フェードをミックスインする
- タイルベースと自由座標移動が混じっているので、わかりづらくなっている
  - どちらかでいいのではないか
- 衝突判定が重い
  - https://github.com/DTLP/mini_tanks/blob/26fa1399ce63d28a383d280e36428ad10e3bd7d0/internal/actors/collision.go#L133
  - これだけでよい
- 画像生成が重い
  - 毎回生成しているっぽい
- 視界判定が重い
  - [[https://github.com/divVerent/aaaaxy][divVerent/aaaaxy: A nonlinear 2D puzzle platformer taking place in impossible spaces.]]視界判定の参考になりそう
  - どこに書いてあるのかわからない
  - https://github.com/divVerent/aaaaxy/blob/d505d271c4e45a80b61ad4cce7c3ab44b9d30e29/internal/engine/world.go#L644-L645 見えないタイルは非表示にする
- たまにワープゲートが到達不可能な場所にある
  - とりあえず自動生成はあとでにしたほうがよい
** DONE 味方一覧表示を共通化する
CLOSED: [2025-07-26 Sat 18:58]
:LOGBOOK:
CLOCK: [2024-04-20 Sat 11:02]--[2024-04-20 Sat 11:27] =>  0:25
CLOCK: [2024-04-20 Sat 10:37]--[2024-04-20 Sat 11:02] =>  0:25
CLOCK: [2024-04-20 Sat 00:34]--[2024-04-20 Sat 00:59] =>  0:25
CLOCK: [2024-04-20 Sat 00:09]--[2024-04-20 Sat 00:34] =>  0:25
CLOCK: [2024-02-11 Sun 01:13]--[2024-02-11 Sun 01:38] =>  0:25
:END:

いろんなところで使いそうかつ、複数のパーツで構成されているので作成が面倒なので。
** DONE ステート切り替えが怪しい部分がある
CLOSED: [2025-07-26 Sat 18:59]
特にpopしている部分。

- pushで、文字があると重なる
- popしたときにOnStartは走らないので、前の画面を削除するのはダメ
** DONE 図形 or 画像描画の方法を考える
CLOSED: [2025-07-26 Sat 18:59]

UIのために図形描画したい。どうするか。画像を用意すればよいが、いい感じにやるためにはどうすればいいか。
** DONE モジュール分けする
CLOSED: [2025-07-26 Sat 19:07]
:LOGBOOK:
CLOCK: [2024-09-21 Sat 17:33]--[2024-09-21 Sat 17:58] =>  0:25
CLOCK: [2024-09-21 Sat 17:08]--[2024-09-21 Sat 17:33] =>  0:25
:END:
名前がかぶってややこしいものは分ける。

- system
- app
- message engine
