20231128T074518--kdoc-59-ecsを使ってrpgを作る__project.html
<div id="outline-container-orga15cd24" class="outline-3">
<h3 id="orga15cd24"><a href="#orga15cd24"><span class="done DONE">DONE</span> 移動を回転方式にする</a></h3>
<div class="outline-text-3" id="text-orga15cd24">
<ul class="org-ul">
<li>w,sでアクセル</li>
<li>a,dで回転</li>
<li>このほうが斜め移動が便利であるし、ゲーム性もリアルな感じがする</li>
</ul>
</div>
</div>
<div id="outline-container-org4640504" class="outline-3">
<h3 id="org4640504"><a href="#org4640504"><span class="done DONE">DONE</span> 敵を移動させる</a></h3>
<div class="outline-text-3" id="text-org4640504">
<ul class="org-ul">
<li>状態遷移させる</li>
<li>chase
<ul class="org-ul">
<li>視界を実装する</li>
<li>敵をどう認識するか</li>
<li>一定距離に入るとEntityを認識する</li>
<li>そのEntityの方向に向かって直進する</li>
</ul></li>
<li>roam
<ul class="org-ul">
<li>壁を認識する</li>
</ul></li>
<li>シンボルのなかでも、移動パターンが違うものがある
<ul class="org-ul">
<li>赤玉A: ランダム移動</li>
<li>赤玉B: 規則移動(壁伝い)</li>
<li>赤玉C: ランダム移動 + 追跡</li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-go">// Component
type AIInput struct {
        FSM MotionFSM
        Vision AIVision
}

type MotionFSM struct {
        CurrentState AIMoveState
        Vision       AIVision
}

// AIInput ================
func Update() {
        fsm.Update()
        vision.Update()
}

// fsm ================
// fsm でパターン遷移を管理する

// 初期化する
// 最初にroam stateを設定する
NewMover()
// stateを選ぶ。全状態遷移を記載する
mover.ChooseState()
// moverから現在stateをUpdate
mover.Update() // currentState.Update
// 状態を設定する
mover.SetState()

// 移動パターンの実装 ================
// 実際に実行される移動パターン
movepattern.Update()
</pre>
</div>

<ul class="org-ul">
<li>最初から複雑すぎることをやろうとしている。少しづつやろう</li>
<li>ミニマルな実装が完了した</li>
</ul>
</div>
</div>
<div id="outline-container-org7842f25" class="outline-3">
<h3 id="org7842f25"><a href="#org7842f25"><span class="done DONE">DONE</span> キーボード操作対応する</a></h3>
<div class="outline-text-3" id="text-org7842f25">
<p>
する。
</p>
</div>
</div>
<div id="outline-container-org09cf850" class="outline-3">
<h3 id="org09cf850"><a href="#org09cf850"><span class="done DONE">DONE</span> CIまわり強化する</a></h3>
<div class="outline-text-3" id="text-org09cf850">
<p>
linterなども設定する。
</p>
</div>
</div>
<div id="outline-container-org1382c26" class="outline-3">
<h3 id="org1382c26"><a href="#org1382c26"><span class="done DONE">DONE</span> componentsを型安全にする</a></h3>
<div class="outline-text-3" id="text-org1382c26">
<p>
する。
</p>
</div>
</div>
<div id="outline-container-org06a3f6d" class="outline-3">
<h3 id="org06a3f6d"><a href="#org06a3f6d"><span class="done DONE">DONE</span> 構造化ログを整備する</a></h3>
<div class="outline-text-3" id="text-org06a3f6d">
<p>
デバッグしやすくする。
</p>
</div>
</div>
<div id="outline-container-org2d7719e" class="outline-3">
<h3 id="org2d7719e"><a href="#org2d7719e"><span class="done DONE">DONE</span> 企画書を書く</a></h3>
<div class="outline-text-3" id="text-org2d7719e">
<p>
曖昧なままやっているので、そろそろやる。
</p>
</div>
</div>
<div id="outline-container-org5ab5a51" class="outline-3">
<h3 id="org5ab5a51"><a href="#org5ab5a51"><span class="done DONE">DONE</span> 参考になりそうな実装を調べる</a></h3>
<div class="outline-text-3" id="text-org5ab5a51">
<p>
フィールドがパフォーマンスの問題があったり、これからどうすればいいのかがわからない。参考になりそうな実装を探す。
</p>

<ul class="org-ul">
<li>アニメーションどうやってるんだ
<ul class="org-ul">
<li><a href="https://github.com/divVerent/aaaaxy/blob/d505d271c4e45a80b61ad4cce7c3ab44b9d30e29/internal/game/player/player.go#L209">https://github.com/divVerent/aaaaxy/blob/d505d271c4e45a80b61ad4cce7c3ab44b9d30e29/internal/game/player/player.go#L209</a></li>
<li><a href="https://github.com/divVerent/aaaaxy/blob/d505d271c4e45a80b61ad4cce7c3ab44b9d30e29/internal/game/misc/movinganimation.go#L31-L32">https://github.com/divVerent/aaaaxy/blob/d505d271c4e45a80b61ad4cce7c3ab44b9d30e29/internal/game/misc/movinganimation.go#L31-L32</a> 移動・フェードをミックスインする</li>
</ul></li>
<li>タイルベースと自由座標移動が混じっているので、わかりづらくなっている
<ul class="org-ul">
<li>どちらかでいいのではないか</li>
</ul></li>
<li>衝突判定が重い
<ul class="org-ul">
<li><a href="https://github.com/DTLP/mini_tanks/blob/26fa1399ce63d28a383d280e36428ad10e3bd7d0/internal/actors/collision.go#L133">https://github.com/DTLP/mini_tanks/blob/26fa1399ce63d28a383d280e36428ad10e3bd7d0/internal/actors/collision.go#L133</a></li>
<li>これだけでよい</li>
</ul></li>
<li>画像生成が重い
<ul class="org-ul">
<li>毎回生成しているっぽい</li>
</ul></li>
<li>視界判定が重い
<ul class="org-ul">
<li><a href="https://github.com/divVerent/aaaaxy">divVerent/aaaaxy: A nonlinear 2D puzzle platformer taking place in impossible spaces.</a>視界判定の参考になりそう</li>
<li>どこに書いてあるのかわからない</li>
<li><a href="https://github.com/divVerent/aaaaxy/blob/d505d271c4e45a80b61ad4cce7c3ab44b9d30e29/internal/engine/world.go#L644-L645">https://github.com/divVerent/aaaaxy/blob/d505d271c4e45a80b61ad4cce7c3ab44b9d30e29/internal/engine/world.go#L644-L645</a> 見えないタイルは非表示にする</li>
</ul></li>
<li>たまにワープゲートが到達不可能な場所にある
<ul class="org-ul">
<li>とりあえず自動生成はあとでにしたほうがよい</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgb45da22" class="outline-3">
<h3 id="orgb45da22"><a href="#orgb45da22"><span class="done DONE">DONE</span> 味方一覧表示を共通化する</a></h3>
<div class="outline-text-3" id="text-orgb45da22">
<p>
いろんなところで使いそうかつ、複数のパーツで構成されているので作成が面倒なので。
</p>
</div>
</div>
<div id="outline-container-orgcf44674" class="outline-3">
<h3 id="orgcf44674"><a href="#orgcf44674"><span class="done DONE">DONE</span> ステート切り替えが怪しい部分がある</a></h3>
<div class="outline-text-3" id="text-orgcf44674">
<p>
特にpopしている部分。
</p>

<ul class="org-ul">
<li>pushで、文字があると重なる</li>
<li>popしたときにOnStartは走らないので、前の画面を削除するのはダメ</li>
</ul>
</div>
</div>
<div id="outline-container-orgf69f51f" class="outline-3">
<h3 id="orgf69f51f"><a href="#orgf69f51f"><span class="done DONE">DONE</span> 図形 or 画像描画の方法を考える</a></h3>
<div class="outline-text-3" id="text-orgf69f51f">
<p>
UIのために図形描画したい。どうするか。画像を用意すればよいが、いい感じにやるためにはどうすればいいか。
</p>
</div>
</div>
<div id="outline-container-org0d9e74d" class="outline-3">
<h3 id="org0d9e74d"><a href="#org0d9e74d"><span class="done DONE">DONE</span> モジュール分けする</a></h3>
<div class="outline-text-3" id="text-org0d9e74d">
<p>
名前がかぶってややこしいものは分ける。
</p>

<ul class="org-ul">
<li>system</li>
<li>app</li>
<li>message engine</li>
</ul>
</div>
</div>
