20231128T074518--kdoc-59-ecsを使ってrpgを作る__project.org
** DONE タイプライター表示する
CLOSED: [2025-07-26 Sat 19:26]
:PROPERTIES:
:Effort:   5:00
:END:
:LOGBOOK:
CLOCK: [2025-07-26 Sat 18:45]--[2025-07-26 Sat 19:10] =>  0:25
CLOCK: [2025-07-26 Sat 16:37]--[2025-07-26 Sat 17:02] =>  0:25
CLOCK: [2025-07-26 Sat 16:12]--[2025-07-26 Sat 16:37] =>  0:25
CLOCK: [2025-07-26 Sat 13:48]--[2025-07-26 Sat 14:13] =>  0:25
CLOCK: [2025-07-26 Sat 13:19]--[2025-07-26 Sat 13:44] =>  0:25
CLOCK: [2025-07-26 Sat 10:51]--[2025-07-26 Sat 11:16] =>  0:25
CLOCK: [2025-07-26 Sat 10:07]--[2025-07-26 Sat 10:32] =>  0:25
CLOCK: [2025-07-26 Sat 09:35]--[2025-07-26 Sat 10:00] =>  0:25
CLOCK: [2025-07-26 Sat 00:35]--[2025-07-26 Sat 01:00] =>  0:25
CLOCK: [2025-07-25 Fri 23:18]--[2025-07-25 Fri 23:43] =>  0:25
CLOCK: [2025-07-25 Fri 22:22]--[2025-07-25 Fri 22:47] =>  0:25
CLOCK: [2025-07-25 Fri 20:54]--[2025-07-25 Fri 21:19] =>  0:25
CLOCK: [2025-07-25 Fri 20:29]--[2025-07-25 Fri 20:54] =>  0:25
CLOCK: [2025-07-25 Fri 20:04]--[2025-07-25 Fri 20:29] =>  0:25
CLOCK: [2025-07-25 Fri 18:51]--[2025-07-25 Fri 19:16] =>  0:25
CLOCK: [2025-07-23 Wed 21:56]--[2025-07-23 Wed 22:21] =>  0:25
CLOCK: [2025-07-23 Wed 21:30]--[2025-07-23 Wed 21:55] =>  0:25
CLOCK: [2025-07-23 Wed 21:05]--[2025-07-23 Wed 21:30] =>  0:25
CLOCK: [2025-07-23 Wed 20:40]--[2025-07-23 Wed 21:05] =>  0:25
CLOCK: [2025-07-23 Wed 20:15]--[2025-07-23 Wed 20:40] =>  0:25
:END:

テキストはアニメーション表示したい。多くの場所で使えるので共通化する。
** DONE 敵とエンカウントする
CLOSED: [2025-08-10 Sun 16:55]
:LOGBOOK:
CLOCK: [2025-08-10 Sun 12:53]--[2025-08-10 Sun 13:18] =>  0:25
CLOCK: [2025-08-10 Sun 12:19]--[2025-08-10 Sun 12:44] =>  0:25
CLOCK: [2025-08-10 Sun 11:39]--[2025-08-10 Sun 12:04] =>  0:25
CLOCK: [2025-08-10 Sun 00:25]--[2025-08-10 Sun 00:50] =>  0:25
CLOCK: [2025-08-09 Sat 23:09]--[2025-08-09 Sat 23:34] =>  0:25
CLOCK: [2025-08-09 Sat 20:39]--[2025-08-09 Sat 21:04] =>  0:25
CLOCK: [2025-08-09 Sat 20:13]--[2025-08-09 Sat 20:38] =>  0:25
CLOCK: [2025-08-09 Sat 19:48]--[2025-08-09 Sat 20:13] =>  0:25
CLOCK: [2025-08-09 Sat 19:12]--[2025-08-09 Sat 19:37] =>  0:25
CLOCK: [2025-08-09 Sat 18:11]--[2025-08-09 Sat 18:36] =>  0:25
CLOCK: [2025-03-14 Fri 00:18]--[2025-03-14 Fri 00:43] =>  0:25
CLOCK: [2025-03-13 Thu 23:43]--[2025-03-14 Fri 00:08] =>  0:25
CLOCK: [2025-03-09 Sun 18:32]--[2025-03-09 Sun 18:57] =>  0:25
CLOCK: [2025-03-09 Sun 11:19]--[2025-03-09 Sun 11:45] =>  0:26
CLOCK: [2025-03-09 Sun 10:54]--[2025-03-09 Sun 11:19] =>  0:25
CLOCK: [2025-03-09 Sun 10:29]--[2025-03-09 Sun 10:54] =>  0:25
:END:

- 敵シンボルと接触すると、シンボルに応じて戦闘を開始する
- 敵を移動させるのが先か
- 基本的に既存のやつを流用できるように見える。移動はタイルベースでないので
- とりあえず、一定ロジックで巡回するやつだけでいい
  - 敵によって移動ロジックは変える
  - 巡回型
  - 追跡型
- characterMotionState は継承元で、その子として各stateがある
- 旋回が必要なやつと必要でないやつがある
  - 見た目上滑らかに回転させないと変なものと、変でないものがある
  - 2つあると面倒なので回転が必要に統一する
- 画像の回転ってどこでやってるんだ
  - Positionのangleフィールドが持っているので描画時に
** DONE stateEventとeffectの違いがわかりにくい
CLOSED: [2025-08-10 Sun 19:04]
:LOGBOOK:
CLOCK: [2025-08-10 Sun 18:34]--[2025-08-10 Sun 18:59] =>  0:25
CLOCK: [2025-08-10 Sun 17:59]--[2025-08-10 Sun 18:24] =>  0:25
CLOCK: [2025-08-10 Sun 17:32]--[2025-08-10 Sun 17:57] =>  0:25
CLOCK: [2025-08-10 Sun 16:55]--[2025-08-10 Sun 17:20] =>  0:25
CLOCK: [2025-08-10 Sun 16:27]--[2025-08-10 Sun 16:52] =>  0:25
CLOCK: [2025-08-10 Sun 15:06]--[2025-08-10 Sun 15:31] =>  0:25
CLOCK: [2025-08-10 Sun 14:41]--[2025-08-10 Sun 15:06] =>  0:25
:END:

- stateEventはそういうのとしてまとめたほうがいい説。今、battle stateでstateEventチェックしている
- systemでstate遷移は相互依存になるのでできない
- stateの共通処理でやってよさそう
** DONE メインメニューをきれいにする
CLOSED: [2025-08-10 Sun 23:57]
:LOGBOOK:
CLOCK: [2025-08-10 Sun 22:38]--[2025-08-10 Sun 23:03] =>  0:25
CLOCK: [2025-08-10 Sun 21:54]--[2025-08-10 Sun 22:19] =>  0:25
CLOCK: [2025-08-10 Sun 20:47]--[2025-08-10 Sun 21:12] =>  0:25
CLOCK: [2025-08-10 Sun 20:22]--[2025-08-10 Sun 20:47] =>  0:25
CLOCK: [2025-08-10 Sun 19:55]--[2025-08-10 Sun 20:20] =>  0:25
CLOCK: [2025-08-10 Sun 19:16]--[2025-08-10 Sun 19:41] =>  0:25
:END:

- 真ん中寄せする
- 横を広くする
** DONE 階層移動をEffectでやる
CLOSED: [2025-08-11 Mon 00:05]
:LOGBOOK:
CLOCK: [2024-06-02 Sun 22:09]--[2024-06-02 Sun 22:34] =>  0:25
CLOCK: [2024-06-02 Sun 21:44]--[2024-06-02 Sun 22:09] =>  0:25
CLOCK: [2024-06-02 Sun 16:14]--[2024-06-02 Sun 16:39] =>  0:25
CLOCK: [2024-06-02 Sun 13:44]--[2024-06-02 Sun 14:09] =>  0:25
:END:
階層移動をイベントとして、ほかの箇所で使いやすくする。

- 特定のenitityを対象としないeffectだけど、これでいいのかな。参考コードの状況とは異なる。特定のentityではなく、gameResourceを変更する。ただ、アイテムで階層移動とかもしたいので、effectでできればいいか
- 今の階層移動の仕組み、わかりづらいな
** DONE イベント部分の設計
CLOSED: [2025-08-11 Mon 00:05]
:LOGBOOK:
CLOCK: [2024-01-04 Thu 09:56]--[2024-01-04 Thu 10:21] =>  0:25
CLOCK: [2024-01-03 Wed 22:35]--[2024-01-03 Wed 23:00] =>  0:25
CLOCK: [2024-01-03 Wed 21:52]--[2024-01-03 Wed 22:17] =>  0:25
CLOCK: [2024-01-03 Wed 21:09]--[2024-01-03 Wed 21:34] =>  0:25
CLOCK: [2024-01-03 Wed 19:12]--[2024-01-03 Wed 19:37] =>  0:25
:END:
1章のうろつきをどうするか考える。

- ローグライト形式にすると物語に関してあまり考えなくてよい
  - 繰り返しのゲームプレイに変化をつけやすい
  - 設定とかが伝わりにくい可能性がある
  - Tipsという形式でオプショナルに読めればよさそう
  - Tipsだと自然に紹介できなさそうな感じもする
  - あまり物語性はない
  - 物語部分は背景やSEつきのメッセージ形式で良い
- 行けるところはランダムで選ばれた4つにする
  - 行った回数によってイベントが起こる
  - 背反なイベントがある
  - 回数を重ねることで仲間になったりアイテムがもらえたりする
    - 例
    - 市場 x 2 => 整備士が仲間になる
    - 広場 x 2 => 回復薬がもらえる
  - 単調な感じもする
- イベントによって仲間になったり、アイテムが増えたり、ステータスが変動したりする
** DONE アイテム使用・削除をsystem化する
CLOSED: [2025-08-11 Mon 00:06]
wantsToUseエンティティを生成して、そのエンティティをsystemでキャッチする。

直接削除すると共通処理が追加しにくかったりする。

共通の関数化するだけでよさそうな感じもする。実行順とかがややこしくなるのかな。メッセージを伝える用のエンティティをいちいち作るのが面倒なんだよな。コードも増える。ポリシーを考えなければ。
** DONE コメントアウト記法をサポートする
CLOSED: [2025-08-11 Mon 00:06]
無視する。
** DONE 固定敵を指定できるようにする
CLOSED: [2025-08-11 Mon 17:16]
:LOGBOOK:
CLOCK: [2025-08-11 Mon 16:39]--[2025-08-11 Mon 17:04] =>  0:25
CLOCK: [2025-08-11 Mon 16:14]--[2025-08-11 Mon 16:39] =>  0:25
CLOCK: [2025-08-11 Mon 14:42]--[2025-08-11 Mon 15:07] =>  0:25
CLOCK: [2025-08-11 Mon 13:39]--[2025-08-11 Mon 14:04] =>  0:25
CLOCK: [2025-08-11 Mon 12:54]--[2025-08-11 Mon 13:19] =>  0:25
CLOCK: [2025-08-11 Mon 12:23]--[2025-08-11 Mon 12:48] =>  0:25
:END:

仕様。

- 20階ごとでボス部屋になる。固定ステージ
- 100階ボスを倒したあとラスボス。倒すとクリア、エンディング
- とくに会話などなく、イベントパッドで戦闘になる
- 倒すと扉が開いてワープパッドの部屋にいける
- 勝つと拠点からショートカットが解禁される

メモ。

- [X] ボス戦闘イベント作成する
- [X] 戦闘内容を注入できるようにする
  - テーブルから選ぶ場合
  - 固定の敵と戦闘する場合
** DONE 設定を導入する
CLOSED: [2025-08-12 Tue 18:40]
:LOGBOOK:
CLOCK: [2025-08-11 Mon 22:21]--[2025-08-11 Mon 22:46] =>  0:25
CLOCK: [2025-08-11 Mon 21:56]--[2025-08-11 Mon 22:21] =>  0:25
CLOCK: [2025-08-11 Mon 21:31]--[2025-08-11 Mon 21:56] =>  0:25
CLOCK: [2025-08-11 Mon 21:06]--[2025-08-11 Mon 21:31] =>  0:25
CLOCK: [2025-08-11 Mon 20:40]--[2025-08-11 Mon 21:05] =>  0:25
CLOCK: [2025-08-11 Mon 20:03]--[2025-08-11 Mon 20:28] =>  0:25
CLOCK: [2025-08-11 Mon 19:38]--[2025-08-11 Mon 20:03] =>  0:25
CLOCK: [2025-08-11 Mon 19:13]--[2025-08-11 Mon 19:38] =>  0:25
CLOCK: [2025-08-11 Mon 18:47]--[2025-08-11 Mon 19:12] =>  0:25
CLOCK: [2025-08-11 Mon 18:04]--[2025-08-11 Mon 18:29] =>  0:25
CLOCK: [2025-08-11 Mon 17:27]--[2025-08-11 Mon 17:52] =>  0:25
:END:

- 開発用と本番用のデフォルト設定を分ける
- 環境変数で個別に変更できる
** DONE キーボード説明を追加する
CLOSED: [2025-08-12 Tue 18:43]

- 使用キーが散逸している
- 開発するうえでの管理ドキュメントになる
** DONE 未探索の暗闇を追加する
CLOSED: [2025-08-13 Wed 15:53]

結局、ミニマップを作成していけばいいかということになった。

未探検の部分は暗くなる。

レイキャストして、タイルごとに探索済みフラグを立てていけばよいだろう。
** DONE コミットフックを設定する
CLOSED: [2025-08-19 Tue 21:49]

- コミット前にフォーマットさせる
** DONE WASM版でもセーブできるようにする
CLOSED: [2025-08-19 Tue 21:59]

ローカルストレージに保存する。

** DONE セーブ&ロードできるようにする
CLOSED: [2025-08-19 Tue 21:59]
:LOGBOOK:
CLOCK: [2025-08-19 Tue 20:52]--[2025-08-19 Tue 21:17] =>  0:25
:END:

セーブする。
** DONE バージョン表示する
CLOSED: [2025-08-19 Tue 23:03]
:LOGBOOK:
CLOCK: [2025-08-19 Tue 22:18]--[2025-08-19 Tue 22:43] =>  0:25
CLOCK: [2025-08-19 Tue 21:53]--[2025-08-19 Tue 22:18] =>  0:25
:END:

ビルド時にバージョンを注入しているので、それをメインメニューに表示する。
** DONE 仲間入れ替え画面を追加する
CLOSED: [2025-08-21 Thu 21:09]
:LOGBOOK:
CLOCK: [2025-08-21 Thu 20:40]--[2025-08-21 Thu 21:05] =>  0:25
CLOCK: [2025-08-21 Thu 19:55]--[2025-08-21 Thu 20:20] =>  0:25
CLOCK: [2025-08-21 Thu 19:30]--[2025-08-21 Thu 19:55] =>  0:25
CLOCK: [2025-08-21 Thu 19:02]--[2025-08-21 Thu 19:27] =>  0:25
CLOCK: [2025-08-21 Thu 18:24]--[2025-08-21 Thu 18:49] =>  0:25
CLOCK: [2025-08-21 Thu 17:47]--[2025-08-21 Thu 18:12] =>  0:25
CLOCK: [2025-08-21 Thu 17:10]--[2025-08-21 Thu 17:35] =>  0:25
CLOCK: [2025-08-20 Wed 16:59]--[2025-08-20 Wed 17:24] =>  0:25
CLOCK: [2025-08-20 Wed 16:34]--[2025-08-20 Wed 16:59] =>  0:25
CLOCK: [2025-08-20 Wed 16:08]--[2025-08-20 Wed 16:33] =>  0:25
CLOCK: [2025-08-20 Wed 15:30]--[2025-08-20 Wed 15:55] =>  0:25
CLOCK: [2025-08-20 Wed 15:05]--[2025-08-20 Wed 15:30] =>  0:25
CLOCK: [2025-08-20 Wed 14:40]--[2025-08-20 Wed 15:05] =>  0:25
CLOCK: [2025-08-20 Wed 10:54]--[2025-08-20 Wed 11:19] =>  0:25
CLOCK: [2025-08-20 Wed 10:22]--[2025-08-20 Wed 10:47] =>  0:25
CLOCK: [2025-08-20 Wed 09:08]--[2025-08-20 Wed 09:33] =>  0:25
CLOCK: [2025-08-20 Wed 08:43]--[2025-08-20 Wed 09:08] =>  0:25
CLOCK: [2025-08-20 Wed 08:18]--[2025-08-20 Wed 08:43] =>  0:25
CLOCK: [2025-08-20 Wed 07:48]--[2025-08-20 Wed 08:14] =>  0:26
CLOCK: [2025-08-19 Tue 23:12]--[2025-08-19 Tue 23:37] =>  0:25
:END:

入れ替えられるようにする。

- 主人公は固定
- 最大4人
- 各職業で特色があるなかから入れ替える
- 冒険のしやすさと戦闘のしやすさのトレードオフ
- 「探求者イシハラ」みたいにしたいが、そうするとIDが変わるので面倒である。変えにくい
- Name はIDと表示名の両方の役割がある
- 人間系は変わりうる
