20231128T074518--kdoc-59-ecsを使ってrpgを作る__project.html
<div id="outline-container-org9ce5bf9" class="outline-3">
<h3 id="org9ce5bf9"><a href="#org9ce5bf9"><span class="done DONE">DONE</span> タイプライター表示する</a></h3>
<div class="outline-text-3" id="text-org9ce5bf9">
<p>
テキストはアニメーション表示したい。多くの場所で使えるので共通化する。
</p>
</div>
</div>
<div id="outline-container-org5ff67d4" class="outline-3">
<h3 id="org5ff67d4"><a href="#org5ff67d4"><span class="done DONE">DONE</span> 敵とエンカウントする</a></h3>
<div class="outline-text-3" id="text-org5ff67d4">
<ul class="org-ul">
<li>敵シンボルと接触すると、シンボルに応じて戦闘を開始する</li>
<li>敵を移動させるのが先か</li>
<li>基本的に既存のやつを流用できるように見える。移動はタイルベースでないので</li>
<li>とりあえず、一定ロジックで巡回するやつだけでいい
<ul class="org-ul">
<li>敵によって移動ロジックは変える</li>
<li>巡回型</li>
<li>追跡型</li>
</ul></li>
<li>characterMotionState は継承元で、その子として各stateがある</li>
<li>旋回が必要なやつと必要でないやつがある
<ul class="org-ul">
<li>見た目上滑らかに回転させないと変なものと、変でないものがある</li>
<li>2つあると面倒なので回転が必要に統一する</li>
</ul></li>
<li>画像の回転ってどこでやってるんだ
<ul class="org-ul">
<li>Positionのangleフィールドが持っているので描画時に</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org1ca0c2e" class="outline-3">
<h3 id="org1ca0c2e"><a href="#org1ca0c2e"><span class="done DONE">DONE</span> stateEventとeffectの違いがわかりにくい</a></h3>
<div class="outline-text-3" id="text-org1ca0c2e">
<ul class="org-ul">
<li>stateEventはそういうのとしてまとめたほうがいい説。今、battle stateでstateEventチェックしている</li>
<li>systemでstate遷移は相互依存になるのでできない</li>
<li>stateの共通処理でやってよさそう</li>
</ul>
</div>
</div>
<div id="outline-container-org2e09898" class="outline-3">
<h3 id="org2e09898"><a href="#org2e09898"><span class="done DONE">DONE</span> メインメニューをきれいにする</a></h3>
<div class="outline-text-3" id="text-org2e09898">
<ul class="org-ul">
<li>真ん中寄せする</li>
<li>横を広くする</li>
</ul>
</div>
</div>
<div id="outline-container-org7386802" class="outline-3">
<h3 id="org7386802"><a href="#org7386802"><span class="done DONE">DONE</span> 階層移動をEffectでやる</a></h3>
<div class="outline-text-3" id="text-org7386802">
<p>
階層移動をイベントとして、ほかの箇所で使いやすくする。
</p>

<ul class="org-ul">
<li>特定のenitityを対象としないeffectだけど、これでいいのかな。参考コードの状況とは異なる。特定のentityではなく、gameResourceを変更する。ただ、アイテムで階層移動とかもしたいので、effectでできればいいか</li>
<li>今の階層移動の仕組み、わかりづらいな</li>
</ul>
</div>
</div>
<div id="outline-container-orgfbecaf2" class="outline-3">
<h3 id="orgfbecaf2"><a href="#orgfbecaf2"><span class="done DONE">DONE</span> イベント部分の設計</a></h3>
<div class="outline-text-3" id="text-orgfbecaf2">
<p>
1章のうろつきをどうするか考える。
</p>

<ul class="org-ul">
<li>ローグライト形式にすると物語に関してあまり考えなくてよい
<ul class="org-ul">
<li>繰り返しのゲームプレイに変化をつけやすい</li>
<li>設定とかが伝わりにくい可能性がある</li>
<li>Tipsという形式でオプショナルに読めればよさそう</li>
<li>Tipsだと自然に紹介できなさそうな感じもする</li>
<li>あまり物語性はない</li>
<li>物語部分は背景やSEつきのメッセージ形式で良い</li>
</ul></li>
<li>行けるところはランダムで選ばれた4つにする
<ul class="org-ul">
<li>行った回数によってイベントが起こる</li>
<li>背反なイベントがある</li>
<li>回数を重ねることで仲間になったりアイテムがもらえたりする
<ul class="org-ul">
<li>例</li>
<li>市場 x 2 =&gt; 整備士が仲間になる</li>
<li>広場 x 2 =&gt; 回復薬がもらえる</li>
</ul></li>
<li>単調な感じもする</li>
</ul></li>
<li>イベントによって仲間になったり、アイテムが増えたり、ステータスが変動したりする</li>
</ul>
</div>
</div>
<div id="outline-container-org2d43ae7" class="outline-3">
<h3 id="org2d43ae7"><a href="#org2d43ae7"><span class="done DONE">DONE</span> アイテム使用・削除をsystem化する</a></h3>
<div class="outline-text-3" id="text-org2d43ae7">
<p>
wantsToUseエンティティを生成して、そのエンティティをsystemでキャッチする。
</p>

<p>
直接削除すると共通処理が追加しにくかったりする。
</p>

<p>
共通の関数化するだけでよさそうな感じもする。実行順とかがややこしくなるのかな。メッセージを伝える用のエンティティをいちいち作るのが面倒なんだよな。コードも増える。ポリシーを考えなければ。
</p>
</div>
</div>
<div id="outline-container-org291ac2c" class="outline-3">
<h3 id="org291ac2c"><a href="#org291ac2c"><span class="done DONE">DONE</span> コメントアウト記法をサポートする</a></h3>
<div class="outline-text-3" id="text-org291ac2c">
<p>
無視する。
</p>
</div>
</div>
<div id="outline-container-orgea4e4e3" class="outline-3">
<h3 id="orgea4e4e3"><a href="#orgea4e4e3"><span class="done DONE">DONE</span> 固定敵を指定できるようにする</a></h3>
<div class="outline-text-3" id="text-orgea4e4e3">
<p>
仕様。
</p>

<ul class="org-ul">
<li>20階ごとでボス部屋になる。固定ステージ</li>
<li>100階ボスを倒したあとラスボス。倒すとクリア、エンディング</li>
<li>とくに会話などなく、イベントパッドで戦闘になる</li>
<li>倒すと扉が開いてワープパッドの部屋にいける</li>
<li>勝つと拠点からショートカットが解禁される</li>
</ul>

<p>
メモ。
</p>

<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> ボス戦闘イベント作成する</li>
<li class="on"><input type='checkbox' checked='checked' /> 戦闘内容を注入できるようにする
<ul class="org-ul">
<li>テーブルから選ぶ場合</li>
<li>固定の敵と戦闘する場合</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgafaec31" class="outline-3">
<h3 id="orgafaec31"><a href="#orgafaec31"><span class="done DONE">DONE</span> 設定を導入する</a></h3>
<div class="outline-text-3" id="text-orgafaec31">
<ul class="org-ul">
<li>開発用と本番用のデフォルト設定を分ける</li>
<li>環境変数で個別に変更できる</li>
</ul>
</div>
</div>
<div id="outline-container-org75a6ffd" class="outline-3">
<h3 id="org75a6ffd"><a href="#org75a6ffd"><span class="done DONE">DONE</span> キーボード説明を追加する</a></h3>
<div class="outline-text-3" id="text-org75a6ffd">
<ul class="org-ul">
<li>使用キーが散逸している</li>
<li>開発するうえでの管理ドキュメントになる</li>
</ul>
</div>
</div>
<div id="outline-container-orgdf9bc2d" class="outline-3">
<h3 id="orgdf9bc2d"><a href="#orgdf9bc2d"><span class="done DONE">DONE</span> 未探索の暗闇を追加する</a></h3>
<div class="outline-text-3" id="text-orgdf9bc2d">
<p>
結局、ミニマップを作成していけばいいかということになった。
</p>

<p>
未探検の部分は暗くなる。
</p>

<p>
レイキャストして、タイルごとに探索済みフラグを立てていけばよいだろう。
</p>
</div>
</div>
<div id="outline-container-org0a659bf" class="outline-3">
<h3 id="org0a659bf"><a href="#org0a659bf"><span class="done DONE">DONE</span> コミットフックを設定する</a></h3>
<div class="outline-text-3" id="text-org0a659bf">
<ul class="org-ul">
<li>コミット前にフォーマットさせる</li>
</ul>
</div>
</div>
<div id="outline-container-orgcda47cf" class="outline-3">
<h3 id="orgcda47cf"><a href="#orgcda47cf"><span class="done DONE">DONE</span> WASM版でもセーブできるようにする</a></h3>
<div class="outline-text-3" id="text-orgcda47cf">
<p>
ローカルストレージに保存する。
</p>
</div>
</div>
<div id="outline-container-org8ab6ca1" class="outline-3">
<h3 id="org8ab6ca1"><a href="#org8ab6ca1"><span class="done DONE">DONE</span> セーブ&amp;ロードできるようにする</a></h3>
<div class="outline-text-3" id="text-org8ab6ca1">
<p>
セーブする。
</p>
</div>
</div>
<div id="outline-container-orgbab5361" class="outline-3">
<h3 id="orgbab5361"><a href="#orgbab5361"><span class="done DONE">DONE</span> バージョン表示する</a></h3>
<div class="outline-text-3" id="text-orgbab5361">
<p>
ビルド時にバージョンを注入しているので、それをメインメニューに表示する。
</p>
</div>
</div>
<div id="outline-container-orgac7560b" class="outline-3">
<h3 id="orgac7560b"><a href="#orgac7560b"><span class="done DONE">DONE</span> 仲間入れ替え画面を追加する</a></h3>
<div class="outline-text-3" id="text-orgac7560b">
<p>
入れ替えられるようにする。
</p>

<ul class="org-ul">
<li>主人公は固定</li>
<li>最大4人</li>
<li>各職業で特色があるなかから入れ替える</li>
<li>冒険のしやすさと戦闘のしやすさのトレードオフ</li>
<li>「探求者イシハラ」みたいにしたいが、そうするとIDが変わるので面倒である。変えにくい</li>
<li>Name はIDと表示名の両方の役割がある</li>
<li>人間系は変わりうる</li>
</ul>
</div>
</div>
