20231128T074518--kdoc-59-ecsを使ってrpgを作る__project.org
** DONE 接触でイベント発火させる
CLOSED: [2025-08-21 Thu 21:15]
:LOGBOOK:
CLOCK: [2024-11-16 Sat 21:38]--[2024-11-16 Sat 22:03] =>  0:25
CLOCK: [2024-11-16 Sat 11:38]--[2024-11-16 Sat 12:03] =>  0:25
CLOCK: [2024-11-16 Sat 11:11]--[2024-11-16 Sat 11:36] =>  0:25
CLOCK: [2024-11-16 Sat 10:28]--[2024-11-16 Sat 10:53] =>  0:25
CLOCK: [2024-11-16 Sat 10:02]--[2024-11-16 Sat 10:27] =>  0:25
CLOCK: [2024-11-11 Mon 19:55]--[2024-11-11 Mon 20:20] =>  0:25
CLOCK: [2024-11-11 Mon 00:38]--[2024-11-11 Mon 01:03] =>  0:25
CLOCK: [2024-11-11 Mon 00:12]--[2024-11-11 Mon 00:37] =>  0:25
CLOCK: [2024-11-10 Sun 23:16]--[2024-11-10 Sun 23:42] =>  0:26
CLOCK: [2024-11-10 Sun 22:49]--[2024-11-10 Sun 23:14] =>  0:25
CLOCK: [2024-11-10 Sun 22:16]--[2024-11-10 Sun 22:41] =>  0:25
CLOCK: [2024-11-10 Sun 21:45]--[2024-11-10 Sun 22:10] =>  0:25
CLOCK: [2024-11-10 Sun 20:48]--[2024-11-10 Sun 21:13] =>  0:25
CLOCK: [2024-11-10 Sun 20:23]--[2024-11-10 Sun 20:48] =>  0:25
CLOCK: [2024-11-10 Sun 19:48]--[2024-11-10 Sun 20:13] =>  0:25
CLOCK: [2024-11-10 Sun 19:23]--[2024-11-10 Sun 19:48] =>  0:25
CLOCK: [2024-11-10 Sun 14:48]--[2024-11-10 Sun 15:13] =>  0:25
CLOCK: [2024-11-10 Sun 11:47]--[2024-11-10 Sun 12:12] =>  0:25
CLOCK: [2024-11-10 Sun 11:02]--[2024-11-10 Sun 11:27] =>  0:25
CLOCK: [2024-11-10 Sun 10:34]--[2024-11-10 Sun 10:59] =>  0:25
CLOCK: [2024-11-10 Sun 10:00]--[2024-11-10 Sun 10:25] =>  0:25
CLOCK: [2024-10-27 Sun 19:27]--[2024-10-27 Sun 19:52] =>  0:25
CLOCK: [2024-10-27 Sun 18:40]--[2024-10-27 Sun 19:05] =>  0:25
CLOCK: [2024-10-27 Sun 17:57]--[2024-10-27 Sun 18:22] =>  0:25
CLOCK: [2024-06-02 Sun 21:17]--[2024-06-02 Sun 21:42] =>  0:25
CLOCK: [2024-06-02 Sun 17:56]--[2024-06-02 Sun 18:21] =>  0:25
CLOCK: [2024-06-02 Sun 17:28]--[2024-06-02 Sun 17:53] =>  0:25
CLOCK: [2024-06-02 Sun 16:56]--[2024-06-02 Sun 17:21] =>  0:25
:END:

敵シンボルとのエンカウントとは異なる。

- 接触したときに、テキストをいくつか表示したあとに、クリアにして、メインメニューに戻す
- テキスト表示と、ステート遷移

#+caption: 疑似コード
#+begin_src go
  // ボスとの戦闘
  func bossEvent() {
          msg(`美しい庭園が広がっている。襲いかかってきた`)
          battle('Elder Witch') // 敵グループを選び、戦闘ステートに遷移
          msg('宝を入手した') // 戦闘勝利後、戻ってくる
          get('黒い珠')
          flag(TowerFinish)
          // 拠点ステートに遷移
          state(HomeState)
  }

  // フィールドでの汎用イベント
  func itemFieldEvent() {
          // 後で戻れるように現在ステートを保存しておく
          push()
          // 本文を表示するステートに遷移する。ラベル名指定で使用できる
          addEvent(msgByLabel("アイテム入手汎用"))
          // (クリック待ち) クリックされたら
          // プリセットのテーブルから選ぶ。取得した結果も表示したいな
          getRandomItemByTable("field forest")
          // ログを表示するステートに遷移する。文字列を引数に渡す
          addEvent(msgByRawText(showEventLog()))
          // (クリック待ち)
          // 元のステートに戻る
          pop()
  }

  // ================
  // 実行ループ
  // スタックの先頭を実行する
  e := events.Pop()
  // イベント遷移があれば遷移
  if e.(trans) {
          return TransPop{}
  }
  // 実行。パラメータ変動やアイテム入手など
  e()
#+end_src

#+RESULTS:
#+begin_src
#+end_src

あるいは。

#+begin_src shell
  event := func() {
      // テキスト表示
      msgByLabel("アイテム入手汎用")
      getRandomItemByTable("field forest")
  }
  State{event}
#+end_src

#+RESULTS:
#+begin_src
#+end_src

というようにしたいが、無名関数の中でstateにアクセスしたりができないのではないか。

- フィールドでの戦闘勝利後はフィールドに戻ってほしい
- イベントでの戦闘勝利後は後続のイベントを開始してほしい
- イベント進行ステートを作ればいいかな。会話終了時や戦闘終了時はpopしてもらってイベント進行ステートに戻る。前の続きから開始する
- フラグ管理とかアイテム入手とかあるから、コード形式なのが望ましい
- どうやって戻ってきて再開するか。キューをポップしてから実行してやればいいのかな。実行したものは消えて、戻ると新しいイベントを実行して遷移する、という
- 遷移先がわからないといけない
  - 基本、イベントが終わったらpopしてくる、でいいのか
  - イベントのスタックを用意する、って感じでよさそう
- 各イベント間の遷移をどう指定するか
- フラグやアイテム追加などのコマンドがあるいっぽうで、メッセージ表示などクリック待ちで次に進めるものもある
  - クリックしたあとのアクションをどうするか。場合によって違いそうだが
- 現在のStateは、各ステートで状態遷移を記述している。それを、全体から遷移できるようにする
  - 基本的に、メッセージ表示イベントは終了後popすればいい
- 戻る必要のあるものだけ、スタックに保存しておけばいい
- イベント名指定で表示する場合と、直接文字列を指定できるものがある
- 基本的に、終了後ポップするタイプのステートしかない
  - テキスト表示
  - 戦闘
- 要するにステート遷移系と途中で挟む系ができればいい(アイテム入手など)
- ステートスタック
  - イベントステートの中でさらにスタックを保持する
  - 共通のステートスタックを使う
- 本質的に、複数のステートをまとめて扱いたいということだ。組み合わせたい

#+begin_src
- eventName: "塔の遺跡 最深部イントロ"
- eventName: "塔の遺跡 ボス"
- eventName: "森の遺跡 最深部イントロ"
- eventName: "森の遺跡 ボス"
#+end_src

- とりあえずステータス変化はなしでやってみるか
- 接触でどうやってステートを変化させればいいのか
  - 通知用entityを発行する
  - steteで通知コンポーネントを検知する
** DONE ダンジョンステートが重い
CLOSED: [2025-08-23 Sat 10:14]
:LOGBOOK:
CLOCK: [2025-08-23 Sat 09:45]--[2025-08-23 Sat 10:10] =>  0:25
CLOCK: [2025-08-23 Sat 00:50]--[2025-08-23 Sat 01:15] =>  0:25
CLOCK: [2025-08-22 Fri 23:53]--[2025-08-23 Sat 00:18] =>  0:25
CLOCK: [2025-08-22 Fri 23:11]--[2025-08-22 Fri 23:36] =>  0:25
:END:

いつのまにかWASM版でFPSが10くらいしか出ないことに気づいた。
** DONE 角の壁がないとレイが抜ける
CLOSED: [2025-08-23 Sat 14:30]
:LOGBOOK:
CLOCK: [2025-08-23 Sat 12:22]--[2025-08-23 Sat 12:47] =>  0:25
CLOCK: [2025-08-23 Sat 11:40]--[2025-08-23 Sat 12:05] =>  0:25
CLOCK: [2025-08-23 Sat 11:07]--[2025-08-23 Sat 11:32] =>  0:25
CLOCK: [2025-08-23 Sat 10:39]--[2025-08-23 Sat 11:04] =>  0:25
CLOCK: [2025-08-23 Sat 10:14]--[2025-08-23 Sat 10:39] =>  0:25
:END:

角も埋めるようにする。
** DONE フロアの枠をどうするか考える
CLOSED: [2025-08-23 Sat 18:06]
:LOGBOOK:
CLOCK: [2025-08-23 Sat 17:18]--[2025-08-23 Sat 17:43] =>  0:25
CLOCK: [2025-08-23 Sat 16:42]--[2025-08-23 Sat 17:07] =>  0:25
CLOCK: [2025-08-23 Sat 14:31]--[2025-08-23 Sat 14:56] =>  0:25
:END:

端が真っ黒なので、わかりづらい。壁で囲うか、色を変えてわかりやすくする。
** DONE ステージをシード指定で生成できるようにする
CLOSED: [2025-08-23 Sat 21:17]
:LOGBOOK:
CLOCK: [2025-08-23 Sat 20:52]--[2025-08-23 Sat 21:17] =>  0:25
CLOCK: [2025-08-23 Sat 20:20]--[2025-08-23 Sat 20:45] =>  0:25
CLOCK: [2025-08-23 Sat 18:31]--[2025-08-23 Sat 18:56] =>  0:25
CLOCK: [2025-08-23 Sat 18:06]--[2025-08-23 Sat 18:31] =>  0:25
:END:

現在はダンジョンステートでのVRTは毎回差分が出るのでオフにしている。
** DONE 部屋ビルダーのバリエーションを増やす
CLOSED: [2025-08-24 Sun 12:44]
:LOGBOOK:
CLOCK: [2025-08-24 Sun 12:13]--[2025-08-24 Sun 12:38] =>  0:25
CLOCK: [2025-08-24 Sun 11:44]--[2025-08-24 Sun 12:09] =>  0:25
CLOCK: [2025-08-23 Sat 23:13]--[2025-08-23 Sat 23:38] =>  0:25
CLOCK: [2025-08-23 Sat 22:48]--[2025-08-23 Sat 23:13] =>  0:25
CLOCK: [2025-08-23 Sat 22:12]--[2025-08-23 Sat 22:37] =>  0:25
CLOCK: [2025-08-23 Sat 21:17]--[2025-08-23 Sat 21:42] =>  0:25
:END:

大部屋を作る。
** DONE 戦闘でのミスを直す
CLOSED: [2025-08-27 Wed 19:18]

パーティにいないメンバーもコマンドが出るので直す。

** DONE デバッグ用のステージデバッグメニュー項目を追加する
CLOSED: [2025-08-27 Wed 19:18]
:LOGBOOK:
CLOCK: [2025-08-26 Tue 21:21]--[2025-08-26 Tue 21:46] =>  0:25
CLOCK: [2025-08-26 Tue 20:56]--[2025-08-26 Tue 21:21] =>  0:25
CLOCK: [2025-08-26 Tue 20:21]--[2025-08-26 Tue 20:46] =>  0:25
CLOCK: [2025-08-26 Tue 19:55]--[2025-08-26 Tue 20:20] =>  0:25
CLOCK: [2025-08-25 Mon 20:48]--[2025-08-25 Mon 21:13] =>  0:25
CLOCK: [2025-08-25 Mon 20:17]--[2025-08-25 Mon 20:42] =>  0:25
CLOCK: [2025-08-24 Sun 23:30]--[2025-08-24 Sun 23:55] =>  0:25
CLOCK: [2025-08-24 Sun 23:03]--[2025-08-24 Sun 23:28] =>  0:25
CLOCK: [2025-08-24 Sun 22:38]--[2025-08-24 Sun 23:03] =>  0:25
CLOCK: [2025-08-24 Sun 22:12]--[2025-08-24 Sun 22:37] =>  0:25
CLOCK: [2025-08-24 Sun 20:40]--[2025-08-24 Sun 21:05] =>  0:25
CLOCK: [2025-08-24 Sun 20:15]--[2025-08-24 Sun 20:40] =>  0:25
CLOCK: [2025-08-24 Sun 19:44]--[2025-08-24 Sun 20:09] =>  0:25
CLOCK: [2025-08-24 Sun 19:19]--[2025-08-24 Sun 19:44] =>  0:25
CLOCK: [2025-08-24 Sun 17:28]--[2025-08-24 Sun 17:53] =>  0:25
CLOCK: [2025-08-24 Sun 17:01]--[2025-08-24 Sun 17:26] =>  0:25
CLOCK: [2025-08-24 Sun 16:30]--[2025-08-24 Sun 16:55] =>  0:25
CLOCK: [2025-08-24 Sun 16:01]--[2025-08-24 Sun 16:26] =>  0:25
CLOCK: [2025-08-24 Sun 13:44]--[2025-08-24 Sun 14:09] =>  0:25
CLOCK: [2025-08-24 Sun 12:44]--[2025-08-24 Sun 13:09] =>  0:25
:END:

すぐ生成できるようにする。項目が多いから、スクロールできないといけないだろうな。

- Columns は未使用なのでは
** DONE アイテムを配置する
CLOSED: [2025-09-06 Sat 18:32]
:LOGBOOK:
CLOCK: [2025-09-06 Sat 18:06]--[2025-09-06 Sat 18:31] =>  0:25
CLOCK: [2025-09-06 Sat 17:29]--[2025-09-06 Sat 17:54] =>  0:25
CLOCK: [2025-09-06 Sat 17:01]--[2025-09-06 Sat 17:26] =>  0:25
:END:
ステージ初期化時にアイテムを配置する。
** DONE フィールドログを表示する
CLOSED: [2025-09-07 Sun 09:38]
:LOGBOOK:
CLOCK: [2025-09-07 Sun 08:37]--[2025-09-07 Sun 09:02] =>  0:25
CLOCK: [2025-09-06 Sat 23:12]--[2025-09-06 Sat 23:37] =>  0:25
CLOCK: [2025-09-06 Sat 22:47]--[2025-09-06 Sat 23:12] =>  0:25
CLOCK: [2025-09-06 Sat 22:22]--[2025-09-06 Sat 22:47] =>  0:25
CLOCK: [2025-09-06 Sat 21:43]--[2025-09-06 Sat 22:08] =>  0:25
CLOCK: [2025-09-06 Sat 20:33]--[2025-09-06 Sat 20:58] =>  0:25
CLOCK: [2025-09-06 Sat 19:20]--[2025-09-06 Sat 19:45] =>  0:25
CLOCK: [2025-09-06 Sat 18:34]--[2025-09-06 Sat 18:59] =>  0:25
:END:

- 文字を表示する
