20231128T074518--kdoc-59-ecsを使ってrpgを作る__project.html
<div id="outline-container-org34a6dac" class="outline-3">
<h3 id="org34a6dac"><a href="#org34a6dac"><span class="done DONE">DONE</span> 接触でイベント発火させる</a></h3>
<div class="outline-text-3" id="text-org34a6dac">
<p>
敵シンボルとのエンカウントとは異なる。
</p>

<ul class="org-ul">
<li>接触したときに、テキストをいくつか表示したあとに、クリアにして、メインメニューに戻す</li>
<li>テキスト表示と、ステート遷移</li>
</ul>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 10: </span>疑似コード</label><pre class="src src-go">// ボスとの戦闘
func bossEvent() {
        msg(`美しい庭園が広がっている。襲いかかってきた`)
        battle('Elder Witch') // 敵グループを選び、戦闘ステートに遷移
        msg('宝を入手した') // 戦闘勝利後、戻ってくる
        get('黒い珠')
        flag(TowerFinish)
        // 拠点ステートに遷移
        state(HomeState)
}

// フィールドでの汎用イベント
func itemFieldEvent() {
        // 後で戻れるように現在ステートを保存しておく
        push()
        // 本文を表示するステートに遷移する。ラベル名指定で使用できる
        addEvent(msgByLabel("アイテム入手汎用"))
        // (クリック待ち) クリックされたら
        // プリセットのテーブルから選ぶ。取得した結果も表示したいな
        getRandomItemByTable("field forest")
        // ログを表示するステートに遷移する。文字列を引数に渡す
        addEvent(msgByRawText(showEventLog()))
        // (クリック待ち)
        // 元のステートに戻る
        pop()
}

// ================
// 実行ループ
// スタックの先頭を実行する
e := events.Pop()
// イベント遷移があれば遷移
if e.(trans) {
        return TransPop{}
}
// 実行。パラメータ変動やアイテム入手など
e()
</pre>
</div>

<div class="org-src-container">
<pre class="src src-nil">
</pre>
</div>

<p>
あるいは。
</p>

<div class="org-src-container">
<pre class="src src-shell">event := func() {
    // &#12486;&#12461;&#12473;&#12488;&#34920;&#31034;
    msgByLabel(<span class="org-string">"&#12450;&#12452;&#12486;&#12512;&#20837;&#25163;&#27726;&#29992;"</span>)
    getRandomItemByTable(<span class="org-string">"field forest"</span>)
}
State{event}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-nil">
</pre>
</div>

<p>
というようにしたいが、無名関数の中でstateにアクセスしたりができないのではないか。
</p>

<ul class="org-ul">
<li>フィールドでの戦闘勝利後はフィールドに戻ってほしい</li>
<li>イベントでの戦闘勝利後は後続のイベントを開始してほしい</li>
<li>イベント進行ステートを作ればいいかな。会話終了時や戦闘終了時はpopしてもらってイベント進行ステートに戻る。前の続きから開始する</li>
<li>フラグ管理とかアイテム入手とかあるから、コード形式なのが望ましい</li>
<li>どうやって戻ってきて再開するか。キューをポップしてから実行してやればいいのかな。実行したものは消えて、戻ると新しいイベントを実行して遷移する、という</li>
<li>遷移先がわからないといけない
<ul class="org-ul">
<li>基本、イベントが終わったらpopしてくる、でいいのか</li>
<li>イベントのスタックを用意する、って感じでよさそう</li>
</ul></li>
<li>各イベント間の遷移をどう指定するか</li>
<li>フラグやアイテム追加などのコマンドがあるいっぽうで、メッセージ表示などクリック待ちで次に進めるものもある
<ul class="org-ul">
<li>クリックしたあとのアクションをどうするか。場合によって違いそうだが</li>
</ul></li>
<li>現在のStateは、各ステートで状態遷移を記述している。それを、全体から遷移できるようにする
<ul class="org-ul">
<li>基本的に、メッセージ表示イベントは終了後popすればいい</li>
</ul></li>
<li>戻る必要のあるものだけ、スタックに保存しておけばいい</li>
<li>イベント名指定で表示する場合と、直接文字列を指定できるものがある</li>
<li>基本的に、終了後ポップするタイプのステートしかない
<ul class="org-ul">
<li>テキスト表示</li>
<li>戦闘</li>
</ul></li>
<li>要するにステート遷移系と途中で挟む系ができればいい(アイテム入手など)</li>
<li>ステートスタック
<ul class="org-ul">
<li>イベントステートの中でさらにスタックを保持する</li>
<li>共通のステートスタックを使う</li>
</ul></li>
<li>本質的に、複数のステートをまとめて扱いたいということだ。組み合わせたい</li>
</ul>

<div class="org-src-container">
<pre class="src src-nil">- eventName: "塔の遺跡 最深部イントロ"
- eventName: "塔の遺跡 ボス"
- eventName: "森の遺跡 最深部イントロ"
- eventName: "森の遺跡 ボス"
</pre>
</div>

<ul class="org-ul">
<li>とりあえずステータス変化はなしでやってみるか</li>
<li>接触でどうやってステートを変化させればいいのか
<ul class="org-ul">
<li>通知用entityを発行する</li>
<li>steteで通知コンポーネントを検知する</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org3d02d88" class="outline-3">
<h3 id="org3d02d88"><a href="#org3d02d88"><span class="done DONE">DONE</span> ダンジョンステートが重い</a></h3>
<div class="outline-text-3" id="text-org3d02d88">
<p>
いつのまにかWASM版でFPSが10くらいしか出ないことに気づいた。
</p>
</div>
</div>
<div id="outline-container-orgfdb2aa8" class="outline-3">
<h3 id="orgfdb2aa8"><a href="#orgfdb2aa8"><span class="done DONE">DONE</span> 角の壁がないとレイが抜ける</a></h3>
<div class="outline-text-3" id="text-orgfdb2aa8">
<p>
角も埋めるようにする。
</p>
</div>
</div>
<div id="outline-container-org8666e1b" class="outline-3">
<h3 id="org8666e1b"><a href="#org8666e1b"><span class="done DONE">DONE</span> フロアの枠をどうするか考える</a></h3>
<div class="outline-text-3" id="text-org8666e1b">
<p>
端が真っ黒なので、わかりづらい。壁で囲うか、色を変えてわかりやすくする。
</p>
</div>
</div>
<div id="outline-container-orgb404b7a" class="outline-3">
<h3 id="orgb404b7a"><a href="#orgb404b7a"><span class="done DONE">DONE</span> ステージをシード指定で生成できるようにする</a></h3>
<div class="outline-text-3" id="text-orgb404b7a">
<p>
現在はダンジョンステートでのVRTは毎回差分が出るのでオフにしている。
</p>
</div>
</div>
<div id="outline-container-org510fd6c" class="outline-3">
<h3 id="org510fd6c"><a href="#org510fd6c"><span class="done DONE">DONE</span> 部屋ビルダーのバリエーションを増やす</a></h3>
<div class="outline-text-3" id="text-org510fd6c">
<p>
大部屋を作る。
</p>
</div>
</div>
<div id="outline-container-org738b04f" class="outline-3">
<h3 id="org738b04f"><a href="#org738b04f"><span class="done DONE">DONE</span> 戦闘でのミスを直す</a></h3>
<div class="outline-text-3" id="text-org738b04f">
<p>
パーティにいないメンバーもコマンドが出るので直す。
</p>
</div>
</div>
<div id="outline-container-org05ec965" class="outline-3">
<h3 id="org05ec965"><a href="#org05ec965"><span class="done DONE">DONE</span> デバッグ用のステージデバッグメニュー項目を追加する</a></h3>
<div class="outline-text-3" id="text-org05ec965">
<p>
すぐ生成できるようにする。項目が多いから、スクロールできないといけないだろうな。
</p>

<ul class="org-ul">
<li>Columns は未使用なのでは</li>
</ul>
</div>
</div>
<div id="outline-container-org623f643" class="outline-3">
<h3 id="org623f643"><a href="#org623f643"><span class="done DONE">DONE</span> アイテムを配置する</a></h3>
<div class="outline-text-3" id="text-org623f643">
<p>
ステージ初期化時にアイテムを配置する。
</p>
</div>
</div>
<div id="outline-container-org4466340" class="outline-3">
<h3 id="org4466340"><a href="#org4466340"><span class="done DONE">DONE</span> フィールドログを表示する</a></h3>
<div class="outline-text-3" id="text-org4466340">
<ul class="org-ul">
<li>文字を表示する</li>
</ul>
</div>
</div>
