20231128T074518--kdoc-59-ecsを使ってrpgを作る__project.org
** DONE systemのUI関数を移動する
CLOSED: [2025-09-07 Sun 20:49]
:LOGBOOK:
CLOCK: [2025-09-07 Sun 18:32]--[2025-09-07 Sun 18:57] =>  0:25
CLOCK: [2025-09-07 Sun 17:55]--[2025-09-07 Sun 18:20] =>  0:25
CLOCK: [2025-09-07 Sun 17:20]--[2025-09-07 Sun 17:45] =>  0:25
CLOCK: [2025-09-07 Sun 16:54]--[2025-09-07 Sun 17:19] =>  0:25
CLOCK: [2025-09-07 Sun 16:15]--[2025-09-07 Sun 16:40] =>  0:25
CLOCK: [2025-09-07 Sun 14:43]--[2025-09-07 Sun 15:08] =>  0:25
CLOCK: [2025-09-07 Sun 12:48]--[2025-09-07 Sun 13:13] =>  0:25
:END:

UIを別のpackageに移動する。
** DONE ローグライクで必要なくなった箇所を削除する
CLOSED: [2025-09-14 Sun 10:44]
:LOGBOOK:
CLOCK: [2025-09-13 Sat 18:15]--[2025-09-13 Sat 18:40] =>  0:25
CLOCK: [2025-09-13 Sat 17:47]--[2025-09-13 Sat 18:12] =>  0:25
CLOCK: [2025-09-13 Sat 17:17]--[2025-09-13 Sat 17:42] =>  0:25
CLOCK: [2025-09-13 Sat 16:31]--[2025-09-13 Sat 16:56] =>  0:25
CLOCK: [2025-09-08 Mon 22:02]--[2025-09-08 Mon 22:27] =>  0:25
CLOCK: [2025-09-08 Mon 20:31]--[2025-09-08 Mon 20:56] =>  0:25
CLOCK: [2025-09-07 Sun 22:29]--[2025-09-07 Sun 22:54] =>  0:25
:END:

- [X] 既存の戦闘を削除する
- [X] Positionを削除する
- [X] 仲間を削除する
  - InPartyを削除する
  - AliveやDeadも削除
  - TargetAlivePartyを削除する
  - HP/SPバーが消えてしまっている
** DONE HPゼロでゲームオーバー画面に遷移する
CLOSED: [2025-09-21 Sun 10:01]
:LOGBOOK:
CLOCK: [2025-09-20 Sat 21:49]--[2025-09-20 Sat 22:14] =>  0:25
CLOCK: [2025-09-20 Sat 21:23]--[2025-09-20 Sat 21:48] =>  0:25
CLOCK: [2025-09-20 Sat 20:37]--[2025-09-20 Sat 21:02] =>  0:25
CLOCK: [2025-09-20 Sat 20:06]--[2025-09-20 Sat 20:31] =>  0:25
CLOCK: [2025-09-20 Sat 19:13]--[2025-09-20 Sat 19:38] =>  0:25
CLOCK: [2025-09-20 Sat 18:07]--[2025-09-20 Sat 18:32] =>  0:25
CLOCK: [2025-09-20 Sat 17:32]--[2025-09-20 Sat 17:57] =>  0:25
CLOCK: [2025-09-20 Sat 17:05]--[2025-09-20 Sat 17:30] =>  0:25
:END:

止まっているので。

keyboardInputはグローバルに保持したほうがよくないか。
** DONE ターン世界を導入する
CLOSED: [2025-09-21 Sun 11:10]
:LOGBOOK:
CLOCK: [2025-09-18 Thu 08:17]--[2025-09-18 Thu 08:42] =>  0:25
CLOCK: [2025-09-15 Mon 15:59]--[2025-09-15 Mon 16:24] =>  0:25
CLOCK: [2025-09-15 Mon 15:33]--[2025-09-15 Mon 15:58] =>  0:25
CLOCK: [2025-09-15 Mon 13:58]--[2025-09-15 Mon 14:23] =>  0:25
CLOCK: [2025-09-15 Mon 13:27]--[2025-09-15 Mon 13:52] =>  0:25
CLOCK: [2025-09-15 Mon 12:44]--[2025-09-15 Mon 13:09] =>  0:25
CLOCK: [2025-09-15 Mon 12:19]--[2025-09-15 Mon 12:44] =>  0:25
CLOCK: [2025-09-15 Mon 10:52]--[2025-09-15 Mon 11:17] =>  0:25
CLOCK: [2025-09-15 Mon 10:27]--[2025-09-15 Mon 10:52] =>  0:25
CLOCK: [2025-09-14 Sun 20:35]--[2025-09-14 Sun 21:00] =>  0:25
CLOCK: [2025-09-14 Sun 20:09]--[2025-09-14 Sun 20:34] =>  0:25
CLOCK: [2025-09-14 Sun 19:44]--[2025-09-14 Sun 20:09] =>  0:25
CLOCK: [2025-09-14 Sun 19:19]--[2025-09-14 Sun 19:44] =>  0:25
CLOCK: [2025-09-14 Sun 18:53]--[2025-09-14 Sun 19:18] =>  0:25
CLOCK: [2025-09-14 Sun 18:23]--[2025-09-14 Sun 18:48] =>  0:25
CLOCK: [2025-09-14 Sun 17:35]--[2025-09-14 Sun 18:00] =>  0:25
CLOCK: [2025-09-14 Sun 14:48]--[2025-09-14 Sun 15:13] =>  0:25
CLOCK: [2025-09-14 Sun 14:01]--[2025-09-14 Sun 14:26] =>  0:25
CLOCK: [2025-09-14 Sun 13:31]--[2025-09-14 Sun 13:56] =>  0:25
CLOCK: [2025-09-14 Sun 13:06]--[2025-09-14 Sun 13:31] =>  0:25
CLOCK: [2025-09-14 Sun 11:39]--[2025-09-14 Sun 12:04] =>  0:25
CLOCK: [2025-09-14 Sun 11:14]--[2025-09-14 Sun 11:39] =>  0:25
CLOCK: [2025-09-14 Sun 10:44]--[2025-09-14 Sun 11:09] =>  0:25
:END:
- [X] ターンベースシステムを導入する
- [X] 移動などを対応させる
- [X] ローグライク式に戦闘できるようにする
- [X] action points を TurnBasedにする
- [X] 足踏みできるようにする

メモ。

- [X] キャラクターAP100を仮定せず、実際の値を取得して
- [X] depguardを使ってv1をガードして
** DONE パラメータ設計
CLOSED: [2025-09-21 Sun 11:10]
:LOGBOOK:
CLOCK: [2025-09-20 Sat 13:15]--[2025-09-20 Sat 13:40] =>  0:25
CLOCK: [2025-09-20 Sat 11:13]--[2025-09-20 Sat 11:38] =>  0:25
:END:

- HP(体力)
- EP(電気) -- 特殊行動。装備によって回復方法が異なる
- SP(スタミナ) -- ダッシュなど。空腹度を消費して短時間に回復する
- 空腹度。速度・スタミナペナルティが出る。さまざまな回復アイテムがある
** DONE engineの再設計・リファクタリング
CLOSED: [2025-09-23 Tue 09:56]
:LOGBOOK:
CLOCK: [2025-09-22 Mon 21:43]--[2025-09-22 Mon 22:08] =>  0:25
CLOCK: [2025-09-22 Mon 20:56]--[2025-09-22 Mon 21:21] =>  0:25
CLOCK: [2025-09-21 Sun 22:15]--[2025-09-21 Sun 22:40] =>  0:25
CLOCK: [2025-09-21 Sun 21:47]--[2025-09-21 Sun 22:12] =>  0:25
CLOCK: [2025-09-21 Sun 21:21]--[2025-09-21 Sun 21:46] =>  0:25
CLOCK: [2025-09-21 Sun 20:54]--[2025-09-21 Sun 21:19] =>  0:25
CLOCK: [2025-09-21 Sun 20:19]--[2025-09-21 Sun 20:44] =>  0:25
CLOCK: [2025-09-21 Sun 19:18]--[2025-09-21 Sun 19:43] =>  0:25
CLOCK: [2025-09-21 Sun 18:43]--[2025-09-21 Sun 19:08] =>  0:25
CLOCK: [2025-09-21 Sun 17:42]--[2025-09-21 Sun 18:07] =>  0:25
CLOCK: [2025-09-21 Sun 17:17]--[2025-09-21 Sun 17:42] =>  0:25
CLOCK: [2025-09-21 Sun 12:54]--[2025-09-21 Sun 13:19] =>  0:25
CLOCK: [2025-09-21 Sun 12:17]--[2025-09-21 Sun 12:42] =>  0:25
CLOCK: [2025-09-21 Sun 11:38]--[2025-09-21 Sun 12:03] =>  0:25
:END:

- 使いにくい
- 使い分けが不明瞭
- interface{}が多い
- 静的ファイルは一箇所にまとめたいので、embed packageを作ってそれを呼び出すようにしたい
- それをパースするパッケージ

構造。

- assets/assets.go (ファイルembed)
- engine
  - resources
** DONE セーブデータJSONをソートする
CLOSED: [2025-09-23 Tue 16:33]
:LOGBOOK:
CLOCK: [2025-09-23 Tue 14:59]--[2025-09-23 Tue 15:24] =>  0:25
CLOCK: [2025-09-23 Tue 11:05]--[2025-09-23 Tue 11:30] =>  0:25
CLOCK: [2025-08-21 Thu 16:33]--[2025-08-21 Thu 16:58] =>  0:25
CLOCK: [2025-08-21 Thu 16:04]--[2025-08-21 Thu 16:29] =>  0:25
:END:

毎回差分が出て何が変わったかわかりにくいのでソートして保存する。
** DONE タイプライターを使うように置き換える
CLOSED: [2025-09-23 Tue 16:33]
:LOGBOOK:
CLOCK: [2025-08-05 Tue 19:10]--[2025-08-05 Tue 19:35] =>  0:25
CLOCK: [2025-07-26 Sat 22:19]--[2025-07-26 Sat 22:44] =>  0:25
CLOCK: [2025-07-26 Sat 21:54]--[2025-07-26 Sat 22:19] =>  0:25
CLOCK: [2025-07-26 Sat 21:24]--[2025-07-26 Sat 21:49] =>  0:25
CLOCK: [2025-07-26 Sat 20:59]--[2025-07-26 Sat 21:24] =>  0:25
CLOCK: [2025-07-26 Sat 20:34]--[2025-07-26 Sat 20:59] =>  0:25
CLOCK: [2025-07-26 Sat 20:01]--[2025-07-26 Sat 20:26] =>  0:25
CLOCK: [2025-07-26 Sat 19:31]--[2025-07-26 Sat 19:56] =>  0:25
:END:

- [X] intro
- battle
